#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет документ по основанию.
//
// Параметры:
//  Объект			 - ДокументСсылка.упоРегистрацияФактическихДвиженийДенежныхСредств - заполняемый документ.
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - ПЗ, на основании которой заполняется документ.
//  Версия			 - ДокументСсылка.упоВерсияПланаПроекта - версия плана проекта.
//
Процедура ЗаполнитьДокументПоОснованию(Объект, ПроектнаяЗадача, Версия = Неопределено) Экспорт 
	
	Объект.ДвиженияДенежныхСредств.Очистить();
	ПараметрыЗапроса = Новый Структура("ПроектнаяЗадача", ПроектнаяЗадача);
	ПараметрыЗапроса.Вставить("Версия", Версия);
	
	// простой режим - забираем данные из текущего плана		
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РегПлан.СтатьяДДС,
		|	РегПлан.НаправлениеДвижения,
		|	РегПлан.Контрагент,
		|	РегПлан.Договор,
		|	РегПлан.Валюта,
		|	РегПлан.ВидПлатежа,	
		|	РегПлан.ДатаДвижения,
		|	СУММА(РегПлан.СуммаВалютная) КАК Сумма
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &ПроектнаяЗадача
		|				И Версия = &Версия) КАК РегПлан
		|ГДЕ
		|	РегПлан.СуммаВалютная > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РегПлан.ДатаДвижения,
		|	РегПлан.Договор,
		|	РегПлан.ВидПлатежа,
		|	РегПлан.Валюта,
		|	РегПлан.Контрагент,
		|	РегПлан.НаправлениеДвижения,
		|	РегПлан.СтатьяДДС";
	
	// извлекаем данные запросом
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса);
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	
	// и переливаем их в табличную часть	
	Для Каждого СтрокаТЗ Из ТаблицаЗапроса Цикл
		
		НоваяСтрока = Объект.ДвиженияДенежныхСредств.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		
	КонецЦикла;
	
КонецПроцедуры

// Производит свертку таблицы движений регистра упоФактДвиженийДенежныхСредств.
//
// Параметры:
//  ТаблицаДвижения - ТаблицаЗначений - таблица движений, по которой производим свертку.
//
Процедура ПодготовитьДанныеупоФактДвиженийДенежныхСредств(ТаблицаДвижения) Экспорт
	
	МассивПолейСумм = Новый Массив;
	КолонкиСуммы = Новый Соответствие;
	Для Каждого Реквизит Из Метаданные.РегистрыСведений.упоФактДвиженийДенежныхСредств.Ресурсы Цикл
		КолонкиСуммы.Вставить(Реквизит.Имя, Истина);
		МассивПолейСумм.Добавить(Реквизит.Имя);
	КонецЦикла;
	СтрокаСумм = СтрСоединить(МассивПолейСумм, ", ");
	
	КолонкиИсключения = Новый Соответствие;
	ПустыеЗначения = Новый Структура;
	Для Каждого Реквизит Из Метаданные.РегистрыСведений.упоФактДвиженийДенежныхСредств.Реквизиты Цикл
		КолонкиИсключения.Вставить(Реквизит.Имя, Истина);
		ПустыеЗначения.Вставить(Реквизит.Имя, Неопределено);
	КонецЦикла;			
	
	ТаблицаДвиженияДляСвертки = ТаблицаДвижения.Скопировать();
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ТаблицаДвиженияДляСвертки, КолонкиСуммы, КолонкиИсключения);
	
	Если ТаблицаДвижения.Количество() = ТаблицаДвиженияДляСвертки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Для Каждого Колонка Из ТаблицаДвижения.Колонки Цикл
		Если КолонкиСуммы[Колонка.Имя] = Неопределено
			И КолонкиИсключения[Колонка.Имя] = Неопределено Тогда
			Отбор.Вставить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;			
	
	// Удалим дубли строк таблицы движений, заменив ресурсы регистра значениями из свертки.
	СтрокиНаУдаление = Новый Массив;			
	Для Каждого Строка Из ТаблицаДвиженияДляСвертки Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		
		НайденныеСтроки = ТаблицаДвижения.НайтиСтроки(Отбор);	
		
		Если НайденныеСтроки.Количество() <= 1 Тогда
			Продолжить;
		КонецЕсли;				
		
		НайденнаяСтрока = НайденныеСтроки[0];
		
		ЗаполнитьЗначенияСвойств(НайденнаяСтрока, Строка, СтрокаСумм);
		
		// Обнулим значения реквизитов регистра.
		ЗаполнитьЗначенияСвойств(НайденнаяСтрока, ПустыеЗначения);
		
		Для Счетчик = 1 По НайденныеСтроки.Количество() - 1 Цикл
			ТаблицаДвижения.Удалить(НайденныеСтроки[Счетчик]);
		КонецЦикла;				
		
	КонецЦикла;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Проект)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоРегистрацияФактическихДвиженийДенежныхСредств);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли