
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем мВалютаУправленческогоУчета Экспорт; // Хранит валюту упр. учета из константы ВалютаУправленческогоУчета.

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		СтруктураОбязательныхПолей.Вставить("ПроектнаяЗадача");
	ИначеЕсли ИмяТабличнойЧасти = "ДвиженияДенежныхСредств" Тогда
		СтруктураОбязательныхПолей.Вставить("НаправлениеДвижения");
		СтруктураОбязательныхПолей.Вставить("ДатаДвижения");
		СтруктураОбязательныхПолей.Вставить("Сумма");
		СтруктураОбязательныхПолей.Вставить("Валюта");
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет все необходимые данные документа для его записи в ИБ.
// 
// Параметры:
//  Отказ        - Булево - признак отказа от выполнения операции.
// 
Процедура ПроверитьДанныеПередЗаписью(Отказ) Экспорт
	
	// Получим заголовок для сообщения об ошибках при записи объекта.
	Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	
	// Проверяем заполненность обязательных реквизитов.
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьДанныеПередЗаписью()

// Процедура проверяет все необходимые данные документа для его проведения.
// 
// Параметры: 
//  ДанныеДокумента - Тип: Структура, содержит слепок документа.
//  Отказ           - Тип: Булево. Признак отказа от выполнения операции.
//  Заголовок       - Тип: Строка. Содержит заголовок сообщения. 
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - признак отказа от выполнения операции.
//  Заголовок    - Строка - содержит заголовок сообщения.
//
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Функция формирует структуру обязательных реквизитов шапки для заданной табличной части документа.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	
	
КонецФункции

// Функция формирует нужную таблицу значений для загрузки в табличную часть.
// 
// Параметры:
//  ИмяТабличнойЧасти - Строка - Имя табличной части.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Готовая таблица значений.
// 
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	
	
КонецФункции

// Процедура для вызова при подборе ресурсов.
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти	 - строка табличной части "ДвиженияДенежныхСредств". 
//  ПараметрыПодбора	 - СписокЗначений со вспомогательными параметрами.
//
Процедура ВыполнитьДействияПриПодборе(Знач СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт
	
	Если НЕ ПараметрыПодбора = Неопределено Тогда      
		
		Для каждого ПараметрПодбора Из ПараметрыПодбора Цикл
			
			// прямое обращение к реквизитам на всякий случай оборачиваем в try
			Попытка 				
				Если ПараметрПодбора.Представление = "ИмяТабличнойЧасти" Тогда      					
					Если ПараметрПодбора.Значение = "ДвиженияДенежныхСредств" Тогда     
						
						// попробуем определить договор контрагента по умолчанию
						
						Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Контрагент) Тогда      
							СтрокаТабличнойЧасти.Договор = СтрокаТабличнойЧасти.Контрагент.упоОсновнойДоговорКонтрагента;
						КонецЕсли;
						Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда      
							СтрокаТабличнойЧасти.Валюта = упоУправлениеФормамиСервер.ПолучитьВалютуДоговораКонтрагента(СтрокаТабличнойЧасти.Договор);
						Иначе
							СтрокаТабличнойЧасти.Валюта = мВалютаУправленческогоУчета;
						КонецЕсли;
					КонецЕсли; 			
					
					Продолжить;
				КонецЕсли; 
				
			// устанавливаем только те колонки, которые еще не были заполнены пользователем.
				
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти[ПараметрПодбора.Представление]) Тогда    
				Если ТипЗнч(ПараметрПодбора.Значение) = Тип("ПеречислениеСсылка.упоНаправлениеДвиженияДенежныхСредств") Тогда
					Попытка
						Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтатьяДДС) 
							И ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтатьяДДС.упоНаправлениеДвижения) Тогда
							
							СтрокаТабличнойЧасти.НаправлениеДвижения = СтрокаТабличнойЧасти.СтатьяДДС.упоНаправлениеДвижения;
							
						Иначе
							СтрокаТабличнойЧасти[ПараметрПодбора.Представление]	= ПараметрПодбора.Значение;	
						КонецЕсли; 
					Исключение
						// Прямое обращение к реквизитам строки вне точного контекста
						// на всякий случай заворачиваем в try.
					КонецПопытки;	
				КонецЕсли;
			КонецЕсли; 			
				
			Исключение
				// некорректное имя колонки.
			КонецПопытки;
			
		КонецЦикла; 
		
	Иначе
		упоРесурсыИНормыВызовСервера.обПриИзмененииРесурсаТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);	
	КонецЕсли; 

КонецПроцедуры // ЗаписатьСсылку()

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать
	// Если требуется добавлять в запись реквизиты шапки, отмечаем их
	// префиксом "Шапка_". 
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоФактДвиженийДенежныхСредств.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ДвиженияДенежныхСредств", ПравилаТаблицы);
	
	// Делаем одно движение по ТЧ
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеФактаДДС", ПравилаДвижения);
	
	// Правила связи
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Контрагент", "Контрагент");
	ПравилаДвижения.Вставить("Договор", "Договор");
	ПравилаДвижения.Вставить("СтатьяДДС", "СтатьяДДС");
	ПравилаДвижения.Вставить("ВидПлатежа", "ВидПлатежа");
	ПравилаДвижения.Вставить("НаправлениеДвижения", "НаправлениеДвижения");
	ПравилаДвижения.Вставить("ДатаДвижения", "ДатаДвижения");
	ПравилаДвижения.Вставить("Валюта", "Валюта");
	ПравилаДвижения.Вставить("СуммаВалютная", "Сумма");
	ПравилаДвижения.Вставить("КомментарийДвижения", "КомментарийДвижения");
	ПравилаДвижения.Вставить("ДатаПлатежногоДокумента", "ДатаПлатежногоДокумента");
	ПравилаДвижения.Вставить("НомерПлатежногоДокумента", "НомерПлатежногоДокумента");
		
	Возврат ПравилаНаложения; 

КонецФункции // ПолучитьПравилаНаложенияРеквизитовНаРегистр()
 
// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт

	// Здесь можно расположить бизнес-логику дополнительной обработки
	// данных движений регистров.
	
	Для каждого Движение Из Движения Цикл
		
		ИмяДвижения = Движение.Метаданные().Имя;
		
		ТаблицаДвижения = ДанныеДвижений[ИмяДвижения];
		упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвижения);
		
		// Свертка данных по упоФактДвиженийДенежныхСредств
		Если ИмяДвижения = "упоФактДвиженийДенежныхСредств" Тогда
			
			Документы.упоРегистрацияФактическихДвиженийДенежныхСредств.ПодготовитьДанныеупоФактДвиженийДенежныхСредств(ТаблицаДвижения);			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПодготовитьДанныеДвижений()

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание)=Тип("Неопределено") Тогда 
		Возврат;
	КонецЕсли; 
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		ПроектнаяЗадача = Основание;
		Проект = Основание.Проект;
		
		Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
		Документы.упоРегистрацияФактическихДвиженийДенежныхСредств.ЗаполнитьДокументПоОснованию(ЭтотОбъект, ПроектнаяЗадача,Версия); 
	ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.Проекты") Тогда
		Проект = Основание;
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьДанныеПередЗаписью(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаТаб = Таблица.Добавить();
	Если ЗначениеЗаполнено(Проект) Тогда
		СтрокаТаб.ЗначениеДоступа = Проект;
	Иначе
		СтрокаТаб.ЗначениеДоступа = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Инициализация

мВалютаУправленческогоУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли
