
#Область СлужебныйПрограммныйИнтерфейс

#Область РасчетПроекта

Функция ПолучитьСтруктуруПараметровСтроки(ВсеПараметры = Истина, Сроки = Ложь, РасчетныеСроки = Ложь,
	ЕдиницаИзмерения = Ложь, Длительность = Ложь, ОтклонениеИзменилось = Ложь, Доп = Ложь) Экспорт
	
	Результат = Новый Структура("ИдСтроки, ЭтоФантом");
	
	Если ВсеПараметры ИЛИ Сроки Тогда
		Результат.Вставить("ДатаНачала");	
		Результат.Вставить("ДатаЗавершения");
		Результат.Вставить("ДлительностьКалендарныеДни");
		Результат.Вставить("ОтставаниеОтТекПлана");
	КонецЕсли;
	
	Если ВсеПараметры ИЛИ Длительность Тогда
		Результат.Вставить("Длительность");
		Результат.Вставить("ДлительностьКалендарныеДни");
	КонецЕсли;
	
	Если ВсеПараметры ИЛИ РасчетныеСроки Тогда
		Результат.Вставить("РаннийСтарт");	
		Результат.Вставить("РаннийФиниш");	
		Результат.Вставить("ПозднийСтарт");	
		Результат.Вставить("ПозднийФиниш");	
		Результат.Вставить("КритическийПуть");
		Результат.Вставить("БуферПозднийСтартРаннийСтарт");
		Результат.Вставить("ДлительностьКалендарныеДни");
		Результат.Вставить("ОтставаниеОтТекПлана");
	КонецЕсли;	
	
	Если ВсеПараметры ИЛИ ЕдиницаИзмерения Тогда
		Результат.Вставить("ЕдиницаИзмерения");
	КонецЕсли;
	
	Если ВсеПараметры ИЛИ Доп Тогда
		Результат.Вставить("ИдСтрокиРодителя");	
		Результат.Вставить("ТипЗадачи");	
		Результат.Вставить("РежимВвода");	
		Результат.Вставить("Статус");
		Результат.Вставить("ПроцентГотовности");
		Результат.Вставить("ТрудозатратыТП");
		Результат.Вставить("ТрудозатратыТП_ОкончРоли");
		Результат.Вставить("ДлительностьБезУчетаКалендаряПроекта");
		Результат.Вставить("КалендарьЗадачи"); 
		Результат.Вставить("КодСДР");
		Результат.Вставить("НазваниеЗадачи");
	КонецЕсли;
	
	Если ВсеПараметры ИЛИ ОтклонениеИзменилось Тогда
		Результат.Вставить("ОтклонениеПоОкончанию");
		Результат.Вставить("ОтклонениеПоОкончаниюДП");
		Результат.Вставить("ОтклонениеПоНачалуБП");
		Результат.Вставить("ОтклонениеПоНачалуДП");
		Результат.Вставить("ОтклонениеПоНачалуОтВерсии");
		Результат.Вставить("ОтклонениеПоОкончаниюОтВерсии");
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область МеханизмПередачиИзмененийМеждуСерверомКлиентом

Функция ПреобразоватьСоответствиеСтруктурВМассивМассивов(СоответствиеСтруктур) Экспорт
	
	МассивМассивов = Новый Массив;
	
	Если СоответствиеСтруктур.Количество() = 0 Тогда 
		Возврат МассивМассивов;
	КонецЕсли;
	
	МассивПолей = Новый Массив;	
	Для Каждого КлючЗначениеСоответствия Из СоответствиеСтруктур Цикл
		МассивПолей.Добавить("КлючСоответствия");
		сч = 1;	
		Для Каждого КлючЗначениеСтруктуры Из КлючЗначениеСоответствия.Значение Цикл
			МассивПолей.Добавить(КлючЗначениеСтруктуры.Ключ);
			сч = сч + 1;
		КонецЦикла;
		МассивМассивов.Добавить(МассивПолей);
		Прервать;
	КонецЦикла;
	
	КоличествоПолей = МассивПолей.Количество();
	
	Для Каждого КлючЗначениеСоответствия Из СоответствиеСтруктур Цикл
		МассиТекЗначений = Новый Массив;
		Для сч = 0 По КоличествоПолей-1 Цикл
			ИмяПоля = МассивПолей[сч];	
			Если ИмяПоля = "КлючСоответствия" Тогда
				МассиТекЗначений.Добавить(КлючЗначениеСоответствия.Ключ);
			Иначе
				МассиТекЗначений.Добавить(КлючЗначениеСоответствия.Значение[ИмяПоля]);
			КонецЕсли;
		КонецЦикла;		
		МассивМассивов.Добавить(МассиТекЗначений);
	КонецЦикла;	
	
	Возврат МассивМассивов;
	
КонецФункции

Функция ПреобразоватьМассивМассивовВСоответсвиеСтруктур(МассивМассивов) Экспорт
	
	СоответсвиеСтруктур = Новый Соответствие;
	
	Если МассивМассивов.Количество() = 0 Тогда
		Возврат СоответсвиеСтруктур;
	КонецЕсли;
	
	МассивПолей = МассивМассивов[0];
	
	КоличествоЭлементов = МассивМассивов.Количество();	
	КоличествоПолей = МассивПолей.Количество();
	
	Для сч = 1 По КоличествоЭлементов-1 Цикл		
		Структура = Новый Структура;
		Ключ = Неопределено;
		Массив = МассивМассивов[сч];
		сч_полей = 0;
		Для сч_полей = 0 По КоличествоПолей-1 Цикл
			ИмяПоля = МассивПолей[сч_полей];
			ЗначениеПоля = Массив[сч_полей];
			Если ИмяПоля = "КлючСоответствия" Тогда
				Ключ = ЗначениеПоля;
			Иначе
				Структура.Вставить(ИмяПоля, ЗначениеПоля);
			КонецЕсли;
			СоответсвиеСтруктур.Вставить(Ключ, Структура);
		КонецЦикла;
	КонецЦикла;
	
	Возврат СоответсвиеСтруктур;
	
КонецФункции 

#КонецОбласти

#Область РаботаСДиаграммойГанта

Функция ПолучитьТипСвязиУПОпоСтроке(строкаСвязи) Экспорт
	
	Возврат упоСтруктураПроектаКлиентСерверПовтИсп.ПолучитьТипСвязиУПОпоСтроке(строкаСвязи);
	
КонецФункции

Функция ПолучитьСтрокуПоТипуСвязиУПО(ТипСвязиУПО) Экспорт
	
	Возврат упоСтруктураПроектаКлиентСерверПовтИсп.ПолучитьСтрокуПоТипуСвязиУПО(ТипСвязиУПО);
	
КонецФункции

Функция ПолучитьСоответствиеТипСвязиPMПоСтроке() Экспорт 
	
	Возврат упоСтруктураПроектаКлиентСерверПовтИсп.ПолучитьСоответствиеТипСвязиPMПоСтроке();
		
КонецФункции

Функция ПолучитьСоответствиеСтрокиПоТипуСвязиPM() Экспорт 
	
	Возврат упоСтруктураПроектаКлиентСерверПовтИсп.ПолучитьСоответствиеСтрокиПоТипуСвязиPM();
		
КонецФункции

#КонецОбласти

#Область ПредставлениеКолонок

Функция СформироватьПредставлениеПоДаннымСоответствия(СоответствиеДанныеСтроки, СоответствиеДанныеСтрокиЭтап = Неопределено, ФорматКолонок = "") Экспорт
	
	мСтрок = Новый Массив;
	Если СоответствиеДанныеСтрокиЭтап = Неопределено Тогда
		СоответствиеДанныеСтрокиЭтап = Новый Соответствие;
	КонецЕсли;	
	
	ПоляГруппировки = Новый СписокЗначений;
	Для Каждого СтрокаСоответствия Из СоответствиеДанныеСтроки Цикл
		ПоляГруппировки.Добавить(СтрокаСоответствия.Ключ);
	КонецЦикла;
	Для Каждого СтрокаСоответствия Из СоответствиеДанныеСтрокиЭтап Цикл
		Если ПоляГруппировки.НайтиПоЗначению(СтрокаСоответствия.Ключ) = Неопределено Тогда
			ПоляГруппировки.Добавить(СтрокаСоответствия.Ключ);
		КонецЕсли;	
	КонецЦикла;
	ПоляГруппировки.СортироватьПоЗначению();
	
	Для Каждого Строка Из ПоляГруппировки Цикл
		ЗначениеСтроки = СоответствиеДанныеСтроки.Получить(Строка.Значение);
		ЗначениеЭтап = СоответствиеДанныеСтрокиЭтап.Получить(Строка.Значение);
		Если ЗначениеСтроки = Неопределено Тогда
			ШаблонТекста = "%2 %1";
		ИначеЕсли ЗначениеЭтап = Неопределено Тогда
			ШаблонТекста = "%3 %1";
		Иначе
			ШаблонТекста = "%2 [%3] %1";
		КонецЕсли;	
		ТекстПредставления = СтрШаблон(ШаблонТекста, 
										Строка.Значение, 
										?(ЗначениеЭтап = Неопределено, Неопределено, Формат(ЗначениеЭтап, ФорматКолонок)),
										?(ЗначениеСтроки = Неопределено, Неопределено, Формат(ЗначениеСтроки, ФорматКолонок)));
		мСтрок.Добавить(ТекстПредставления);
	КонецЦикла;
	
	Возврат СтрСоединить(мСтрок, ", ");
	
КонецФункции

#КонецОбласти

#Область НастройкиПроизводительности

Функция СписокНастроекПроизводительностиСтруктурыПроекта() Экспорт
	
	НастройкиПроизводительности = Новый Структура;
	
	ЗначенияНастройки = Новый Структура("Наименование, НастройкаПоУмолчанию", 
		НСтр("ru = 'Пересчитывать в фоновом режиме'"), Истина);
	НастройкиПроизводительности.Вставить("ПересчитыватьФоново", ЗначенияНастройки);
	
	ЗначенияНастройки = Новый Структура("Наименование, НастройкаПоУмолчанию", 
		НСтр("ru = 'Пересчитывать в две очереди'"), Ложь);
	НастройкиПроизводительности.Вставить("ПересчитыватьФоновоВДвеОчереди", ЗначенияНастройки);
	
	ЗначенияНастройки = Новый Структура("Наименование, НастройкаПоУмолчанию", 
		НСтр("ru = 'Не считать расчетные сроки и критический путь'"), Ложь);
	НастройкиПроизводительности.Вставить("НеСчитатьРасчетныеСрокиИКритическийПуть", ЗначенияНастройки);
	
	ЗначенияНастройки = Новый Структура("Наименование, НастройкаПоУмолчанию", 
		НСтр("ru = 'Пересчитывать только измененные задачи'"), Ложь);
	НастройкиПроизводительности.Вставить("ПересчитыватьТолькоИзмененныеЗадачи", ЗначенияНастройки);
	
	ЗначенияНастройки = Новый Структура("Наименование, НастройкаПоУмолчанию", 
		НСтр("ru = 'Не обновлять после записи'"), Ложь);
	НастройкиПроизводительности.Вставить("НеОбновлятьПослеЗаписи", ЗначенияНастройки);
	
	ЗначенияНастройки = Новый Структура("Наименование, НастройкаПоУмолчанию", 
		НСтр("ru = 'Не обновлять после проведения задачи'"), Ложь);
	НастройкиПроизводительности.Вставить("НеОбновлятьПослеПроведенияЗадачи", ЗначенияНастройки);
	
	ЗначенияНастройки = Новый Структура("Наименование, НастройкаПоУмолчанию", 
		НСтр("ru = 'Не использовать отмену и повторение действий'"), Ложь);
	НастройкиПроизводительности.Вставить("НеИспользоватьОтменуИПовторениеДействий", ЗначенияНастройки);
	
	ЗначенияНастройки = Новый Структура("Наименование, НастройкаПоУмолчанию", 
		НСтр("ru = 'Отключить запоминание и синхронизацию развернутых строк'"), Ложь);
	НастройкиПроизводительности.Вставить("ОтключитьСинхронизациюРазвернутыхСтрок", ЗначенияНастройки);
	
	ЗначенияНастройки = Новый Структура("Наименование, НастройкаПоУмолчанию", 
		НСтр("ru = 'Кешировать показатели'"), Ложь);
	НастройкиПроизводительности.Вставить("КешироватьПоказатели", ЗначенияНастройки);
	
	Возврат НастройкиПроизводительности;
	
КонецФункции

Функция ИмяОбъектаХранящегоНастройкиПроизводительностиСтруктурыПроекта() Экспорт
	
	ИмяОбъекта = "Обработка.упоУпрощенныйВводСтруктурыПроекта";
	Возврат ИмяОбъекта;
	
КонецФункции

#КонецОбласти

#КонецОбласти
