#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает схему компоновки данных на основании настроек правила отражения.
//
// Параметры:
//  Правило  - СправочникСсылка.упоПравилаПолученияФактаДляПроектногоБюджетирования - правило отражения факта.
//  ИсключениеПриОшибке  - Булево - флаг необходимости вызова исключения при ошибке, выставляется при вызове из формы.
//  ТекстИсключения  - Строка - текст исключения.
//
// Возвращаемое значение:
//   СхемаКомпоновкиДанных - схема компоновки данных правила.
//
Функция СхемаКомпоновкиДанныхПоНастройкам(Правило, ИсключениеПриОшибке = Истина, ТекстИсключения = "") Экспорт
	
	СКД = Неопределено;
	
	ПредопределенныеТипы = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования.ПредопределенныеТипыПравилОтражения();
				
	Если ПредопределенныеТипы.Найти(Правило.ТипПравила) <> Неопределено Тогда					
		// Схемы из макетов.		 											
		ИмяМакета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1_%2", 
			упоПроектноеБюджетированиеСервер.ИмяПеречисленияПоЗначению(Правило.Раздел), 
			упоПроектноеБюджетированиеСервер.ИмяПеречисленияПоЗначению(Правило.ТипПравила));		
		СКД = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования.ПолучитьМакет(ИмяМакета);	
	ИначеЕсли Правило.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.Бюджетирование 
		И упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		// Схема из правила бюджетирования. Только для ERP.				 
		Если НЕ ЗначениеЗаполнено(Правило.ПравилоПолученияФактаПоСтатьямБюджетов) Тогда
			СКД = ПустаяСхемаКомпоновкиДанных();
		Иначе			
			МодульБюджетированиеСервер = ОбщегоНазначения.ОбщийМодуль("БюджетированиеСервер");
			МодульИсточникиДанныхСервер = ОбщегоНазначения.ОбщийМодуль("ИсточникиДанныхСервер");
			СКД = МодульИсточникиДанныхСервер.СхемаКомпоновкиДанныхПравила(Правило.ПравилоПолученияФактаПоСтатьямБюджетов);
			МодульБюджетированиеСервер.УстановитьСвойстваПолейДляНастройкиПравила(СКД, Правило.ПравилоПолученияФактаПоСтатьямБюджетов);
		КонецЕсли;	
	ИначеЕсли Правило.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.ПроизвольныйЗапрос Тогда
		// Схема из сохраненных настроек.		
		СКД = Правило.СхемаКомпоновкиДанных.Получить();					
		Если СКД = Неопределено Тогда
			СКД = ПустаяСхемаКомпоновкиДанных();		
		КонецЕсли;	
	Иначе
		ТекстИсключения = НСтр("ru = 'Не определен тип правила отражения. Получение схемы невозможно.'");
		Если ИсключениеПриОшибке Тогда
			ВызватьИсключение ТекстИсключения;	
		КонецЕсли;	
	КонецЕсли;	
			
	Возврат СКД;
	
КонецФункции

// Возвращает типы документов правила отражения факта: для указанного правила или для всех правил системы.
//
// Параметры:
//  Правила  - СправочникСсылка.упоПравилаПолученияФактаДляПроектногоБюджетирования, Массив, Неопределено 
//			 - правило отражения факта.
//
// Возвращаемое значение:
//   Массив - Тип - типы документов правила.
//
Функция ТипыДокументовПравила(Правила = Неопределено) Экспорт
	
	МассивТипов = Новый Массив;	
	ШаблонТипа = "ДокументСсылка.%1";
		
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.ТипДокумента КАК ТипДокумента
	               |ИЗ
	               |	Справочник.упоПравилаПолученияФактаДляПроектногоБюджетирования.ТипыДокументов КАК упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов
	               |ГДЕ
	               |	упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.Ссылка В(&Правила)
	               |	И НЕ упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.ТипДокумента = """"";	
	
	Если Правила = Неопределено Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		
		ТекстОтбор = "Не упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.Ссылка.ОтключитьПравило 
			|И Не упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.Ссылка.ПометкаУдаления";
		
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор[0] = Новый ВыражениеСхемыЗапроса(ТекстОтбор);
		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();		
	КонецЕсли;	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Правила", Правила);

	Результат = Запрос.Выполнить();	
	Если Результат.Пустой() Тогда
		Возврат МассивТипов;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 				
		ТипДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТипа, Выборка.ТипДокумента);
		МассивТипов.Добавить(Тип(ТипДокумента));											
	КонецЦикла;
	
	Возврат МассивТипов;
	
КонецФункции

// Проверяет, существует ли для данного документа используемое правило проектного бюджетирования.
//
// Параметры:
//  Документ  - ДокументСсылка - проверяемый документ.
//
// Возвращаемое значение:
//   Булево - правило существует.
//
Функция ЕстьПравилоДляДокумента(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ТипДокументаСтрока = Документ.Метаданные().Имя;
					
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокументаСтрока);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.упоПравилаПолученияФактаДляПроектногоБюджетирования.ТипыДокументов КАК упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов
	               |ГДЕ
	               |	упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.ТипДокумента = &ТипДокумента
	               |	И НЕ упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.Ссылка.ОтключитьПравило
	               |	И НЕ упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.Ссылка.ПометкаУдаления";	
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
			
КонецФункции	

// Возвращает правила отражения факта по типам документов.
//
// Параметры:
//  ТипыДокументов - Массив - Тип - проверяемые типы документов.
//  ПравилоИсключение - СправочникСсылка.упоПравилаПолученияФактаДляПроектногоБюджетирования -
//   правило отражения факта, исключаемое из результата.
//
// Возвращаемое значение:
//   Массив - СправочникСсылка.упоПравилаПолученияФактаДляПроектногоБюджетирования - правила отражения факта.
//
Функция ПравилаОтраженияПоТипамДокументов(ТипыДокументов, ПравилоИсключение = Неопределено) Экспорт
	
	СуществующиеПравила = Новый Массив;
	
	Если ПравилоИсключение = Неопределено Тогда
		ПравилоИсключение = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования.ПустаяСсылка()	
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.Ссылка КАК Правило
	                      |ИЗ
	                      |	Справочник.упоПравилаПолученияФактаДляПроектногоБюджетирования.ТипыДокументов КАК упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов
	                      |ГДЕ
	                      |	упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.ТипДокумента В(&ТипыДокументов)
						  |	И НЕ упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.Ссылка.ПометкаУдаления
						  |	И НЕ упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.Ссылка.ОтключитьПравило
	                      |	И НЕ упоПравилаПолученияФактаДляПроектногоБюджетированияТипыДокументов.Ссылка = &ПравилоИсключение");
	Запрос.УстановитьПараметр("ТипыДокументов", ТипыДокументов);
	Запрос.УстановитьПараметр("ПравилоИсключение", ПравилоИсключение);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		СуществующиеПравила = Результат.Выгрузить().ВыгрузитьКолонку("Правило");
	КонецЕсли;	
	
	Возврат СуществующиеПравила;
	
КонецФункции

// Возвращает предопределенные типы правил отражения факта.
//
// Возвращаемое значение:
//  Массив - ПеречислениеСсылка.упоТипыПравилПроектногоБюджетирования - типы правил отражения.
//
Функция ПредопределенныеТипыПравилОтражения() Экспорт
		
	ПредопределенныеТипы = Новый Массив;
	ПредопределенныеТипы.Добавить(Перечисления.упоТипыПравилПроектногоБюджетирования.АктивыПассивы);
	ПредопределенныеТипы.Добавить(Перечисления.упоТипыПравилПроектногоБюджетирования.ВыручкаИСебестоимостьПродаж);
	ПредопределенныеТипы.Добавить(Перечисления.упоТипыПравилПроектногоБюджетирования.ПрочиеРасходы);

	Возврат ПредопределенныеТипы;
	
КонецФункции	

// Добавляет к типам значения аналитик статьи бюджета типы, конвертируемые из регистров соответствия ERP-PM 
// и других источников соответствия, описанных в процедурах получения факта из источников ERP.
//
// Параметры:
//  ТипЗначенияАналитики  - ОписаниеТипов - тип значения аналитики.
//
// Возвращаемое значение:
//  ОписаниеТипов - расширенный тип значения аналитики.
//
Функция РасширенныйТипЗначенияАналитики(ТипЗначенияАналитики) Экспорт
	
	РасширенныйТипЗначенияАналитики = ТипЗначенияАналитики;
	
	РасширениеТиповАналитикиERP = РасширениеТиповАналитикиERP();
	
	МассивДобавляемыхТипов = Новый Массив;
	Для Каждого ТипРасширения Из РасширениеТиповАналитикиERP Цикл						
		Если ТипЗначенияАналитики.СодержитТип(ТипРасширения.Ключ) Тогда
			Если ТипЗНЧ(ТипРасширения.Значение) = Тип("Массив") Тогда
				Для Каждого ДобавляемыйТип Из ТипРасширения.Значение Цикл
					МассивДобавляемыхТипов.Добавить(ДобавляемыйТип);
				КонецЦикла;
			Иначе
				МассивДобавляемыхТипов.Добавить(ТипРасширения.Значение);
			КонецЕсли;
		КонецЕсли;										
	КонецЦикла;	
	Если МассивДобавляемыхТипов.Количество() > 0 Тогда
		РасширенныйТипЗначенияАналитики = Новый ОписаниеТипов(ТипЗначенияАналитики, МассивДобавляемыхТипов);	
	КонецЕсли;
	
	Возврат РасширенныйТипЗначенияАналитики;
	
КонецФункции

// Вызывает фоновую процедуру регистрации документов к отражению ЗарегистрироватьДокументыКОтражениюПоПравилу().
//
// Параметры:
//  ПараметрыВыполнения  - Структура, Массив - параметры выполнения процедуры.
//  АдресХранилища - Строка - адрес хранилища для помещения результата выполнения.
//
Процедура ЗарегистрироватьДокументыКОтражениюПоПравилуВФоне(ПараметрыВыполнения = Неопределено, АдресХранилища = Неопределено) Экспорт
	
	Правило = Неопределено;
	ПараметрыВыполнения.Свойство("Правило", Правило);
	
	ЗарегистрироватьДокументыКОтражениюПоПравилу(Правило);
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПустаяСхемаКомпоновкиДанных()
	
	НоваяСхема = Новый СхемаКомпоновкиДанных;
		
	НовыйИсточникДанных = НоваяСхема.ИсточникиДанных.Добавить();
	НовыйИсточникДанных.Имя = "ИсточникДанных1";
	НовыйИсточникДанных.ТипИсточникаДанных = "Local";
		
	НовыйНабор = НоваяСхема.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));	
	НовыйНабор.Имя = "НаборДанных1";
	НовыйНабор.ИсточникДанных = "ИсточникДанных1";
	
	НовыйНабор.Запрос =
		"ВЫБРАТЬ
		|*";
	
	Возврат НоваяСхема;
	
КонецФункции

Процедура ЗарегистрироватьДокументыКОтражениюПоПравилу(Правило)
	
	Если Не ЗначениеЗаполнено(Правило) Тогда
		Возврат;
	КонецЕсли;	
	
	ТипыДокументов = Правило.ТипыДокументов;
	
	ДокументОтражениеМенеджер = Документы.упоОтражениеФактаВПроектномБюджетировании;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоИспользованияКонтураЭкономики", упоПроектноеБюджетированиеПовтИсп.НачалоИспользованияКонтураЭкономики());
	
	МассивЧастейЗапроса = Новый Массив;				
	Разрешенные = "РАЗРЕШЕННЫЕ";
	Для Каждого ТипДокумента Из ТипыДокументов Цикл		
		БлокТекста = "ВЫБРАТЬ %2
		              |	ТаблицаДокументов.Ссылка
		              |ИЗ
		              |	Документ.%1 КАК ТаблицаДокументов
		              |ГДЕ
		              |	ТаблицаДокументов.Дата >= &НачалоИспользованияКонтураЭкономики
		              |	И ТаблицаДокументов.Проведен";		
		БлокТекста = СтрЗаменить(БлокТекста, "%2", Разрешенные);
		Разрешенные = ""; 
		МассивЧастейЗапроса.Добавить(СтрЗаменить(БлокТекста, "%1", ТипДокумента.ТипДокумента));							
	КонецЦикла;	
	
	ТекстОбъединить = "
		|ОБЪЕДИНИТЬ
		|";
	ТекстЗапроса = СтрСоединить(МассивЧастейЗапроса, ТекстОбъединить);
			
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ДокументыКОтражению = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
		упоПроектноеБюджетированиеСервер.ПоставитьПервичныеДокументыВОчередьКОтражению(ДокументыКОтражению);		
	КонецЕсли;
			
КонецПроцедуры	

// Возвращает соответствие типов аналитик статей бюджетов ЕРП. 
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>.
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>.
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>.
//
Функция РасширениеТиповАналитикиERP()

	ТипыЗамещаемыхАналитик = Новый Соответствие;
	
	ТипыЗамещаемыхАналитик.Вставить(Тип("СправочникСсылка.СтруктураПредприятия"), Тип("СправочникСсылка.упоПодразделения"));
	ТипыЗамещаемыхАналитик.Вставить(Тип("СправочникСсылка.Партнеры"), Тип("СправочникСсылка.Контрагенты"));
	ТипыЗамещаемыхАналитик.Вставить(Тип("СправочникСсылка.НаправленияДеятельности"), Тип("ДокументСсылка.упоПроектнаяЗадача"));
	ТипыЗамещаемыхАналитик.Вставить(Тип("СправочникСсылка.Проекты"), Тип("ДокументСсылка.упоПроектнаяЗадача"));
	ТипыЗамещаемыхАналитик.Вставить(Тип("ПланВидовХарактеристикСсылка.СтатьиДоходов"), Тип("СправочникСсылка.упоСтатьиДоходов"));
	ТипыЗамещаемыхАналитик.Вставить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"), Тип("СправочникСсылка.упоСтатьиЗатрат"));
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.упоСтатьиДоходов"));	
	МассивТипов.Добавить(Тип("СправочникСсылка.упоСтатьиЗатрат"));
	МассивТипов.Добавить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
	ТипыЗамещаемыхАналитик.Вставить(Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"), МассивТипов);
	
	Возврат ТипыЗамещаемыхАналитик;

КонецФункции // ()

#КонецОбласти 

#КонецЕсли
