
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоКода модуля объекта.
// 
// Параметры: 
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации кода.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры // ПриУстановкеНовогоКода()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ОбъектКопирования – СправочникОбъект, исходный элемент, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ПредустановленныйКод = "";
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("Неопределено") Тогда 
		Возврат 
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ОтключитьПравило Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.Бюджетирование Тогда
		ПроверяемыеРеквизиты.Добавить("ПравилоПолученияФактаПоСтатьямБюджетов");
	КонецЕсли;
	
	ТекстРеквизита =  НСтр("ru = '""%2""'");
	Ошибки = Новый Массив;
	Ошибки.Добавить(НСтр("ru = 'Не выбрано поле запроса для реквизитов:'"));
	
	Если ЭтотОбъект.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.ПроизвольныйЗапрос 
		ИЛИ ЭтотОбъект.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.Бюджетирование Тогда
		
		Для Каждого СтрокаСопоставления Из ЭтотОбъект.СопоставлениеРеквизитов Цикл
			Если СтрокаСопоставления.СпособЗаполнения И НЕ ЗначениеЗаполнено(СтрокаСопоставления.ЗначениеЗаполнения) Тогда
				Ошибки.Добавить(СтрШаблон(ТекстРеквизита, СтрокаСопоставления.Реквизит));
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Ошибки.Количество() > 1 Тогда
		ТекстОшибки = СтрСоединить(Ошибки, Символы.ПС);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ); 
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи элемента.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипыДокументов.Количество() > 0 Тогда
		ТипыДокументов.Свернуть("ТипДокумента, ТипДокументаСиноним");
		ТипыДокументов.Сортировать("ТипДокументаСиноним");
	Иначе
		ТекстОшибки = НСтр("ru = 'Не указан тип документа.'");				
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);				
		Возврат;
	КонецЕсли;	
	
	Если НЕ ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.Бюджетирование Тогда
	    ПравилоПолученияФактаПоСтатьямБюджетов = Неопределено;
	КонецЕсли;	
		
	ЗаполнитьРеквизитыАвтозаполнения();
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередЗаписью(ЭтотОбъект, Отказ);

КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		ОбновитьДанныеОтраженияПоОтсутствующимПравилам();
	КонецЕсли;	
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от удаления объекта.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередУдалением(ЭтотОбъект, Отказ);
КонецПроцедуры // ПередУдалением()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыАвтозаполнения()
	
	СтрокаЗаполнитель = "";		
	ОкончаниеНаименования = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(" (%1)", ТипыДокументов.Количество());
	ДлинаОкончанияНаименования = СтрДлина(ОкончаниеНаименования);	
	ДлинаРеквизитаНаименование = 250;
	
	// Краткий состав.
	ТипыДляНаименования = Новый Массив;	
	Для Каждого СтрокаТипДокумента Из ТипыДокументов Цикл		
		ТипыДляНаименования.Добавить(СтрокаТипДокумента.ТипДокументаСиноним);
	КонецЦикла;
	СтрокаНаименование = СтрСоединить(ТипыДляНаименования, ",");	
	ДлинаСтрокиНаименование = СтрДлина(СтрокаНаименование);
	Если ДлинаСтрокиНаименование >= (ДлинаРеквизитаНаименование - ДлинаОкончанияНаименования) Тогда
		СтрокаЗаполнитель = "...";	
		ДлинаСтрокиНаименование = ДлинаРеквизитаНаименование - ДлинаОкончанияНаименования - СтрДлина(СтрокаЗаполнитель);					
	КонецЕсли;	
	КраткийСостав = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1%2%3",
		Лев(СтрокаНаименование, ДлинаСтрокиНаименование),
		СтрокаЗаполнитель, 
		ОкончаниеНаименования);	
		
	// Наименование.
	Если ФормироватьНаименованиеАвтоматически Тогда
		ШаблонНаименования = "%1: %2";
		ШаблонТипа = Строка(ТипПравила);
		Если ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.Бюджетирование 
			И ЗначениеЗаполнено(ПравилоПолученияФактаПоСтатьямБюджетов) Тогда
			ШаблонТипа = Строка(ПравилоПолученияФактаПоСтатьямБюджетов);					
		КонецЕсли;	
		Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования, Раздел, ШаблонТипа);
	КонецЕсли;	
			
КонецПроцедуры	

// Запускать в фоновом задании.
Процедура ОбновитьДанныеОтраженияПоОтсутствующимПравилам()
	
	ТипыЗначенияДокументовПравила = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования.ТипыДокументовПравила(Ссылка);
	
	СтатусыОшибокОтражения = Новый Массив;
	СтатусыОшибокОтражения.Добавить(Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОтсутствуютПравилаОтражения);
	СтатусыОшибокОтражения.Добавить(Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОшибкаОтражения);
	
	СтатусКОтражению = Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.КОтражению;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	упоОтражениеДокументовВПроектномБюджетировании.Документ КАК Документ
	                      |ИЗ
	                      |	РегистрСведений.упоОтражениеДокументовВПроектномБюджетировании КАК упоОтражениеДокументовВПроектномБюджетировании
	                      |ГДЕ
	                      |	упоОтражениеДокументовВПроектномБюджетировании.Статус В(&СтатусыОшибокОтражения)
	                      |	И ТИПЗНАЧЕНИЯ(упоОтражениеДокументовВПроектномБюджетировании.Документ) В (&ТипыЗначений)");
	Запрос.УстановитьПараметр("ТипыЗначений", ТипыЗначенияДокументовПравила);
	Запрос.УстановитьПараметр("СтатусыОшибокОтражения", СтатусыОшибокОтражения);
	
	Результат = Запрос.Выполнить();	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл														
			упоПроектноеБюджетированиеСервер.ПоставитьПервичныйДокументВОчередьКОтражению(Выборка.Документ);			
		КонецЦикла;			
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли
