
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Допуск = Константы.ИКТ_ИспользоватьБлокировкуПоДопускамСКУД.Получить();
	Медосмотр = Константы.ИКТ_ИспользоватьЗаключениеМедицинскогоОсмотраСКУД.Получить();
	Для Каждого Строка Из Строки Цикл
		Если Не Допуск Тогда
			Строка.Значение.Оформление["ТребуетсяДопуск"].УстановитьЗначениеПараметра("Видимость", Ложь);
			Строка.Значение.Оформление["ГруппаДопуска"].УстановитьЗначениеПараметра("Видимость", Ложь);
		КонецЕсли;
		Если Не Медосмотр Тогда
			Строка.Значение.Оформление["НуженМедосмотр"].УстановитьЗначениеПараметра("Видимость", Ложь);	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
