
&ИзменениеИКонтроль("НужноОбработатьФорму")
Функция Расш1_НужноОбработатьФорму(Знач ИнформацияОбОшибке, МинимальнаяВерсияДО)

	ВерсияСервиса = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ВерсияСервиса();

	Если Не ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СервисДоступен(ВерсияСервиса) Тогда
		Возврат Истина;

	ИначеЕсли МинимальнаяВерсияДО <> ""
		И ИнтеграцияС1СДокументооборотБазоваяФункциональность.ДоступенФункционалВерсииСервиса(МинимальнаяВерсияДО) Тогда
		Возврат Истина;

	Иначе
		Если ТипЗнч(ИнформацияОбОшибке) = Тип("Строка") Тогда
			ПредставлениеОшибки = ИнформацияОбОшибке;
		ИначеЕсли ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Иначе
			ПредставлениеОшибки = Строка(ИнформацияОбОшибке);
		КонецЕсли;
		#Вставка
		//{[+](фрагмент ДОБАВЛЕН), Буцких, 11.02.2026, Задача № 15180
		ПредставлениеОшибки = ПреобразоватьТекстОшибкиДляПользователя(ПредставлениеОшибки);
		//[+]} Буцких, Задача № 15180
		#КонецВставки
		ВызватьИсключение ПредставлениеОшибки;

	КонецЕсли;

КонецФункции 

Функция ПреобразоватьТекстОшибкиДляПользователя(ПредставлениеОшибки)
	
	ОписаниеОшибки = ПредставлениеОшибки;
	
	Если СтрНайти(ПредставлениеОшибки, "e1cib/data/Справочник.ДокументыПредприятия?ref=") Тогда
		НачалоОписанияОшибки = СтрНайти(ПредставлениеОшибки, "]",,, 1) + 2;
		КонецОписанияОшибки = СтрНайти(ПредставлениеОшибки, "[",,, 2);
		ДлиннаОписанияОшибки = КонецОписанияОшибки - НачалоОписанияОшибки;
		
		ОписаниеОшибки = "Произошла ошибка " + Сред(ПредставлениеОшибки, НачалоОписанияОшибки, ДлиннаОписанияОшибки);
		
		ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + 
					"У вас нет прав на просмотр вложений к данному документу." + Символы.ПС + 
					"Для просмотра вложенного файла обратитесь в бухгалтерию";
	КонецЕсли;
	
	Возврат ОписаниеОшибки;
	
КонецФункции

