////////////////////////////////////////////////////////////////////////////////
// Содержит общие методы для работы с документами 
// Прогноз трудозатрат по ролям и Планирование трудовых ресурсов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Строит диаграмму загрузки ресурсовПодставляет параметры в строку, находя их по символу %.
//
// Параметры:
//  ЭтаФорма		- Форма - форма-владелец.
//  ПланРольРесурс	- Строка - "ПоРолям"/"ПоРесурсам" вид ресурсов диаграммы
//  ИмяКолонки		- Строка - имя колонки, данные которой изменились и которую надо перестроить на диаграмме.
//
// Возвращаемое значение:
//	Булево - признак успешного построения диаграммы.
//
Функция ПостроитьДиаграмму(ЭтаФорма, ПланРольРесурс = "ПоРолям", ИмяКолонки = Неопределено) Экспорт  
	
	ДиаграммаПостроена = Ложь;
	
	Если Не ЭтаФорма.Объект.ПоказатьДиаграмму Тогда
		Возврат ДиаграммаПостроена;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДеревоФормы.ПолучитьЭлементы()) Тогда
		Возврат ДиаграммаПостроена;
	КонецЕсли; 
	
	Если ИмяКолонки = Неопределено Тогда
		ЭтаФорма.Диаграмма.Очистить();
	КонецЕсли;
	
	НастройкиВывода = ЗаполнитьНастройкиВывода(ЭтаФорма, ПланРольРесурс);
	
	// TODO: унифицировать в первую ветку, убрать КоличествоРесурсов.
	КоличествоРесурсов = 0;
	МассивСтрокРолиРесурса = МассивСтрокРолиРесурса(ЭтаФорма, НастройкиВывода, КоличествоРесурсов);
	
	ВывестиВДиаграммуФакт(ЭтаФорма, МассивСтрокРолиРесурса, ИмяКолонки, НастройкиВывода);
	
	ВывестиВДиаграммуПлан(ЭтаФорма, МассивСтрокРолиРесурса, ИмяКолонки, НастройкиВывода, КоличествоРесурсов);
	
	ДиаграммаПостроена = Истина;

	Возврат ДиаграммаПостроена;

КонецФункции

// Установить текущую страницу панели
//
// Параметры:
//  Форма		 - УправляемаяФорма	 - форма - владелец панели страниц.
//  ИмяСтраницы	 - Строка			 - имя страницы, которая устанавливается текущей.
//  ИмяПанели	 - Строка			 - имя панель, на которой устанавлияается текущая страница.
//
Процедура УстановитьТекущуюСтраницуПанели(Форма, 
	ИмяСтраницы = "СтраницаОсновное", ИмяПанели = "ОсновнаяПанель") Экспорт

	Элементы = Форма.Элементы;
	Элементы[ИмяПанели].ТекущаяСтраница = Элементы[ИмяСтраницы];

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Диаграмма 

Функция МассивСтрокРолиРесурса(ЭтаФорма, НастройкиВывода, КоличествоРесурсов)
	
	РольРесурс = ЭтаФорма[НастройкиВывода.ИмяОтбораДиаграммы];
	
	СтрокиРесурса_НижнийУровень = ЭтаФорма.мКэшЗначений.СтрокиРесурса_НижнийУровень; 
		
	Если ЗначениеЗаполнено(РольРесурс) 
			И СтрокиРесурса_НижнийУровень.Получить(РольРесурс) <> Неопределено Тогда
		МассивИдСтрокРолиРесурса = СтрокиРесурса_НижнийУровень.Получить(РольРесурс);
		МассивСтрокРолиРесурса = Новый Массив;
		Для Каждого Ид Из МассивИдСтрокРолиРесурса Цикл
			МассивСтрокРолиРесурса.Добавить(ЭтаФорма.ДеревоФормы.НайтиПоИдентификатору(Ид));
		КонецЦикла;	
	Иначе 
		ЭтаФорма[НастройкиВывода.ИмяОтбораДиаграммы] = Неопределено;
		
		// TODO: унифицировать в первую ветку.
		Если НастройкиВывода.ПланРольРесурс = "ПоРесурсам" Тогда
			МассивРесурсов = Новый Массив;
			// Режим совместимости 8.3.24 или "Не использовать".
			Ресурсы = упоРаботаСФормамиСервер.ТаблицаОбъектаВМассивеДляОбработкиНаКлиенте(ЭтаФорма.Объект, "Ресурсы");
			
			Для Каждого СтрокаРесурса Из Ресурсы Цикл
				Если МассивРесурсов.Найти(СтрокаРесурса.ТрудовойРесурс) = Неопределено Тогда
					МассивРесурсов.Добавить(СтрокаРесурса.ТрудовойРесурс);
				КонецЕсли;
			КонецЦикла;
			КоличествоРесурсов = МассивРесурсов.Количество();
		КонецЕсли;
		
	КонецЕсли;

	Возврат МассивСтрокРолиРесурса;
	
КонецФункции

Функция ЗначениеДиаграммыРольРесурс(ЭтаФорма, 
							МассивСтрокРолиРесурса, 
							ИмяРеквизитаСОтбором, 
							ИмяРеквизитаБезОтбора, 
							ЗначениеИзПервойСтрокиРолиРесурса = Ложь,
							ИмяРеквизитаОтбора = "РесурсДиаграммыПоРесурсу")
								
	ЗначениеДиаграммы = 0;		 
	
	Если ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизитаОтбора]) Тогда
				
		Для Каждого СтрокаРолиРесурса Из МассивСтрокРолиРесурса Цикл
			// Если значение дублируется во всех строках ролей (как мощность) - не суммируем, берем первое.
			Если ЗначениеИзПервойСтрокиРолиРесурса Тогда
				ЗначениеДиаграммы = СтрокаРолиРесурса[ИмяРеквизитаСОтбором];					
				Прервать;				
			Иначе	
				ЗначениеДиаграммы = ЗначениеДиаграммы + СтрокаРолиРесурса[ИмяРеквизитаСОтбором];				
			КонецЕсли;		
		КонецЦикла;
		
	Иначе
						
		ЗначениеДиаграммы = ЭтаФорма[ИмяРеквизитаБезОтбора];
			
	КонецЕсли;

	Возврат ЗначениеДиаграммы;
	
КонецФункции

Функция ТочкаДиаграммыМесяц(Диаграмма, Дата) 

	Точка = Диаграмма.УстановитьТочку(НачалоМесяца(Дата));
	Точка.Текст = Формат(Дата, "ДФ='MMMM yyyy'");   

	Возврат Точка;

КонецФункции

Функция ТочкаДиаграммыДень(Диаграмма, Дата) 

	Точка = Диаграмма.УстановитьТочку(Дата);
	Точка.Текст = Формат(Дата, "ДФ='dd.MM.yy'");  

	Возврат Точка;

КонецФункции

Функция ЗаполнитьНастройкиВывода(ЭтаФорма, ПланРольРесурс)
	
	НастройкиВывода = Новый Структура(
		"ПланРольРесурс, ИмяОтбораДиаграммы, ВыводитьФакт, НеПоказыватьВыходные, ПериодПоДням", 
		ПланРольРесурс);
	Если ПланРольРесурс = "ПоРолям" Тогда
		НастройкиВывода.ИмяОтбораДиаграммы = "РольДиаграммыПоРоли";
		НастройкиВывода.ВыводитьФакт = Истина;
		НастройкиВывода.НеПоказыватьВыходные = Ложь;
		НастройкиВывода.ПериодПоДням = Ложь;
	Иначе                                           
		НастройкиВывода.ИмяОтбораДиаграммы = "РесурсДиаграммыПоРесурсу";
		НастройкиВывода.ВыводитьФакт = Ложь;
		НастройкиВывода.НеПоказыватьВыходные = Не ЭтаФорма.Объект.ПоказыватьВыходные;
		НастройкиВывода.ПериодПоДням = Истина;
	КонецЕсли;	
	
	Возврат НастройкиВывода;
	
КонецФункции

Функция ЗагрузкаРолиРесурса(ЭтаФорма, МассивСтрокРолиРесурса, СтрокаКолонок, НастройкиВывода, 
	КоличествоРесурсов)		
	
	Мощность = 0;
	Прогноз = 0;
	
	// TODO: унифицировать в первую ветку.
	Если НастройкиВывода.ПланРольРесурс = "ПоРолям" Тогда
	
		Если НастройкиВывода.ПланРольРесурс = "ПоРолям" Тогда
			ИмяРеквизитаСОтбором = СтрокаКолонок.ИмяКолонки + "Прогноз";
			ИмяРеквизитаБезОтбора = "Итого" + СтрокаКолонок.ИмяКолонки;
		Иначе
			ИмяРеквизитаСОтбором = СтрокаКолонок.ИмяКолонки + "НовоеЗначение";
			ИмяРеквизитаБезОтбора = "ИтогоНовоеЗначение" + СтрокаКолонок.ИмяКолонки;
		КонецЕсли;
		Прогноз = ЗначениеДиаграммыРольРесурс(ЭтаФорма, 
												МассивСтрокРолиРесурса, 
												ИмяРеквизитаСОтбором, 
												ИмяРеквизитаБезОтбора, 
												, 
												НастройкиВывода.ИмяОтбораДиаграммы);
		
		Если НастройкиВывода.ПланРольРесурс = "ПоРолям" Тогда
			ИмяРеквизитаСОтбором = СтрокаКолонок.ИмяКолонки + "Мощность";
			ИмяРеквизитаБезОтбора = "Мощность" + СтрокаКолонок.ИмяКолонки;
		Иначе
			ИмяРеквизитаСОтбором = СтрокаКолонок.ИмяКолонки + "ПоКалендарю";
			ИмяРеквизитаБезОтбора = "ИтогоПоКалендарю" + СтрокаКолонок.ИмяКолонки;
		КонецЕсли;				
		Мощность = ЗначениеДиаграммыРольРесурс(ЭтаФорма, 
												МассивСтрокРолиРесурса, 
												ИмяРеквизитаСОтбором, 
												ИмяРеквизитаБезОтбора, 
												Истина, 
												НастройкиВывода.ИмяОтбораДиаграммы);
	
	Иначе
		
		Если ЗначениеЗаполнено(ЭтаФорма.РесурсДиаграммыПоРесурсу) Тогда
			Для Каждого СтрокаРесурса Из МассивСтрокРолиРесурса Цикл
				Прогноз = Прогноз + СтрокаРесурса[СтрокаКолонок.ИмяКолонки + "НовоеЗначение"];
				Мощность = СтрокаРесурса[СтрокаКолонок.ИмяКолонки + "ПоКалендарю"];
			КонецЦикла;
		Иначе
			Прогноз = ЭтаФорма["ИтогоНовоеЗначение" + СтрокаКолонок.ИмяКолонки];
			СтрокиКалендаря = ЭтаФорма.Объект.ДанныеКалендаря.НайтиСтроки(Новый Структура("День", СтрокаКолонок.Дата));
			Если СтрокиКалендаря.Количество() > 0 Тогда
				Мощность = СтрокиКалендаря[0].КоличествоЧасов;
			КонецЕсли;
			Мощность = Мощность * КоличествоРесурсов;
		КонецЕсли;

	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Мощность", Мощность);
	Результат.Вставить("Прогноз", Прогноз);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеПроцентНедозагрузка(Прогноз, Мощность, Отклонение)
	
	ЗначениеНедозагрузка = 0;
	
	Если Прогноз = 0 Тогда
		ЗначениеНедозагрузка = Мощность;					
	Иначе
		Если Отклонение > 0 Тогда				
			ЗначениеНедозагрузка = Отклонение;			
		КонецЕсли;	
	КонецЕсли;
		
	Если Мощность = 0 Тогда
		ПроцентНедозагрузка = 0;
	Иначе
		Процент100 = 100;		
		ПроцентНедозагрузка = (ЗначениеНедозагрузка / Мощность) * Процент100;
	КонецЕсли;
		
	Результат = Новый Структура;
	Результат.Вставить("Загрузка", ЗначениеНедозагрузка);
	Результат.Вставить("Процент", ПроцентНедозагрузка);	
	
	Возврат Результат;
	
КонецФункции	

Функция ЗначениеПроцентПревышение(Прогноз, Мощность, Отклонение)
	
	ЗначениеПревышение = 0;
	
	Если Отклонение < 0 Тогда		
		ЗначениеПревышение = -1 * Отклонение;					
	КонецЕсли;
		
	Если Мощность = 0 Тогда		
		ПроцентПревышение = 100;		
	Иначе
		Процент100 = 100;		
		ПроцентПревышение = (ЗначениеПревышение / Мощность) * Процент100;		
	КонецЕсли;
		
	Результат = Новый Структура;
	Результат.Вставить("Загрузка", ЗначениеПревышение);
	Результат.Вставить("Процент", ПроцентПревышение);	
	
	Возврат Результат;
	
КонецФункции	

Функция ЗначениеПроцентЗагрузка(Прогноз, Мощность, Отклонение)
	
	ЗначениеЗагрузка = Прогноз;
	
	Если Прогноз > 0 И Отклонение < 0 Тогда
		ЗначениеЗагрузка =  Прогноз + Отклонение;
	КонецЕсли;
	
	Если Мощность = 0 Тогда
		ПроцентЗагрузка = 0;
		ПроцентПревышение = 100;
		ПроцентНедозагрузка = 0;
	Иначе
		Процент100 = 100;
		ПроцентЗагрузка = (ЗначениеЗагрузка / Мощность) * Процент100;   		
	КонецЕсли;
		
	Результат = Новый Структура;
	Результат.Вставить("Загрузка", ЗначениеЗагрузка);
	Результат.Вставить("Процент", ПроцентЗагрузка);	
	
	Возврат Результат;
	
КонецФункции	

Процедура УстановитьЗначениеВДиаграмме(Диаграмма, Серия, Дата, ЗначениеРезультат, НастройкиВывода)
	
	Если НастройкиВывода.ПериодПоДням Тогда
		Точка = ТочкаДиаграммыДень(Диаграмма, Дата);
	Иначе	
		Точка = ТочкаДиаграммыМесяц(Диаграмма, Дата); 
	КонецЕсли;
	
	ШаблонТекста = "%1: %2 (%3)";

	СтрокаЗагрузка 	= Формат(ЗначениеРезультат.Загрузка, "ЧДЦ=2; ЧН=");
	СтрокаПроцент 	= Формат(ЗначениеРезультат.Процент, "ЧДЦ=; ЧН=") + "%";
	
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекста,
					Серия.Текст, 
					СтрокаЗагрузка, 
					СтрокаПроцент);	
														
	Диаграмма.УстановитьЗначение(Точка, Серия, ЗначениеРезультат.Загрузка, Дата, Текст);
																												
КонецПроцедуры

Процедура ВывестиВДиаграммуПлан(ЭтаФорма, МассивСтрокРолиРесурса, ИмяКолонки, НастройкиВывода, КоличествоРесурсов)
	
	// Порядок серий важен: 
	//	- внизу должна быть загрузка, которая сверху дополняется перегрузкой или недогрузкой;
	// 	- при 0-значении выводится последняя серия со значением 0, поэтому она должна быть не красной.
	СерияИтого 			= ЭтаФорма.Диаграмма.УстановитьСерию("Итого");
	СерияПревышение 	= ЭтаФорма.Диаграмма.УстановитьСерию("Перегрузка");
	СерияНедозагрузка 	= ЭтаФорма.Диаграмма.УстановитьСерию("Недозагрузка");
	
	Если ИмяКолонки = Неопределено Тогда
		
		СерияИтого.Цвет = ЭтаФорма.ЦветДиаграммыЗагрузка;
		СерияИтого.Текст = НСтр("ru = 'Загрузка без превышения'");
		
		СерияНедозагрузка.Цвет = ЭтаФорма.ЦветДиаграммыПростой;
		СерияНедозагрузка.Текст = НСтр("ru = 'Простой'");
		
		СерияПревышение.Цвет = ЭтаФорма.ЦветДиаграммыПерегрузка; 
		СерияПревышение.Текст = НСтр("ru = 'Перегрузка'");
		
	КонецЕсли;
	
	Если ИмяКолонки = Неопределено Тогда
		КоллекцияСтрокКолонок = ЭтаФорма.КолонкиДат;
	Иначе
		КоллекцияСтрокКолонок = ЭтаФорма.КолонкиДат.НайтиСтроки(Новый Структура("ИмяКолонки", ИмяКолонки));
	КонецЕсли;
	
	ФорматЗагрузка = "ЧДЦ=2; ЧН=";
	ФорматПроцент = "ЧДЦ=; ЧН=";
	ШаблонТекста = "%1: %2 (%3)";
	
	Для Каждого СтрокаКолонок Из КоллекцияСтрокКолонок Цикл
		
		Если НастройкиВывода.НеПоказыватьВыходные И СтрокаКолонок.Выходной Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = ЗагрузкаРолиРесурса(ЭтаФорма, 
			МассивСтрокРолиРесурса, 
			СтрокаКолонок, 
			НастройкиВывода, 
			КоличествоРесурсов);
		Мощность 	= Результат.Мощность;
		Прогноз 	= Результат.Прогноз;
		Отклонение 	= Мощность - Прогноз;
		
		РезультатЗагрузка 		= ЗначениеПроцентЗагрузка(Прогноз, Мощность, Отклонение);
		РезультатПревышение 	= ЗначениеПроцентПревышение(Прогноз, Мощность, Отклонение);
		РезультатНедозагрузка 	= ЗначениеПроцентНедозагрузка(Прогноз, Мощность, Отклонение);
		
		УстановитьЗначениеВДиаграмме(ЭтаФорма.Диаграмма, 
			СерияИтого, 
			СтрокаКолонок.Дата, 
			РезультатЗагрузка, 
			НастройкиВывода);
		УстановитьЗначениеВДиаграмме(ЭтаФорма.Диаграмма, 
			СерияПревышение, 
			СтрокаКолонок.Дата, 
			РезультатПревышение, 
			НастройкиВывода);
		УстановитьЗначениеВДиаграмме(ЭтаФорма.Диаграмма, 
			СерияНедозагрузка, 
			СтрокаКолонок.Дата, 
			РезультатНедозагрузка, 
			НастройкиВывода);
		
	КонецЦикла;

КонецПроцедуры

Процедура ВывестиВДиаграммуФакт(ЭтаФорма, МассивСтрокРолиРесурса, ИмяКолонки, НастройкиВывода)
	
	Если Не НастройкиВывода.ВыводитьФакт Тогда
		Возврат;
	КонецЕсли;	
	
	ФорматЗагрузка = "ЧДЦ=2; ЧН=";			
		
	СерияФакт = ЭтаФорма.Диаграмма.УстановитьСерию("Факт");
	
	Если ИмяКолонки = Неопределено Тогда
		СерияФакт.Цвет = Новый Цвет(75, 50, 77);
		СерияФакт.Текст = НСтр("ru = 'Факт'");
	КонецЕсли;	
		
	ПериодФакта = ДобавитьМесяц(ЭтаФорма.Объект.НачалоПериода, -1);	
	Точка = ТочкаДиаграммыМесяц(ЭтаФорма.Диаграмма, ПериодФакта); 		

	Факт = ЗначениеДиаграммыРольРесурс(ЭтаФорма, МассивСтрокРолиРесурса, 
		"ФактОтчетногоПериода", "ИтогоФактОтчетногоПериода", , НастройкиВывода.ИмяОтбораДиаграммы);

	Текст = СерияФакт.Текст + ": " + Формат(Факт, ФорматЗагрузка);
	ЭтаФорма.Диаграмма.УстановитьЗначение(Точка, СерияФакт, Факт, ПериодФакта, Текст);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
