////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с диалогами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выводит на экран окно предупреждения.
//
// Параметры:
//  ТекстПредупреждения		 - Строка	 - текст предупреждения.
//  Таймаут					 - Число	 - интервал времени в секундах,
//  	в течение которого система будет ожидать ответа пользователя.
//  Заголовок				 - Строка	 - текст заголовка окна предупреждения.
//  СписокПараметровЖурнала	 - Структура - структура параметров для записи информации в журнал регистрации.
//
Процедура упоПредупреждение(ТекстПредупреждения, Таймаут = 0, Заголовок = "Предупреждение",
						   СписокПараметровЖурнала = Неопределено) Экспорт
	
	Если Не СписокПараметровЖурнала = Неопределено Тогда
		упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(СписокПараметровЖурнала);
	КонецЕсли;
	
	ПоказатьПредупреждение(,ТекстПредупреждения, Таймаут, Заголовок);
	
КонецПроцедуры

// Выводит на экран окно вопроса.
//
// Параметры:
//  ТекстВопроса			 - Строка		 - текст задаваемого вопроса.
//  Режим					 - РежимДиалогаВопрос	 - задает состав кнопок диалога и варианты ответов.
//  Таймаут					 - Число				 - интервал времени в секундах,
//  				в течение которого система будет ожидать ответа пользователя.
//  КнопкаПоУмолчанию		 - КодВозвратаДиалога	 - определяет кнопку,
//  	которая должна быть назначена кнопкой по умолчанию.
//  Заголовок				 - Строка				 - содержит заголовок окна вопроса.
//  СписокПараметровЖурнала	 - Структура			 - структура параметров для записи информации в журнал регистрации.
//  ОбработкаОповещения		 - 						 - Описание оповещения - Содержит имя процедуры, которая должна быть выполнена
//  						после выбора варианта ответа.
//
Процедура упоВопрос(ТекстВопроса, Режим, Таймаут = 0,
				   КнопкаПоУмолчанию = Неопределено, Заголовок = "",
				   СписокПараметровЖурнала = Неопределено,ОбработкаОповещения=Неопределено) Экспорт
	
	Если Не СписокПараметровЖурнала = Неопределено Тогда
		упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(СписокПараметровЖурнала);
	КонецЕсли;
	
	Контекст = Новый Структура("СледующееОповещение", ОбработкаОповещения);
	ОписаниеОповещения = Новый ОписаниеОповещения("упоВопросЗавершение", ЭтотОбъект, Контекст);
	
	ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса, Режим, Таймаут, КнопкаПоУмолчанию, Заголовок);
	
КонецПроцедуры

// Обработчик завершения упоВопрос.
//
// Параметры:
//  Результат				 - КодВозвратаДиалога	 - ответ.
//  ДополнительныеПараметры	 - Структура			 - структура параметров.
//
Процедура упоВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.СледующееОповещение <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.СледующееОповещение, Результат);
	КонецЕсли;	
	
КонецПроцедуры

// Выводит отладочный текст сообщения в окно сообщений.
//
// Параметры:
//  ТекущийЭлемент				 - ДанныеФормыЭлементДерева, ДанныеФормыЭлементКоллекции - данные строки.
//  Пользователь				 - СправочникСсылка.Пользователи - пользователь, для которого восстанавливаютс настройки отчета.
//  ТекущийПользователь			 - СправочникСсылка.Пользователи - текуйщий пользователь.
//  ИмяФормыПерсональныхНастроек - Строка - путь к форме персональных настроек.
//
Процедура ОткрытьОтчетИлиФорму(ТекущийЭлемент, Пользователь, ТекущийПользователь, ИмяФормыПерсональныхНастроек) Экспорт
	
	ЭлементДереваЗначений = ТекущийЭлемент;
	Если ЭлементДереваЗначений.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Пользователь <> ТекущийПользователь Тогда
		ТекстПредупреждения = НСтр("ru = 'Для просмотра настроек другого пользователя необходимо запустить 
                                    |программу от его имени и открыть нужный отчет или форму.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если ЭлементДереваЗначений.Имя = "НастройкиОтчетовДерево" Тогда
		
		КлючОбъекта = ЭлементДереваЗначений.ТекущиеДанные.Ключи[0].Значение;
		КлючОбъектаМассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючОбъекта, "/");
		КлючВарианта = КлючОбъектаМассивСтрок[1];
		ПараметрыОтчета = Новый Структура("КлючВарианта, КлючПользовательскихНастроек", КлючВарианта, "");
		
		Если ЭлементДереваЗначений.ТекущиеДанные.Тип = "НастройкаОтчета" Тогда
			КлючПользовательскихНастроек = ЭлементДереваЗначений.ТекущиеДанные.Ключи[0].Представление;
			ПараметрыОтчета.Вставить("КлючПользовательскихНастроек", КлючПользовательскихНастроек);
		КонецЕсли;
		
		ОткрытьФорму(КлючОбъектаМассивСтрок[0] + ".Форма", ПараметрыОтчета);
		Возврат;
		
	ИначеЕсли ЭлементДереваЗначений.Имя = "ВнешнийВид" Тогда
		
		Для Каждого КлючОбъекта Из ЭлементДереваЗначений.ТекущиеДанные.Ключи Цикл
			
			Если КлючОбъекта.Пометка = Истина Тогда
				
				ОткрытьФорму(КлючОбъекта.Значение);
				Возврат;
			Иначе
				РодительЭлемента = ЭлементДереваЗначений.ТекущиеДанные.ПолучитьРодителя();
				
				Если ЭлементДереваЗначений.ТекущиеДанные.ТипСтроки = "НастройкиРабочегоСтола" Тогда
					ПоказатьПредупреждение(,НСтр("ru = 'Для просмотра настроек рабочего стола перейдите к разделу ""Рабочий стол""
						|в командном интерфейсе программы.'"));
					Возврат;
				КонецЕсли;
				
				Если ЭлементДереваЗначений.ТекущиеДанные.ТипСтроки = "НастройкиКомандногоИнтерфейса" Тогда
					ПоказатьПредупреждение(,НСтр("ru = 'Для просмотра настроек командного интерфейса выберите нужный раздел
						|командного интерфейса программы.'"));
					Возврат;
				КонецЕсли;
				
				Если РодительЭлемента <> Неопределено Тогда
					ТекстПредупреждения = НСтр("ru = 'Для просмотра данной настройки необходимо открыть ""%1"" 
						|и затем перейти к форме ""%2"".'");
					ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредупреждения,
						РодительЭлемента.Настройка, ЭлементДереваЗначений.ТекущиеДанные.Настройка);
					ПоказатьПредупреждение(,ТекстПредупреждения);
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПоказатьПредупреждение(,НСтр("ru = 'Данную настройку невозможно просмотреть.'"));
		Возврат;
		
	ИначеЕсли ЭлементДереваЗначений.Имя = "ПрочиеНастройки" Тогда
		
		Если ЭлементДереваЗначений.ТекущиеДанные.Тип = "ПерсональныеНастройки"
			И ИмяФормыПерсональныхНастроек <> "" Тогда
			ОткрытьФорму(ИмяФормыПерсональныхНастроек);
			Возврат;
		КонецЕсли;
		
		ПоказатьПредупреждение(,НСтр("ru = 'Данную настройку невозможно просмотреть.'"));
		Возврат;
		
	КонецЕсли;
	
	ПоказатьПредупреждение(,НСтр("ru = 'Выберите настройку для просмотра.'"));
	
КонецПроцедуры

// Формирует строку получателя настройки.
//
// Параметры:
//  КоличествоПользователей - Число  - используется, если значение больше единицы.
//  Пользователь            - Строка - имя пользователя. Используется, если количество пользователей
//                            равно единице.
//
// Возвращаемое значение:
//  Строка - пояснение кому копируется настройка.
//
Функция ПояснениеПользователи(КоличествоПользователей, Пользователь) Экспорт
	
	Если КоличествоПользователей = 1 Тогда
		ПояснениеКомуСкопированыНастройки = НСтр("ru = 'пользователю ""%1""'");
		ПояснениеКомуСкопированыНастройки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ПояснениеКомуСкопированыНастройки, Пользователь);
	Иначе
		ПояснениеКомуСкопированыНастройки = НСтр("ru = '%1 пользователям'");
		ПояснениеКомуСкопированыНастройки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ПояснениеКомуСкопированыНастройки, КоличествоПользователей);
	КонецЕсли;
	
	Возврат ПояснениеКомуСкопированыНастройки;
КонецФункции

// Формирует текст пояснения при копировании настройки.
//
// Параметры:
//  ПредставлениеНастройки				 - Строка - имя настройки.
//  КоличествоНастроек					 - Число  - количество настроек.
//  ПояснениеКомуСкопированыНастройки	 - Строка - кому скопированы настрйоки.
//
// Возвращаемое значение:
//	Строка - текст с пояснением, какие настройки и кому скопированы.
//
Функция ФормированиеПоясненияПриКопировании(ПредставлениеНастройки,
											КоличествоНастроек,
											ПояснениеКомуСкопированыНастройки) Экспорт
	
	Если КоличествоНастроек = 1 Тогда
		
		Если СтрДлина(ПредставлениеНастройки) > 24 Тогда
			ПредставлениеНастройки = Лев(ПредставлениеНастройки, 24) + "...";
		КонецЕсли;
		
		ТекстПояснения = НСтр("ru = '""%1"" скопирована %2'");
		ТекстПояснения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстПояснения, ПредставлениеНастройки, ПояснениеКомуСкопированыНастройки);
	Иначе
		ПрописьПредмета = ФормированиеСтрокиКоличестваНастроек(КоличествоНастроек);
		ТекстПояснения = НСтр("ru = 'Скопировано %1 %2'");
		ТекстПояснения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстПояснения, ПрописьПредмета, ПояснениеКомуСкопированыНастройки);
	КонецЕсли;
	
	Возврат ТекстПояснения;
КонецФункции
	
// Формирует строку с текстовым представлением количества настроек.
//
// Параметры:
//  КоличествоНастроек	 - Число - количество настроек.
//
// Возвращаемое значение:
//	Строка - получаемая строка.
//
Функция ФормированиеСтрокиКоличестваНастроек(КоличествоНастроек) Экспорт
	
	ПрописьЧисла = ЧислоПрописью(КоличествоНастроек, "Л = ru_RU", НСтр("ru = ',,,,,,,,0'"));
	ПрописьЧислаИПредмета = ЧислоПрописью(КоличествоНастроек, "Л = ru_RU", НСтр("ru = 'настройка,настройки,настроек,,,,,,0'"));
	ПрописьПредмета = СтрЗаменить(ПрописьЧислаИПредмета, ПрописьЧисла, Формат(КоличествоНастроек, "ЧДЦ=0") + " ");
		
	Возврат ПрописьПредмета;
	
КонецФункции

#КонецОбласти