////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с формами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает данные последней модификации объекта строкой.
//
// Параметры:
//  Объект	 - СправочникСсылка, ДокументСсылка, СправочникОбъект, ДокументОбъект - объект.
//
// Возвращаемое значение:
//	Строка - данные о последней модификации.
//
Функция ФормаНадписьПоследняяМодификация(Объект) Экспорт
	
	Если Объект.АвторИзменений.Пустая() Тогда      
		ТекстНадписи = "";
	Иначе
		ТекстНадписи = Строка(Объект.АвторИзменений) + ", " + Формат(Объект.ДатаМодификации, "ДЛФ=ДВ");
	КонецЕсли;            		
	
	Возврат ТекстНадписи;
	
КонецФункции 

// Обработчик нажатия на надпись с данными последней модификации.
// Показывает пользователя, последнего изменявшего объект.
//
// Параметры:
//  Объект	 - СправочникСсылка, ДокументСсылка, СправочникОбъект, ДокументОбъект - объект.
//  Форма	 - Произвольный - не используется.
//
Процедура ФормаНадписьПоследняяМодификацияНажатие(Объект, Форма) Экспорт

	// Покажем пользователя, который последним изменял данные.
	Пользователь = Объект.АвторИзменений;
	Если ЗначениеЗаполнено(Пользователь) Тогда
		ПоказатьЗначение(, Пользователь);
	КонецЕсли;

КонецПроцедуры
 	  
// Обработчик нажатия на надпись с информацией о документе-основании.
//
// Параметры:
//  Объект					 - СправочникСсылка, ДокументСсылка, СправочникОбъект, ДокументОбъект, ДанныеФормыСтруктура - объект.
//  Форма					 - УправляемаяФорма - форма-владелец открываемой формы.
//  ИмяРеквизитаОснования	 - Строка 			- имя реквизита, содержащего ссылку на документ-основание.
//
Процедура НадписьДокументОснованиеНажатие(Объект, Форма, ИмяРеквизитаОснования = "ДокументОснование") Экспорт
	
	Если Не Объект[ИмяРеквизитаОснования] = Неопределено Тогда				
		Если Не Объект[ИмяРеквизитаОснования].Пустая() Тогда // Просто откроем форму основания.			
			ПоказатьЗначение(, Объект[ИмяРеквизитаОснования]);						
			Возврат;			
		КонецЕсли;				
	КонецЕсли;	
	
	СписокТиповОснований = упоУправлениеФормамиСервер.ВернутьСписокОснованийОбъекта(Объект);
				
	Если СписокТиповОснований.Количество() = 0 Тогда // Нет оснований.
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("Форма", Форма);
	Контекст.Вставить("ИмяРеквизитаОбъекта", ИмяРеквизитаОснования);

	Если СписокТиповОснований.Количество() = 1 Тогда // Одно основание, сразу выбираем.		
		
		ВыбранныйЭлемент = СписокТиповОснований.Получить(0); 		
		НажатиеНаГиперссылкуРеквизитаОбъектаЗавершение(ВыбранныйЭлемент, Контекст);
		
	Иначе // Оснований больше одного.         
						
		ОповещениеЗавершения = Новый ОписаниеОповещения("НажатиеНаГиперссылкуРеквизитаОбъектаЗавершение", ЭтотОбъект, Контекст);		
		СписокТиповОснований.ПоказатьВыборЭлемента(ОповещениеЗавершения, НСтр("ru = 'Выберите тип основания'"));
		
	КонецЕсли;
	
КонецПроцедуры 

// Обработчик нажатия на гиперссылку реквизита объекта.
//
// Параметры:
//	Объект				 - СправочникСсылка, ДокументСсылка, СправочникОбъект, ДокументОбъект, ДанныеФормыСтруктура - объект.
//	Форма				 - УправляемаяФорма - форма-владелец открываемой формы.
//	ИмяРеквизитаОбъекта	 - Строка 			- имя реквизита.
//	СтандартнаяОбработка - Булево 			- признак стандартной обработки.
//	РежимТолькоОткрытие	 - Булево 			- признак только открытия значения.
//
Процедура ОбработатьНажатиеНаГиперссылкуРеквизитаОбъекта(Объект,
														 Форма,
														 ИмяРеквизитаОбъекта, 
														 СтандартнаяОбработка,
														 РежимТолькоОткрытие = Ложь) Экспорт
														 
	СтандартнаяОбработка = Ложь;
	
	Если РежимТолькоОткрытие Тогда
		Возврат;
	КонецЕсли;
	
	СписокТиповОснований = упоУправлениеФормамиСервер.ВернутьСписокТиповРеквизитаОбъекта(Объект, ИмяРеквизитаОбъекта);
	
	Если СписокТиповОснований.Количество() = 0 Тогда // Нет оснований.
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("Форма", Форма);	
	Контекст.Вставить("ИмяРеквизитаОбъекта", ИмяРеквизитаОбъекта);
	
	Если СписокТиповОснований.Количество() = 1 Тогда // Одно основание, сразу выбираем.		
		
		ВыбранныйЭлемент = СписокТиповОснований.Получить(0); 		
		НажатиеНаГиперссылкуРеквизитаОбъектаЗавершение(ВыбранныйЭлемент, Контекст);
		
	Иначе // Оснований больше одного.         
						
		ОповещениеЗавершения = Новый ОписаниеОповещения("НажатиеНаГиперссылкуРеквизитаОбъектаЗавершение", ЭтотОбъект, Контекст);		
		СписокТиповОснований.ПоказатьВыборЭлемента(ОповещениеЗавершения, НСтр("ru = 'Выберите тип основания'"));
		
	КонецЕсли;	
		
КонецПроцедуры

// Обновляет дату выпуска в строке.
//
// Параметры:
//  Сроки					 - Структура 								- свойства:
//		* НачалоПлан		- Дата - дата начала.
//		* ЗавершениеПлан	- Дата - дата окончания.
//  Проект					 - СправочникСсылка.Проекты 				- проект.
//  НекаяСтрока				 - ДанныеФормыЭлементКоллекции, Структура 	- данные строки.
//
Процедура ОбновитьДатуВыпускаВСтроке(Сроки, Проект, НекаяСтрока) Экспорт
	
	ОбновитьДатуПривязкиВСтроке(Сроки, Проект, НекаяСтрока, "СпособПривязкиВыпуска", "ДатаВыпуска");
	
КонецПроцедуры

// Обновляет дату заказа потребности в строке.
//
// Параметры:
//  Сроки					 - Структура 								- свойства:
//		* НачалоПлан		- Дата - дата начала.
//		* ЗавершениеПлан	- Дата - дата окончания.
//  Проект					 - СправочникСсылка.Проекты 				- проект.
//  НекаяСтрока				 - ДанныеФормыЭлементКоллекции, Структура 	- данные строки.
//
Процедура ОбновитьДатуЗаказаПотребностиВСтроке(Сроки, Проект, НекаяСтрока) Экспорт
	
	ОбновитьДатуПривязкиВСтроке(Сроки, Проект, НекаяСтрока, "СпособПривязкиПотребности", "ДатаЗаказа");
	
КонецПроцедуры

// Устанавливает Дату выпуска в НекаяСтрока в зависимости от способа привязки, задержки и пр.
//
// Параметры:
//  Сроки					 - Структура 								- свойства:
//		* НачалоПлан		- Дата - дата начала.
//		* ЗавершениеПлан	- Дата - дата окончания.
//  Проект					 - СправочникСсылка.Проекты 				- проект.
//  НекаяСтрока				 - ДанныеФормыЭлементКоллекции, Структура 	- данные строки.
//
Процедура ОбновитьДатуВыпускаПланаВыпускаВСтроке(Сроки, Проект, НекаяСтрока) Экспорт
		
	ОбновитьДатуПривязкиВСтроке(Сроки, Проект, НекаяСтрока, "СпособПривязкиВыпуска", "ДатаВыпуска");
	
КонецПроцедуры

// Устарела. см. РассчитатьДатуЗаказаВСтрокеДанных.
//
// Параметры:
//  Сроки - Структура 								- свойства:
//		* НачалоПлан	 - Дата - дата начала.
//		* ЗавершениеПлан - Дата - дата окончания.
//  Проект - СправочникСсылка.Проекты 				- проект.
//  НекаяСтрока	- ДанныеФормыЭлементКоллекции, Структура - данные строки.
//  ИмяРеквизитаСпособаПривязки	 - Строка - имя реквизита способа привязки.
//  ИмяРеквизитаДаты - Строка - имя реквизита даты привязки.
//
Процедура ОбновитьДатуПривязкиВСтроке(Сроки, Проект, НекаяСтрока, ИмяРеквизитаСпособаПривязки, ИмяРеквизитаДаты) Экспорт
	
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("СпособПривязки", ИмяРеквизитаСпособаПривязки);
	ИменаРеквизитов.Вставить("ДатаЗаказа", ИмяРеквизитаДаты);
	
	РассчитатьДатуЗаказаВСтрокеДанных(НекаяСтрока, Проект, ИменаРеквизитов, Сроки);
	
КонецПроцедуры

// Обновляет дату привязки в строке.
//
// Параметры:
//  СтрокаДанных	 - ДанныеФормыЭлементКоллекции, Структура	 - данные строки.
//  Проект			 - СправочникСсылка.Проекты					 - проект.
//  ИменаРеквизитов	 - Структура								 - имена реквизитов способа привязки и даты привязки.
//  СтруктураСроки	 - Структура								 - свойства:
//  	* НачалоПлан	 - Дата - дата начала.
//  	* ЗавершениеПлан - Дата - дата окончания.
//
Процедура РассчитатьДатуЗаказаВСтрокеДанных(СтрокаДанных, Проект, ИменаРеквизитов, СтруктураСроки) Экспорт
	
	ДатаНачала = ДатаНачалаЗаказаПоСпособуПривязки(СтрокаДанных, ИменаРеквизитов.СпособПривязки, СтруктураСроки);
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		Возврат;
	КонецЕсли;
	
	ЗадержкаЗаказа = СтрокаДанных.ЗадержкаЗаказа;
	НоваяДатаПривязки =  упоУправлениеФормамиСервер.РассчитатьЗадержкуПоКалендарю(ДатаНачала, ЗадержкаЗаказа, Проект);
	
	Если НоваяДатаПривязки = Неопределено Тогда
		НоваяДатаПривязки = Дата("00010101000000");
	КонецЕсли;
	
	Если СтрокаДанных[ИменаРеквизитов.ДатаЗаказа] <> НоваяДатаПривязки Тогда
		СтрокаДанных[ИменаРеквизитов.ДатаЗаказа] = НоваяДатаПривязки;
	КонецЕсли;
	
КонецПроцедуры

// Рассчитывает задержку заказа в строке данных по календарю проекта, способу привязки и дате заказа.
//
// Параметры:
//  СтрокаДанных	 - КоллекцияДанныхФормы - строка данных для расчета.
//  Проект			 - СправочникСсылка.Проекты	 - проект для получения календаря расчета.
//  ИменаРеквизитов	 - Структура - структура имен реквизитов СпособПривязки и ДатаЗаказа.
//  СтруктураСроки	 - Структура - структура сроков задачи для расчета.
//
Процедура РассчитатьЗадержкуЗаказаВСтрокеДанных(СтрокаДанных, Проект, ИменаРеквизитов, СтруктураСроки) Экспорт
	
	ДатаНачала = ДатаНачалаЗаказаПоСпособуПривязки(СтрокаДанных, ИменаРеквизитов.СпособПривязки, СтруктураСроки);
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаЗаказа = СтрокаДанных[ИменаРеквизитов.ДатаЗаказа];
	
	Если ДатаЗаказа = ДатаНачала Тогда
		СтрокаДанных.ЗадержкаЗаказа = 0;
		Возврат;
	КонецЕсли;
	
	ДанныеДаты = упоУправлениеФормамиКлиент.РассчитатьЗадержкуПоКалендарюСтрокиТаблицы(ДатаНачала, ДатаЗаказа, Проект);
	
	Если ДанныеДаты = Неопределено Тогда
		СтрокаДанных.ЗадержкаЗаказа = 0;
		СтрокаДанных[ИменаРеквизитов.ДатаЗаказа] = ДатаНачала;
		Возврат;
	КонецЕсли;
	
	СтрокаДанных.ЗадержкаЗаказа = ДанныеДаты.Задержка;
	СтрокаДанных[ИменаРеквизитов.ДатаЗаказа] = ДанныеДаты.ДатаПоКалендарю;
	
КонецПроцедуры

// Обновляет дату выпуска в строке или таблице.
//
// Параметры:
//  Объект					 - ДанныеФормы, УправляемаяФорма - владелец таблицы.
//  ТекСтрока				 - ДанныеФормыЭлементКоллекции, Неопределено - данные строки.
//  СтруктураСроки			- Неопределено, Структура 								- свойства:
//		* НачалоПлан		- Дата - дата начала.
//		* ЗавершениеПлан	- Дата - дата окончания.
//
Процедура ОбновитьДатуВыпускаПланВыпуска(Объект, ТекСтрока = Неопределено, Знач СтруктураСроки = Неопределено) Экспорт
	
	Если СтруктураСроки = Неопределено Тогда
		СтруктураСроки = упоПроектыИЗадачиОбщие.СтруктураСроки(Объект.ДатаНачалаПлан, Объект.ДатаЗавершенияПлан);
	КонецЕсли;
	
	Если ТекСтрока = Неопределено Тогда
		Для каждого лСтрока Из Объект.Субпродукты Цикл
			ОбновитьДатуВыпускаПланаВыпускаВСтроке(СтруктураСроки, Объект.Проект, лСтрока);
		КонецЦикла;
	Иначе
		ОбновитьДатуВыпускаПланаВыпускаВСтроке(СтруктураСроки, Объект.Проект, ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

// Обновляет дату заказа потребности в строке или таблице.
//
// Параметры:
//  Объект					 - ДанныеФормы, УправляемаяФорма - владелец таблицы.
//  ТекСтрока				 - ДанныеФормыЭлементКоллекции, Неопределено - данные строки.
//  СтруктураСроки			- Неопределено, Структура 								- свойства:
//		* НачалоПлан		- Дата - дата начала.
//		* ЗавершениеПлан	- Дата - дата окончания.
//
Процедура ОбновитьДатуЗаказаПотребности(Объект, ТекСтрока = Неопределено, Знач СтруктураСроки = Неопределено) Экспорт
	
	Если СтруктураСроки = Неопределено Тогда
		СтруктураСроки = упоПроектыИЗадачиОбщие.СтруктураСроки(Объект.ДатаНачалаПлан, Объект.ДатаЗавершенияПлан);
	КонецЕсли;
	
	Если текСтрока = Неопределено Тогда
		Для каждого лСтрока Из Объект.МатериальныеРесурсы Цикл
			ОбновитьДатуЗаказаПотребностиВСтроке(СтруктураСроки, Объект.Проект, лСтрока);
		КонецЦикла;
	Иначе
		ОбновитьДатуЗаказаПотребностиВСтроке(СтруктураСроки, Объект.Проект, текСтрока);
	КонецЕсли;
	
КонецПроцедуры

// Полностью очищает список выбора у заданного элемента формы.
//
// Параметры:
//  Форма		 - УправляемаяФорма
//  Элемент		 - ЭлементФормы
//  Подтвердить	 - Булево	 - флаг необходимости запроса подтверждения.
//
Процедура ОчиститьСписокВыбора(Форма = Неопределено, Элемент, Подтвердить = Ложь) Экспорт

	Если Элемент.СписокВыбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Контекст = Новый Структура;
	Контекст.Вставить("Элемент",Элемент);
	
	Если Подтвердить Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьСписокВыбораЗавершение", ЭтотОбъект, Контекст);
		упоРаботаСДиалогамиКлиент.упоВопрос("Очистить также список выбора?",
			РежимДиалогаВопрос.ДаНет, 120, КодВозвратаДиалога.Да ,,, ОписаниеОповещения);
	Иначе
		ОчиститьСписокВыбораЗавершение(Неопределено,Контекст);
	КонецЕсли; 

КонецПроцедуры

// Обработчик завершения процедуры "Очистить список выбора".
//
// Параметры:
//  Результат				 - КодВозвратаДиалога	 - ответ.
//  ДополнительныеПараметры	 - Структура			 - параметры.
//
Процедура ОчиститьСписокВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Нет Тогда
		ДополнительныеПараметры.Элемент.СписокВыбора.Очистить();	
	КонецЕсли;
	
КонецПроцедуры

// См. упоУправлениеФормамиСервер.РассчитатьЗадержкуПоКалендарюСтрокиТаблицы
//
Функция РассчитатьЗадержкуПоКалендарюСтрокиТаблицы(Знач ДатаНачала, Знач ДатаЗаказа, Проект) Экспорт
	
	Возврат упоУправлениеФормамиСервер.РассчитатьЗадержкуПоКалендарюСтрокиТаблицы(ДатаНачала, ДатаЗаказа, Проект);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СписокРолейПриИзмененииСпискаПодразделений(Форма) Экспорт
	
	Если Форма.СписокПодразделений.Количество() = 0 Тогда
		Форма.СписокРолей.ДоступныеЗначения = Неопределено;
	Иначе
		мДоступныхРолей = упоУправлениеФормамиСервер.ДоступныеРолиПоПодразделению(Форма.СписокПодразделений);
		СписокДоступныхРолей = Новый СписокЗначений;
		СписокДоступныхРолей.ЗагрузитьЗначения(мДоступныхРолей);
		Форма.СписокРолей.ДоступныеЗначения = СписокДоступныхРолей;
		мУдалить = Новый Массив;
		Для Каждого ЭлементСписка Из Форма.СписокРолей Цикл
			Если СписокДоступныхРолей.НайтиПоЗначению(ЭлементСписка.Значение) = Неопределено Тогда
				мУдалить.Добавить(ЭлементСписка);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ЭлементУдалить Из мУдалить Цикл
			Форма.СписокРолей.Удалить(ЭлементУдалить);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Завершение обработчика нажатия на гиперссылку реквизита объекта.
// Вызывается в процедурах НадписьДокументОснованиеНажатие и ОбработатьНажатиеНаГиперссылкуРеквизитаОбъекта.
//
Процедура НажатиеНаГиперссылкуРеквизитаОбъектаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Ссылка = ВыбранныйЭлемент.Значение;
	
	ПараметрыВыбора = Новый Структура("РежимВыбора", Истина);
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Проекты") Тогда		
				
		Если ДополнительныеПараметры.Свойство("ИмяРеквизитаОбъекта") Тогда
			Если ДополнительныеПараметры.ИмяРеквизитаОбъекта = "Проект" Тогда
				ПараметрыВыбора.Вставить("ЭтоФормаВыбораПроекта", Истина);
			ИначеЕсли ДополнительныеПараметры.ИмяРеквизитаОбъекта = "ПроектнаяЗадача" Тогда
				ПараметрыВыбора.Вставить("ЭтоФормаВыбораПроектнойЗадачиКакПроекта", Истина);
			КонецЕсли;
		КонецЕсли;
		
		Попытка 		
			ТекущееЗначение = ДополнительныеПараметры.Форма.Объект[ДополнительныеПараметры.ИмяРеквизитаОбъекта];
			ПараметрыВыбора.Вставить("ТекущаяСтрока", ТекущееЗначение);
		Исключение
		КонецПопытки;
		
		ФормаВыбора = ПолучитьФорму("Справочник.Проекты.ФормаВыбора", ПараметрыВыбора, ДополнительныеПараметры.Форма);	
				
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда		 
		
		ПараметрыВыбора.Вставить("ЭтоФормаВыбораПроектнойЗадачи", Истина);
		
		Попытка 		
			ТекущееЗначение = ДополнительныеПараметры.Форма.Объект[ДополнительныеПараметры.ИмяРеквизитаОбъекта];
			ПараметрыВыбора.Вставить("ТекущаяСтрока", ТекущееЗначение);
		Исключение
		КонецПопытки;
		
		ФормаВыбора = ПолучитьФорму("Справочник.Проекты.ФормаВыбора", ПараметрыВыбора, ДополнительныеПараметры.Форма);
		
	Иначе		
		
		ФормаВыбора = ПолучитьФорму(упоУправлениеФормамиСервер.ВернутьСтрокуТипа(Ссылка, Истина, "")
			+ ".ФормаВыбора", ПараметрыВыбора, ДополнительныеПараметры.Форма);		
			
	КонецЕсли;
	
	Если ФормаВыбора <> Неопределено Тогда
		ФормаВыбора.Открыть();	
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДатаНачалаЗаказаПоСпособуПривязки(СтрокаДанных, ИмяРеквизитаСпособПривязки, СтруктураСроки)
	
	ДатаНачала = Неопределено;
	
	СпособПривязки = СтрокаДанных[ИмяРеквизитаСпособПривязки];
	
	Если СпособПривязки = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Перечисление.упоСпособПривязкиПоставокИСубпродуктов.НачалоЗадачи") Тогда
		
		ДатаНачала = СтруктураСроки.НачалоПлан;
		
	ИначеЕсли СпособПривязки  = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
		"Перечисление.упоСпособПривязкиПоставокИСубпродуктов.ЗавершениеЗадачи") Тогда
		
		ДатаНачала = СтруктураСроки.ЗавершениеПлан;
		
	КонецЕсли;
	
	Возврат ДатаНачала;
	
КонецФункции

#КонецОбласти
