
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
		
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	Для Каждого СтрокаИндикатора Из Объект.Индикаторы Цикл		
		
		СтруктураДопСвойствИндикатора = ПолучитьСтруктуруСвойствИндикатора(СтрокаИндикатора.Индикатор);
		ЗаполнитьЗначенияСвойств(СтрокаИндикатора, СтруктураДопСвойствИндикатора);

	КонецЦикла;
	
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
	
	ЗаполнитьГруппуПроект(Объект.Проект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
	ПроверитьКорректностьЗаполнения(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
		
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Оповестить("ИзменилисьПоказателиПроекта", Объект.Проект, ЭтаФорма); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	  
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеТипов(Элемент)
	
	ТекущиеДанные = Элементы.Индикаторы.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Элемент.ПодчиненныеЭлементы.ИндикаторыЗначениеИндикатора.ОграничениеТипа = ТекущиеДанные.ТипЗначенияИндикатора;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектнаяЗадачаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Проект) Тогда
		Сообщение = НСтр("ru = 'Укажите проект'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		Возврат;
	КонецЕсли;
	
	Пар = Новый Структура;
	Пар.Вставить("Проект",Проект);
	Пар.Вставить("ТекЗадача",ПроектнаяЗадача);
	Пар.Вставить("ВыбиратьТолькоЭтапы",Ложь);
	Пар.Вставить("ВозвращатьСсылкуНаЗеркальныйПроект",Истина);
	ОткрытьФорму("Обработка.упоВыборПроектнойЗадачи.Форма.ОсновнаяФормаУправляемая",Пар,ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектнаяЗадачаПриИзменении(Элемент)
	
	ЗаполнитьГруппуПроект(ПроектнаяЗадача);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораПроекта = Новый Структура("РежимВыбора", Истина);
	ПараметрыВыбораПроекта.Вставить("ЭтоФормаВыбораПроекта", Истина);
	ПараметрыВыбораПроекта.Вставить("ТекущаяСтрока", ЭтаФорма.Проект);
			
	ФормаВыбора = ПолучитьФорму("Справочник.Проекты.ФормаВыбора", ПараметрыВыбораПроекта, ЭтаФорма);	
		
	ФормаВыбора.Открыть();	
		
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Проект) Тогда
		ПроектнаяЗадача = Неопределено;
		Объект.Проект = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИндикаторы

&НаКлиенте
Процедура ИндикаторыИндикаторПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Индикаторы.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ПривестиТипИндикатораВСтроке(ТекущаяСтрока);
		
	КонецЕсли;           
	
	ТекущаяСтрока.ЗначениеИндикатора = Неопределено;
	УстановитьДляЭлементаОграничениеТипа(Элементы.ИндикаторыЗначениеИндикатора, ТекущаяСтрока.Индикатор);

КонецПроцедуры

&НаКлиенте
Процедура ИндикаторыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	УстановитьОграничениеТипов(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ИндикаторыПередНачаломИзменения(Элемент, Отказ)
	
	УстановитьОграничениеТипов(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ИндикаторыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Индикатор",
		Объект.Индикаторы, ЭтаФорма, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ИндикаторыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Индикатор",
		Объект.Индикаторы, ЭтаФорма, Истина);		

КонецПроцедуры

&НаКлиенте
Процедура ИндикаторыЗначениеИндикатораНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Индикаторы.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	УстановитьДляЭлементаОграничениеТипа(Элементы.ИндикаторыЗначениеИндикатора, ТекДанные.Индикатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ИндикаторыПриАктивизацииСтроки(Элемент)  
	
	ТекДанные = Элементы.Индикаторы.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	УстановитьДляЭлементаОграничениеТипа(Элементы.ИндикаторыЗначениеИндикатора, ТекДанные.Индикатор);    

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТаблицаИндикаторыПодобрать(Команда)
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);		

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИндикаторыЗаполнить(Команда)
	
	Если Объект.Индикаторы.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаИндикаторыЗаполнитьЗавершение",ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения,"Табличная часть будет очищена и заполнена заново. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ТаблицаИндикаторыЗаполнитьЗавершение(Неопределено,Неопределено);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИндикаторыЗаполнитьЗавершение(Ответ,ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Индикаторы.Очистить();
	КонецЕсли;
	
	ТаблицаИндикаторыЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаИндикаторыЗаполнитьНаСервере()
	
	Результат = РезультатЗапросаПолучитьИндикаторыПроекта(Объект.Проект);
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Индикаторы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ПривестиТипИндикатораВСтроке(НоваяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИндикаторыПересчитать(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.Проведен Тогда 
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаИндикаторыПересчитатьЗавершение",ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, "Для пересчета данных табличной части необходимо отменить проведение документа. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ТаблицаИндикаторыПересчитатьЗавершение(Неопределено, Неопределено);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИндикаторыПересчитатьЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда		
		ВызватьОтменуПроведения();
		Прочитать();
	КонецЕсли;	
	
	ТаблицаИндикаторыПересчитатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаИндикаторыПересчитатьНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПересчитатьИндикаторы();
		
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Для каждого СтрИндикатор Из Объект.Индикаторы Цикл
		ПривестиТипИндикатораВСтроке(СтрИндикатор);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВызватьОтменуПроведения()
	
	Если Объект.Проведен Тогда
		ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ОтменитьПроведениеДокумента();
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруСвойствИндикатора(ИндикаторСсылка)
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("ТипЗначенияИндикатора");
	
	ДанныеИндикатора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИндикаторСсылка, "ВидЗаполнения, ТипИндикатора, ТипСсылки");
	
	СтруктураСвойств.Вставить("ВидЗаполненияИндикатора", ДанныеИндикатора.ВидЗаполнения);
	
	МассивТипов =  Новый Массив;
	КЧ = Новый КвалификаторыЧисла(15, 3);
	КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	КС = Новый КвалификаторыСтроки(100);

	
	Если ДанныеИндикатора.ТипИндикатора = Перечисления.упоТипИндикатора.Число Тогда
		
		МассивТипов.Добавить(Тип("Число"));
		ОписаниеТиповИндикатор = Новый ОписаниеТипов(МассивТипов, КЧ);
		
	ИначеЕсли ДанныеИндикатора.ТипИндикатора = Перечисления.упоТипИндикатора.Дата Тогда
		
		МассивТипов.Добавить(Тип("Дата"));
		ОписаниеТиповИндикатор = Новый ОписаниеТипов(МассивТипов,,, КД);
		
	ИначеЕсли ДанныеИндикатора.ТипИндикатора = Перечисления.упоТипИндикатора.Булево Тогда
		
		МассивТипов.Добавить(Тип("Булево"));
		ОписаниеТиповИндикатор = Новый ОписаниеТипов(МассивТипов);
		
	ИначеЕсли ДанныеИндикатора.ТипИндикатора = Перечисления.упоТипИндикатора.Строка Тогда
		
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТиповИндикатор = Новый ОписаниеТипов(МассивТипов,, КС);		
		
	ИначеЕсли ДанныеИндикатора.ТипИндикатора = Перечисления.упоТипИндикатора.Ссылка Тогда
		
		МассивТипов = упоПанельПоказателейКлиентСервер.ПолучитьМассивТиповПоТипуСсылки(ДанныеИндикатора.ТипСсылки);
		ОписаниеТиповИндикатор = Новый ОписаниеТипов(МассивТипов);	
		
	Иначе
		
		МассивТипов.Добавить(Тип("Число"));
		МассивТипов.Добавить(Тип("Дата"));
		МассивТипов.Добавить(Тип("Булево"));
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТиповВсеСсылки = ОбщегоНазначения.ОписаниеТипаВсеСсылки();
		ОписаниеТиповИндикатор = Новый ОписаниеТипов(ОписаниеТиповВсеСсылки, МассивТипов,, КЧ, КС, КД);		
		
	КонецЕсли;
	
	СтруктураСвойств.ТипЗначенияИндикатора = ОписаниеТиповИндикатор;
	
	Возврат СтруктураСвойств;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьКорректностьЗаполнения(Отказ)
		
	МассивПоказателей = ПолучитьПоказателиПроекта(Объект.Проект);
	
	МассивСтрокНесоответствующихПоказателей = Новый Массив();
	Для каждого СтрПоказатель Из Объект.Индикаторы Цикл
		Индикатор = СтрПоказатель.Индикатор;
		Если МассивПоказателей.Найти(Индикатор) = Неопределено Тогда
			МассивСтрокНесоответствующихПоказателей.Добавить(СтрПоказатель.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Ошибки = Неопределено;
	Для Инд = 0 По МассивСтрокНесоответствующихПоказателей.ВГраница() Цикл
		СтрокаОшибки = МассивСтрокНесоответствующихПоказателей[Инд];
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"Объект.Индикаторы[%1].Индикатор",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Принадлежность показателя ""%1"" не соответствует выбранному проекту/проектной задаче.'"),
				Объект.Индикаторы[СтрокаОшибки - 1].Индикатор),
			"Объект.Индикаторы",
			СтрокаОшибки - 1,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Принадлежность показателя ""%1"" не соответствует выбранному проекту/проектной задаче.'"),
				Объект.Индикаторы[СтрокаОшибки - 1].Индикатор));
	КонецЦикла;
			
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоказателиПроекта(Проект)
		
	РезультатЗапроса = РезультатЗапросаПолучитьИндикаторыПроекта(Проект);
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Индикатор");
	
КонецФункции

&НаСервереБезКонтекста
Функция РезультатЗапросаПолучитьИндикаторыПроекта(Проект)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ПоказателиПроектов.Ссылка КАК Индикатор
					|ИЗ
					|	Справочник.упоПоказателиПроектов КАК ПоказателиПроектов
					|ГДЕ
					|	(НЕ ПоказателиПроектов.ЭтоГруппа)
					|	И НЕ ПоказателиПроектов.ВидЗаполнения = &ВидЗаполнения 
					|	И (ПринадлежностьПоказателя = Значение(Перечисление.упоПринадлежностьПоказателя.Общий)
					|		ИЛИ ПринадлежностьПоказателя В  (&ПринадлежностьПоказателя))
					|	И (НЕ ПоказателиПроектов.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("ВидЗаполнения", Перечисления.упоВидЗаполненияИндикатора.Автоматически);
	МассивПринадлежностьПоказателя = Новый Массив;
	МассивПринадлежностьПоказателя.Добавить(?(Проект.ЭтоПроектнаяЗадача,
		Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроектнойЗадачи,
		Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроекта));	
	Запрос.УстановитьПараметр("ПринадлежностьПоказателя", МассивПринадлежностьПоказателя);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПривестиТипИндикатораВСтроке(СтрокаТаблицы) 
	
	СтруктураДопСвойствИндикатора = ПолучитьСтруктуруСвойствИндикатора(СтрокаТаблицы.Индикатор);
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураДопСвойствИндикатора);
	ТипЗнчИндикатора = ТипЗнч(СтрокаТаблицы.ЗначениеИндикатора);
	
	Если Не СтрокаТаблицы.ТипЗначенияИндикатора.СодержитТип(ТипЗнчИндикатора) Тогда
		
		Если СтрокаТаблицы.ТипЗначенияИндикатора.СодержитТип(Тип("Булево")) Тогда
			
			СтрокаТаблицы.ЗначениеИндикатора = Ложь;
			
		ИначеЕсли СтрокаТаблицы.ТипЗначенияИндикатора.СодержитТип(Тип("Число")) Тогда 
			
			СтрокаТаблицы.ЗначениеИндикатора = 0;
			
		ИначеЕсли СтрокаТаблицы.ТипЗначенияИндикатора.СодержитТип(Тип("Дата")) Тогда 
			
			СтрокаТаблицы.ЗначениеИндикатора = Дата(1, 1, 1);
			
		ИначеЕсли СтрокаТаблицы.ТипЗначенияИндикатора.СодержитТип(Тип("Строка")) Тогда 	
			
			СтрокаТаблицы.ЗначениеИндикатора = "";
			
		Иначе
		
			СтрокаТаблицы.ЗначениеИндикатора = Неопределено;
			
		КонецЕсли;			
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	упоУправлениеФормамиКлиент.НадписьДокументОснованиеНажатие(Объект, ЭтаФорма, "Проект");

КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	// Перенаправим заполнение реквизитов документа
	// процедуре модуля.	
	// И приведем гиперссылку в правильный вид.
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Проекты") Тогда
		
		ЗаполнитьГруппуПроект(ВыбранноеЗначение);
		//Объект.Проект = ВыбранноеЗначение;
		
	КонецЕсли;
	
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуПроект(ВыбПроект) 
	
	Если ВыбПроект.ЭтоПроектнаяЗадача Тогда
		
		Проект = ВыбПроект.упоКорневойПроект;
		ПроектнаяЗадача = ВыбПроект;
		
	Иначе
		
		Проект = ВыбПроект;
		ПроектнаяЗадача = Неопределено;
		
	КонецЕсли;
	
	Объект.Проект = ВыбПроект;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры(имяКоманды)
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	 		
	АдресХранилища = "";
	
	Если имяКоманды = "ТаблицаИндикаторыПодобрать" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.Индикаторы;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоПоказателиПроектов";
        ТаблицаФормы = Объект.Индикаторы;
	    ИмяКолонки = "Индикатор";		
				
	КонецЕсли;
		
	СтруктураДоп = ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы, ИмяКолонки,
		ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
		
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
	
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаСервере
Функция ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
	
	СтруктураДоп  = Новый Структура;
	
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");
	
	Если имяКоманды = "ТаблицаИндикаторыПодобрать" Тогда
		
		СтруктураДоп.АдресХранилищаОтбора = ПодготовитьТаблицуОтбораПодбора(имяКоманды);
			
	КонецЕсли;

	АдресХранилища  = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок);
	СтруктураДоп.АдресХранилищаВыбранных = АдресХранилища;
	
	Возврат СтруктураДоп;
	
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуОтбораПодбора(имяКоманды)
	
	Перем ТаблицаОтбора;
	
	упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуОтбора(ТаблицаОтбора);	  
	
	Если имяКоманды ="ТаблицаИндикаторыПодобрать" Тогда
		
		НоваяСтрока =  ТаблицаОтбора.Добавить();
		
		НоваяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидЗаполнения");
		НоваяСтрока.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
		НоваяСтрока.Применение =  ТипПримененияОтбораКомпоновкиДанных.Элементы;
		НоваяСтрока.Использование  = Истина;
		НоваяСтрока.РежимОтображения =  РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
		
		СписокВидов = Новый СписокЗначений;
		СписокВидов.Добавить(Перечисления.упоВидЗаполненияИндикатора.АвтоматическиВДокументе);
		СписокВидов.Добавить(Перечисления.упоВидЗаполненияИндикатора.Вручную);
		НоваяСтрока.ПравоеЗначение = СписокВидов;
		
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, ЭтаФорма.УникальныйИдентификатор);
	  
КонецФункции

// Выполняет действия при подборе.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции, Структура - строка, дял которой должны выполниться действия.
//  ПараметрыПодбора	 - Произвольный - параметр подбора.
&НаКлиенте
Процедура ВыполнитьДействияПриПодборе(СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт
	
	СтруктураДопСвойствИндикатора = ПолучитьСтруктуруСвойствИндикатора(СтрокаТабличнойЧасти.Индикатор);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДопСвойствИндикатора);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

&НаКлиенте
Процедура УстановитьДляЭлементаОграничениеТипа(Элемент, Индикатор)
	
	Элемент.ОграничениеТипа = Новый ОписаниеТипов;
	Элемент.ВыбиратьТип = Истина;  
	
	Если Не ЗначениеЗаполнено(Индикатор) Тогда     
		Возврат;
	КонецЕсли;     

	ОграничениеТипа = ПолучитьТипИндикатора(Индикатор);    
	
	Если ОграничениеТипа = Неопределено Тогда     
		Возврат;
	КонецЕсли;     
	
	Элемент.ОграничениеТипа = ОграничениеТипа;
	Элемент.ВыбиратьТип = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипИндикатора(Индикатор)
	
	ОграничениеТипа = Неопределено;
	Если Индикатор.ТипИндикатора = Перечисления.упоТипИндикатора.Дата Тогда
		ОграничениеТипа = Новый ОписаниеТипов("Дата");
	ИначеЕсли Индикатор.ТипИндикатора = Перечисления.упоТипИндикатора.Булево Тогда
		ОграничениеТипа = Новый ОписаниеТипов("Булево");
	ИначеЕсли Индикатор.ТипИндикатора = Перечисления.упоТипИндикатора.Строка Тогда
		ОграничениеТипа = Новый ОписаниеТипов("Строка");
	ИначеЕсли Индикатор.ТипИндикатора = Перечисления.упоТипИндикатора.Число Тогда
		ОграничениеТипа = Новый ОписаниеТипов("Число");
	ИначеЕсли Индикатор.ТипИндикатора = Перечисления.упоТипИндикатора.Ссылка Тогда
		СсылкаИндикатор = ТипЗнч(Индикатор.ТипСсылки); 
		Если СсылкаИндикатор = Тип("Неопределено") Тогда
			Возврат ОграничениеТипа;
		КонецЕсли;
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(СсылкаИндикатор);	
		ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);	
	КонецЕсли;
	
	Возврат ОграничениеТипа;
	
КонецФункции

#КонецОбласти

#КонецОбласти
