
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Неопределено, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Неопределено, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Неопределено, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Неопределено, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Неопределено, Отказ, СтандартнаяОбработка); 
	
	упоТекущийПроект = ПараметрыСеанса.упоТекущийПроект;
	ДобавитьВызовОтчетов();
	
	СохрОтборПроектов = ХранилищеОбщихНастроек.Загрузить("упоОтборПроектов",,"Отбор проектов");
	Если СохрОтборПроектов = Неопределено Тогда
		ОтборПроектов = Перечисления.упоВидыСписковПроектов.ПроектыВыполняемые;
	Иначе
		ОтборПроектов = СохрОтборПроектов;
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда	
		Элементы.НадписьPM.Видимость = Ложь;
		Элементы.НадписьERP.Видимость = Истина;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура упоТекущийПроектПриИзменении(Элемент)
	
	упоПроектыИЗадачиКлиент.УстановитьПроектТекущим(упоТекущийПроект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПроектовПриИзменении(Элемент)
	
	ОбработатьИзменениеОтбораПроектовНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Функция ОткрытьОтчет(Команда) 
	
	Если Найти(Команда.Имя, "ДляПроекта") <> 0 Тогда
		ПрефиксКоманды = "КомандаДляПроекта";
		ПараметрПроект = упоТекущийПроект;
	ИначеЕсли Найти(Команда.Имя, "ДляПортфеля") <> 0 Тогда
		ПрефиксКоманды = "КомандаДляПортфеля";
		ПараметрПроект = ПолучитьПроектыПоФильтруПортфеля()
	КонецЕсли;
	
	упоРаботаСФормамиКлиент.ОткрытьОтчетПроектаПоСлужебнойКоманде(ЭтаФорма, Команда, ПрефиксКоманды, ПараметрПроект);
	
КонецФункции

&НаКлиенте
Процедура ФазыПроекта(Команда)
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("ЖурналДокументов.упоУправлениеПроектом.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПортфельЗаказов(Команда)
	
	Портфель = ПредопределенноеЗначение("Перечисление.упоВидыСписковПроектов.ПортфельЗаказов");
	ПараметрыОткрытия = Новый Структура("ВидОтбораПроекта", Портфель);
	ПараметрыОткрытия.Вставить("Проект", ПолучитьПроектыПоФильтруПортфеля(Портфель));
	ОткрытьФорму("Справочник.Проекты.ФормаСписка", ПараметрыОткрытия, ЭтаФорма, Портфель);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроектыВИнициации(Команда)
	
	Портфель = ПредопределенноеЗначение("Перечисление.упоВидыСписковПроектов.ПроектыВИнициации");
	ПараметрыОткрытия = Новый Структура("ВидОтбораПроекта", Портфель);
	ПараметрыОткрытия.Вставить("Проект", ПолучитьПроектыПоФильтруПортфеля(Портфель));
	ОткрытьФорму("Справочник.Проекты.ФормаСписка", ПараметрыОткрытия, ЭтаФорма, Портфель);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроектыВыполняемые(Команда)
	
	Портфель = ПредопределенноеЗначение("Перечисление.упоВидыСписковПроектов.ПроектыВыполняемые");
	ПараметрыОткрытия = Новый Структура("ВидОтбораПроекта", Портфель);
	ПараметрыОткрытия.Вставить("Проект", ПолучитьПроектыПоФильтруПортфеля(Портфель));
	ОткрытьФорму("Справочник.Проекты.ФормаСписка", ПараметрыОткрытия, ЭтаФорма, Портфель);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроектыЗавершенные(Команда)
	
	Портфель = ПредопределенноеЗначение("Перечисление.упоВидыСписковПроектов.ПроектыЗавершенные");
	ПараметрыОткрытия = Новый Структура("ВидОтбораПроекта", Портфель);
	ПараметрыОткрытия.Вставить("Проект", ПолучитьПроектыПоФильтруПортфеля(Портфель));
	ОткрытьФорму("Справочник.Проекты.ФормаСписка", ПараметрыОткрытия, ЭтаФорма, Портфель);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроектыОстановленные(Команда)
	
	Портфель = ПредопределенноеЗначение("Перечисление.упоВидыСписковПроектов.ПроектыОстановленные");
	ПараметрыОткрытия = Новый Структура("ВидОтбораПроекта", Портфель);
	ПараметрыОткрытия.Вставить("Проект", ПолучитьПроектыПоФильтруПортфеля(Портфель));
	ОткрытьФорму("Справочник.Проекты.ФормаСписка", ПараметрыОткрытия, ЭтаФорма, Портфель);
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	ОткрытьФорму("Обработка.упоМенюРазделовКонфигурации.Форма.Форма");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбработатьИзменениеОтбораПроектовНаСервере()
	
	ХранилищеОбщихНастроек.Сохранить("упоОтборПроектов",,ОтборПроектов,"Отбор проектов");
	
КонецФункции

&НаСервере
Функция ДобавитьВызовОтчетов()
	
	МассивОтчетовПоКатегориям = упоРаботаСФормамиСервер.ПолучитьМассивИменОсновныхОтчетовДляПроектаПоКатегориям();
	
	упоРаботаСФормамиСервер.ДобавитьВызовОтчетовПроектаНаФорму(ЭтаФорма, Элементы.ОтчетыПроекта, "КомандаДляПроекта",
		"ОткрытьОтчет", МассивОтчетовПоКатегориям);
		
	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить("упоСравнениеВерсий");
		
	упоРаботаСФормамиСервер.ДобавитьВызовОтчетовПроектаНаФорму(ЭтаФорма, Элементы.ОтчетыПортфеля, "КомандаДляПортфеля",
		"ОткрытьОтчет", МассивОтчетовПоКатегориям, МассивИсключений);
	
КонецФункции

&НаСервере
Функция ПолучитьПроектыПоФильтруПортфеля(Портфель = Неопределено) 
	
	Если Портфель = Неопределено Тогда 
		Портфель = ОтборПроектов;
	КонецЕсли;
	
	Если Портфель = Перечисления.упоВидыСписковПроектов.ПортфельЗаказов Тогда
		ПортфельЗаказов = Константы.упоПортфельЗаказов.Получить();
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Портфель", ПортфельЗаказов);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Проекты.Ссылка
		               |ИЗ
		               |	Справочник.Проекты КАК Проекты
		               |ГДЕ
		               |	Проекты.ПортфельПроектов = &Портфель";
		Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");					   
	Иначе
		
		МассивСтатусов = Новый Массив;
		
		Если Портфель = Перечисления.упоВидыСписковПроектов.ПроектыВИнициации Тогда
			МассивСтатусов.Добавить(Перечисления.упоСостояниеСтатусаПроекта.Запланирован);
			МассивСтатусов.Добавить(Перечисления.упоСостояниеСтатусаПроекта.Утвержден);
		ИначеЕсли Портфель = Перечисления.упоВидыСписковПроектов.ПроектыВыполняемые Тогда
			МассивСтатусов.Добавить(Перечисления.упоСостояниеСтатусаПроекта.Выполняется);
		ИначеЕсли Портфель = Перечисления.упоВидыСписковПроектов.ПроектыЗавершенные Тогда
			МассивСтатусов.Добавить(Перечисления.упоСостояниеСтатусаПроекта.Завершен);
		ИначеЕсли Портфель = Перечисления.упоВидыСписковПроектов.ПроектыОстановленные Тогда
			МассивСтатусов.Добавить(Перечисления.упоСостояниеСтатусаПроекта.Остановлен);			
		КонецЕсли;
		
		Массив = ПолучитьПроектыНеЗаказыВСтатусах(МассивСтатусов);
		
	КонецЕсли;	
	
	Возврат Массив;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПроектыНеЗаказыВСтатусах(МассивСтатусов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	Запрос.УстановитьПараметр("Портфель", Константы.упоПортфельЗаказов.Получить());
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСтатусыПроектовСрезПоследних.Проект
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектов.СрезПоследних КАК упоСтатусыПроектовСрезПоследних
	               |ГДЕ
	               |	упоСтатусыПроектовСрезПоследних.СтатусПроекта В(&Статусы)
	               |	И упоСтатусыПроектовСрезПоследних.Проект.ПортфельПроектов <> &Портфель";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект");
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСтруктуруПрограммыПортфеля(Команда)
	
	Если НуженВыборТипаСтруктуры(упоТекущийПроект) Тогда		
		ВыборТипаСтруктуры();
	Иначе
		упоСтруктураПроектаКлиент.ОткрытьСтруктуруПрограммы(упоТекущийПроект);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НуженВыборТипаСтруктуры(ТекущийПроект)
	
	Компонент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПроект, "Компонент");
	
	Возврат НЕ (Компонент = Перечисления.упоКомпоненты.ПортфельПроектов 
		ИЛИ Компонент = Перечисления.упоКомпоненты.ПрограммаПроектов);
	
КонецФункции	

&НаКлиенте
Функция ВыборТипаСтруктуры() 
	
	СписокДействий = Новый СписокЗначений;	
	СписокДействий.Добавить("ОткрытьСтруктуруПрограммы", НСтр("ru = 'Структура программы'"));
	СписокДействий.Добавить("ОткрытьСтруктуруПортфеля", НСтр("ru = 'Структура портфеля'"));
							                                                	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаСтруктурыЗавершение", ЭтотОбъект);		
		
	ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДействий);
		
КонецФункции

&НаКлиенте
Процедура ВыборТипаСтруктурыЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;

	Если ВыбранныйЭлемент.Значение = "ОткрытьСтруктуруПрограммы" Тогда
		
		упоСтруктураПроектаКлиент.ОткрытьСтруктуруПрограммы(упоТекущийПроект);
		
	ИначеЕсли ВыбранныйЭлемент.Значение = "ОткрытьСтруктуруПортфеля" Тогда
		
		упоСтруктураПроектаКлиент.ОткрытьСтруктуруПрограммы(упоТекущийПроект, Истина);
		
	КонецЕсли;	
			
КонецПроцедуры


#КонецОбласти