#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Макет = Неопределено;
	
	Если Параметры.Свойство("ИмяМакета") Тогда
		Макет = Справочники.упоВидыСобытий.ПолучитьМакет(Параметры.ИмяМакета);
	КонецЕсли;
	
	Если Параметры.Свойство("Макет") Тогда
		Макет = Параметры.Макет;
	КонецЕсли;
	
	Если Макет = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Текст = Макет.ПолучитьТекст();
	
	ДокументHTML = Текст;
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	Иначе
		Заголовок = НСтр("ru = 'Информация'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти