
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПересчитатьТипСсылки();
	
	МодифицироватьЗаблокироватьФормуПредустановленного();
	
	ИнициализироватьФорму();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
		
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		   
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИнициализироватьФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	ВидимостьВыраженияГруппировки();
	
	#Если Не ВебКлиент Тогда
	УстановитьВидимостьКонструктораЗапроса();     	
	#КонецЕсли
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ);
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	ТекущийОбъект.ПараметрыЗапроса 	 = Новый ХранилищеЗначения(ТаблицаПараметров.Выгрузить());
	ТекущийОбъект.ПараметрыЗапросаПЗ = Новый ХранилищеЗначения(ТаблицаПараметровПЗ.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Оповестить("ИзменилисьНастройкиПоказателейОтчета");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	Если НЕ СостоянияОднозначны() Тогда
		Отказ = Истина;
	КонецЕсли;	
  
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПоляОбъектаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СформироватьСписокВыбораНаКлиенте(Элемент.Имя, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПоляЗначенияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СформироватьСписокВыбораНаКлиенте(Элемент.Имя, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПоляОбъектаПЗАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СформироватьСписокВыбораНаКлиенте(Элемент.Имя, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПоляЗначенияПЗАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СформироватьСписокВыбораНаКлиенте(Элемент.Имя, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельГлавнаяПриСменеСтраницы(Элемент, ТекущаяСтраница)
		
	Если Элементы.ПанельГлавная.ТекущаяСтраница = Элементы.СтраницаСостоянияИндикатора Тогда
		
		ТолькоПросмотрЭУ = Объект.ТипИндикатора.Пустая();
		
		Элементы.СтраницаСостоянияИндикатора.ТолькоПросмотр = ТолькоПросмотрЭУ;
		Для каждого ЭлементПанели Из Элементы.ТаблицаСостояний.КоманднаяПанель.ПодчиненныеЭлементы Цикл
		    ЭлементПанели.Доступность = НЕ ТолькоПросмотрЭУ;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипИндикатораПриИзменении(Элемент)
	
	УстановитьВидимостьНастроекДляМонитораПроекта();
	
	Если ТаблицаСостояний.Количество() > 0
	   И (ПредыдущийТипЗначения <> Объект.ТипИндикатора) Тогда
	   
	   ОписаниеОповещения = Новый ОписаниеОповещения("ТипИндикатораПриИзмененииЗавершение", ЭтотОбъект);
	   
	    Если Объект.ТипИндикатора.Пустая() Тогда
			ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Таблица состояний будет очищена. Продолжить?'"),
				РежимДиалогаВопрос.ДаНет, 120, КодВозвратаДиалога.Нет, "Внимание");
		Иначе
			ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Изменился тип значений таблицы состояний. Очистить состояния?'"),
				РежимДиалогаВопрос.ДаНет, 120, КодВозвратаДиалога.Нет, "Внимание");
		КонецЕсли;
	Иначе
		ТипИндикатораПриИзмененииЗавершение(Неопределено, Неопределено);		
	КонецЕсли;
			
КонецПроцедуры

// Обработчик события "Тип индикатора при изменении" - завершение.
//
// Параметры:
//  Ответ					 - 	 - 
//  ДополнительныеПараметры	 - 		 - 
//
&НаКлиенте
Процедура ТипИндикатораПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	ТипИзменился = Истина;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ТаблицаСостояний.Очистить();
	ИначеЕсли ПредыдущийТипЗначения <> Объект.ТипИндикатора Тогда
	Иначе
		ТипИзменился = Ложь;
	КонецЕсли;
	
	Если ТипИзменился Тогда
		ПредыдущийТипЗначения = Объект.ТипИндикатора;
		ОбработатьТипСсылкиИСчитатьСуммуПоГруппировкам(ЭтаФорма);
		СчитатьСуммуПоГруппировкамПриИзменении(Неопределено);
	Иначе
		Объект.ТипИндикатора = ПредыдущийТипЗначения;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматнаяСтрокаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	ФорматнаяСтрока = Новый КонструкторФорматнойСтроки;
	ФорматнаяСтрока.Текст = Объект.ФорматнаяСтрока;
	ОписаниеОповещения = Новый ОписаниеОповещения("ФорматнаяСтрокаНачалоВыбораЗавершение", ЭтотОбъект);
	
	ФорматнаяСтрока.Показать(ОписаниеОповещения);
	
КонецПроцедуры

// Обработчик события "Форматная строка начало выбора" - завершение.
//
// Параметры:
//  Текст					 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
&НаКлиенте
Процедура ФорматнаяСтрокаНачалоВыбораЗавершение(Текст, ДополнительныеПараметры) Экспорт
	
	Если Текст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ФорматнаяСтрока = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗаполненияПриИзменении(Элемент)
	
	Если ИспользуетсяВРасчетныхИндикаторах() Тогда
		Объект.ТипЗаполнения = 1;
	КонецЕсли;
	
	ВидимостьЭУИсточникДанныхЗначенияПоказателя(Объект.ТипЗаполнения, Объект.ПринадлежностьПоказателя, ЭтаФорма);
	
	УстановитьВыражениеГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПринадлежностьПоказателяПриИзменении(Элемент)
	
	Если Объект.ПринадлежностьПоказателя = 
				ПредопределенноеЗначение("Перечисление.упоПринадлежностьПоказателя.Произвольный") Тогда
		
		 Объект.ВидЗаполнения = ПредопределенноеЗначение("Перечисление.упоВидЗаполненияИндикатора.Автоматически");
		 Объект.ТипИндикатора = ПредопределенноеЗначение("Перечисление.упоТипИндикатора.Число");
		 Объект.КартинкаПоУмолчанию = 0;
		 Объект.ПоказательИнвестирования = Ложь;
		 Объект.СчитатьСуммуПоГруппировкам = Ложь;
		 
		 СчитатьСуммуПоГруппировкамПриИзменении(Неопределено);
		 ВидимостьЭУСтраницаИсточник(Объект.ВидЗаполнения, ЭтаФорма);

	КонецЕсли;
	
	ВидимостьЭУИсточникДанныхЗначенияПоказателя(Объект.ТипЗаполнения, Объект.ПринадлежностьПоказателя, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура СчитатьСуммуПоГруппировкамПриИзменении(Элемент)
	
	ВидимостьВыраженияГруппировки();	
	Если Объект.СчитатьСуммуПоГруппировкам 
		И СтрДлина(Объект.ВыражениеГруппировки) = 0 Тогда
		
		Объект.ВыражениеГруппировки = "Сумма";
		
	КонецЕсли;
	
	Если Не Объект.СчитатьСуммуПоГруппировкам Тогда
		Объект.ВыражениеГруппировки = "";	
	КонецЕсли;
	
	УстановитьВыражениеГруппировки(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСсылкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ТипСсылки = ВыбранноеЗначение;
	
	// Присваиваем Объект.ТипСсылки пустую ссылку выбранного типа.
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ВыбранноеЗначение);	
	ОписаниеТипаВыбранногоТипа = Новый ОписаниеТипов(МассивТипов);	
	Объект.ТипСсылки = ОписаниеТипаВыбранногоТипа.ПривестиЗначение(Неопределено);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСсылкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещенияЗавершениеВыбора = Новый ОписаниеОповещения("ТипСсылкиНачалоВыбораЗавершение", ЭтотОбъект, Элемент);
	
	СписокТипов.ПоказатьВыборЭлемента(ОписаниеОповещенияЗавершениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСсылкиНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТипСсылкиОбработкаВыбора(ДополнительныеПараметры, ВыбранноеЗначение.Значение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСсылкиОчистка(Элемент, СтандартнаяОбработка)
	ТипСсылки = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ЦветовоеВыделениеПоложительныхИОтрицательныхЗначенийПриИзменении(Элемент)  
	
	УстановитьВидимостьНастроекДляМонитораПроекта();   
	
	Если Объект.ИнвертироватьЦветовоеВыделениеПоложительныхИОтрицательныхЗначений И Не Объект.ЦветовоеВыделениеПоложительныхИОтрицательныхЗначений Тогда
		Объект.ИнвертироватьЦветовоеВыделениеПоложительныхИОтрицательныхЗначений = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПараметров

&НаКлиенте
Процедура ТаблицаПараметровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ЭтоВыражение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметровЭтоВыражениеПриИзменении(Элемент)
	
	ЗапросПЗ = Элемент.Имя = "ТаблицаПараметровПЗЭтоВыражение";
	
	ТекДанные = ?(ЗапросПЗ, Элементы.ТаблицаПараметровПЗ.ТекущиеДанные, Элементы.ТаблицаПараметров.ТекущиеДанные);
	
	Если ТекДанные.ЭтоВыражение Тогда
		
		Если НЕ ТипЗнч(ТекДанные.ЗначениеПараметра) = Тип("Строка") Тогда
			ТекДанные.ЗначениеПараметра = "";
		КонецЕсли;
		
	Иначе // Значение
	
		Если ТипЗнч(ТекДанные.ЗначениеПараметра) = Тип("СписокЗначений") Тогда
			Если ТекДанные.ЗначениеПараметра.Количество() <> 0 Тогда
				Элементы.ТаблицаПараметров.ТекущиеДанные.ЗначениеПараметра = ТекДанные.ЗначениеПараметра[0].Значение;
			Иначе
				Элементы.ТаблицаПараметров.ТекущиеДанные.ЗначениеПараметра = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
	УправлениеКолонкамиПараметры(ЗапросПЗ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаСостояний

&НаКлиенте
Процедура ТаблицаСостоянийЗначениеСПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаСостояний.ТекущиеДанные;
	Если ТипЗнч(ТекДанные.ЗначениеС) = ТипЗнч(ТекДанные.ЗначениеПо) Тогда
		
		Если ТекДанные.ЗначениеС > ТекДанные.ЗначениеПо Тогда
			ТекДанные.ЗначениеПо = ТекДанные.ЗначениеС;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСостоянийЗначениеПоПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаСостояний.ТекущиеДанные;
	Если ТипЗнч(ТекДанные.ЗначениеС) = ТипЗнч(ТекДанные.ЗначениеПо) Тогда
		
		Если ТекДанные.ЗначениеС > ТекДанные.ЗначениеПо Тогда
			ТекДанные.ЗначениеПо = ТекДанные.ЗначениеС;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСостоянийЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяТЧ = "ТаблицаСостояний";
	ИмяКолонкиТЧ = "Значение";
	
	УстановитьОграничениеТиповДляЭлементаТЧ(Элемент, ИмяКолонкиТЧ, ИмяТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСостоянийЗначениеСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяТЧ = "ТаблицаСостояний";
	ИмяКолонкиТЧ = "ЗначениеС";
	
	УстановитьОграничениеТиповДляЭлементаТЧ(Элемент, ИмяКолонкиТЧ, ИмяТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСостоянийЗначениеПоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяТЧ = "ТаблицаСостояний";
	ИмяКолонкиТЧ = "ЗначениеПо";
	
	УстановитьОграничениеТиповДляЭлементаТЧ(Элемент, ИмяКолонкиТЧ, ИмяТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСостоянийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
		
	ИмяТЧ = "ТаблицаСостояний";
	
	ИмяКолонкиТЧ = "Значение";
	ЭлементЗначение = Элементы.ТаблицаСостоянийЗначение;
	УстановитьОграничениеТиповДляЭлементаТЧ(ЭлементЗначение, ИмяКолонкиТЧ, ИмяТЧ);
	
	ИмяКолонкиТЧ = "ЗначениеС";
	ЭлементЗначение = Элементы.ТаблицаСостоянийЗначениеС;
	УстановитьОграничениеТиповДляЭлементаТЧ(ЭлементЗначение, ИмяКолонкиТЧ, ИмяТЧ);
	
	ИмяКолонкиТЧ = "ЗначениеПо";
	ЭлементЗначение = Элементы.ТаблицаСостоянийЗначениеПо;
	УстановитьОграничениеТиповДляЭлементаТЧ(ЭлементЗначение, ИмяКолонкиТЧ, ИмяТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСостоянийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЭтаФорма.Модифицированность = Истина;
	СохранитьСостояния();
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСостоянийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаСостоянийКартинка" Тогда
		
		ТекДанные = Элемент.ТекущиеДанные;
		Если НЕ ТекДанные = Неопределено Тогда

			Контекст = Новый Структура;
			Контекст.Вставить("УИстроки",ТекДанные.ПолучитьИдентификатор());
	
			ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаСостоянийВыборОсновная",ЭтотОбъект,Контекст);
			ОткрытьФорму("ОбщаяФорма.упоФормаВыбораКартинкиУправляемая",,,,,,ОписаниеОповещения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "Таблица состояний выбор основная".
//
// Параметры:
//  ЗначениеКартинки		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
&НаКлиенте
Процедура ТаблицаСостоянийВыборОсновная(ЗначениеКартинки,ДополнительныеПараметры) Экспорт
	
	ТекДанные = ТаблицаСостояний.НайтиПоИдентификатору(ДополнительныеПараметры.УИстроки);
	
	Если НЕ ТекДанные = Неопределено И НЕ ЗначениеКартинки = Неопределено Тогда
		ТекДанные.Картинка = ЗначениеКартинки;
		ЭтаФорма.Модифицированность = Истина;
		СохранитьСостояния();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСостоянийПослеУдаления(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	СохранитьСостояния();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидЗаполнения

&НаКлиенте
Процедура ВидЗаполненияПриИзменении(Элемент)
	
	Если ИспользуетсяВРасчетныхИндикаторах() Тогда
		Объект.ВидЗаполнения = ТекущийВидЗаполнения;
	КонецЕсли;
	
	ВидимостьЭУСтраницаИсточник(Объект.ВидЗаполнения, ЭтаФорма);
	
	Если Элементы.СтраницаИсточник.Видимость Тогда
		ВидимостьЭУИсточникДанныхЗначенияПоказателя(Объект.ТипЗаполнения,Объект.ПринадлежностьПоказателя, ЭтаФорма);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущийВидЗаполнения = Объект.ВидЗаполнения;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныеИндикаторыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтоПредопределенныйЭлемент(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + Элемент.ТекущиеДанные.Представление;
	
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныеИндикаторыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Индикатор",
		Объект.РасчетныеИндикаторы, ЭтаФорма, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура РасчетныеИндикаторыПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элементы.РасчетныеИндикаторы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ПредПредставлениеПоказателя = "";
	Иначе
		ПредПредставлениеПоказателя = ТекДанные.Представление; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеВФормуле(ТекДанные)
	
	НовоеПредставление = ТекДанные.Представление;
	Если Не ПустаяСтрока(НовоеПредставление) И Не ПустаяСтрока(ПредПредставлениеПоказателя)  Тогда
		Объект.строкаФормулы = СтрЗаменить(Объект.строкаФормулы,ПредПредставлениеПоказателя,НовоеПредставление);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныеИндикаторыПредставлениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасчетныеИндикаторы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПредставлениеВФормуле(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныеИндикаторыИндикаторПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасчетныеИндикаторы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПредставлениеВФормуле(ТекДанные);
			
КонецПроцедуры

&НаКлиенте
Процедура строкаФормулыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры

 #КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьФормулу(Команда)
	
	ФормулаКорректна();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТекстЗапросаВФайл(Команда)
	ВыгрузитьТекстЗапросаВФайлОбщий(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТекстЗапросаИзФайла(Команда)
	ЗагрузитьТекстЗапросаИзФайлаОбщий(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТекстЗапросаВФайлПЗ(Команда)
	ВыгрузитьТекстЗапросаВФайлОбщий(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТекстЗапросаИзФайлаПЗ(Команда)
	ЗагрузитьТекстЗапросаИзФайлаОбщий(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСостояния(Команда)
	
	СостоянияОднозначны();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьКартинкуОсновная",ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.упоФормаВыбораКартинкиУправляемая",,,,,,ОписаниеОповещения);
	
КонецПроцедуры

// Обработчик события "Выбрать картинку основная".
//
// Параметры:
//  ЗначениеКартинки		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
&НаКлиенте
Процедура ВыбратьКартинкуОсновная(ЗначениеКартинки, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеКартинки = Неопределено Тогда
		
		Объект.КартинкаПоУмолчанию = ЗначениеКартинки;
		ЭтотОбъект.Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗапрос(Команда)
		
	ПроверитьЗапросСПредупреждением(Объект.ТекстЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗапросПЗ(Команда)

	ПроверитьЗапросСПредупреждением(Объект.ТекстЗапросаПЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьРасчетныеИндикаторы(Команда)
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыИзЗапроса(Команда)
	
	ЗапросПЗ = Команда.Имя = "ЗаполнитьПараметрыИзЗапросаПЗ";
	
	ТабПараметры = ?(ЗапросПЗ, ТаблицаПараметровПЗ, ТаблицаПараметров);
	
	ДополнительныеПараметры = Новый Структура("ТабПараметры",ТабПараметры);
	ДополнительныеПараметры.Вставить("ЗапросПЗ",ЗапросПЗ);
	
	Если ТабПараметры.Количество() <> 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПараметрыИзЗапросаЗавершение",ЭтотОбъект,ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения,
						НСтр("ru = 'Таблица параметров будет очищена. Продолжить?'"), 
						РежимДиалогаВопрос.ДаНет, 
						120, 
						КодВозвратаДиалога.Нет);
	КонецЕсли;
	
	ЗаполнитьПараметрыИзЗапросаЗавершение(Неопределено,ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаУсловие(Команда)
	
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "ВЫБОР КОГДА   ТОГДА   ИНАЧЕ   КОНЕЦ";	
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаПлюс(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + " + ";
КонецПроцедуры

&НаКлиенте
Процедура ФормулаМинус(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + " - ";
КонецПроцедуры

&НаКлиенте
Процедура ФормулаУмножить(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + " * ";
КонецПроцедуры

&НаКлиенте
Процедура ФормулаРазделить(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + " / ";
КонецПроцедуры

&НаКлиенте
Процедура ФормулаОткрывающаяСкобка(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "(";
КонецПроцедуры

&НаКлиенте
Процедура ФормулаЗакрывающаяСкобка(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + ")";
КонецПроцедуры

&НаКлиенте
Процедура ФормулаМеньше(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + " < ";
КонецПроцедуры

&НаКлиенте
Процедура ФормулаБольше(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + " > ";
КонецПроцедуры

&НаКлиенте
Процедура ФормулаРавно(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + " = ";
КонецПроцедуры

&НаКлиенте
Процедура Формула1(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "1";
КонецПроцедуры

&НаКлиенте
Процедура Формула2(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "2";
КонецПроцедуры

&НаКлиенте
Процедура Формула3(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "3";
КонецПроцедуры

&НаКлиенте
Процедура Формула4(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "4";
КонецПроцедуры

&НаКлиенте
Процедура Формула5(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "5";
КонецПроцедуры

&НаКлиенте
Процедура Формула6(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "6";
КонецПроцедуры

&НаКлиенте
Процедура Формула7(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "7";
КонецПроцедуры

&НаКлиенте
Процедура Формула8(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "8";
КонецПроцедуры

&НаКлиенте
Процедура Формула9(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "9";
КонецПроцедуры

&НаКлиенте
Процедура Формула0(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + "0";
КонецПроцедуры

&НаКлиенте
Процедура ФормулаНачалоДробнойчасти(Команда)
	Объект.СтрокаФормулы = Объект.СтрокаФормулы + ".";
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

// Обработчик события "Заполнить параметры из запроса" - завершение.
//
// Параметры:
//  Ответ					 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
&НаКлиенте
Процедура ЗаполнитьПараметрыИзЗапросаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.ТабПараметры.Количество() <> 0 Тогда
		Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры.ТабПараметры.Очистить();
	
	ЗаполнитьПараметрыИзЗапросаНаСервере(ДополнительныеПараметры.ЗапросПЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКонструкторЗапроса(Команда)
	
	ОткрытьКонструкторЗапросов();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКонструкторЗапросаПЗ(Команда)
	
	ОткрытьКонструкторЗапросов(Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаменитьЗарезервированныеСимволы(Строка)

	// Нужно на всякий случай удалить символы ".","/",":"
	СоответствиеСимволов = Новый Соответствие();
	СоответствиеСимволов.Вставить(".","");
	СоответствиеСимволов.Вставить("/","");
	СоответствиеСимволов.Вставить(":","");

	Для каждого сСимвол Из СоответствиеСимволов Цикл
		
		Пока СтрНайти(Строка, сСимвол.Ключ) > 0 Цикл
			Строка = СтрЗаменить(Строка, сСимвол.Ключ, сСимвол.Значение);
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьЭУСтраницаИсточник(ВидЗаполнения, Форма)
	
	Если ВидЗаполнения = ПредопределенноеЗначение("Перечисление.упоВидЗаполненияИндикатора.Вручную")
		ИЛИ ВидЗаполнения = ПредопределенноеЗначение("Перечисление.упоВидЗаполненияИндикатора.АвтоматическиВДокументеРасчетЭффективности")
		ИЛИ ВидЗаполнения.Пустая() Тогда
		Форма.Элементы.СтраницаИсточник.Видимость = Ложь;
	Иначе
		Форма.Элементы.СтраницаИсточник.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

// Процедура синхронизирует реквизит формы "ТаблицаСостояний" с табличной частью "Состояния".
//
&НаСервере
Процедура ВосстановитьСостояния()
	
	Для каждого вСтрока Из Объект.Состояния Цикл
		
		НоваяСтрока = ТаблицаСостояний.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, вСтрока);
		НоваяСтрока.ВидСравнения = ПолучитьВидСравненияПоНомеру(вСтрока.ВидСравнения);
		НоваяСтрока.Картинка = вСтрока.Оформление;
		
	КонецЦикла;
		
КонецПроцедуры

// Функция получает строку по номеру с видом сравнения.
//
// Параметры:
//  НомерВидаСравнения - Число, содержит число для которого нужно вернуть строку.
//
// Возвращаемое значение:
//  Строка
//
&НаСервере
Функция ПолучитьВидСравненияПоНомеру(НомерВидаСравнения)
	
	ВозврВидСравнения = "";
	
	Если НомерВидаСравнения = 1 Тогда
		ВозврВидСравнения = "Равно";
	ИначеЕсли НомерВидаСравнения = 2 Тогда
		ВозврВидСравнения = "Не равно";
	ИначеЕсли НомерВидаСравнения = 3 Тогда
		ВозврВидСравнения = "Меньше"; 
	ИначеЕсли НомерВидаСравнения = 4 Тогда 
		ВозврВидСравнения = "Меньше или равно";
	ИначеЕсли НомерВидаСравнения = 5 Тогда 
		ВозврВидСравнения = "Больше"; 
	ИначеЕсли НомерВидаСравнения = 6 Тогда 
		ВозврВидСравнения = "Больше или равно"; 
	ИначеЕсли НомерВидаСравнения = 7 Тогда 
		ВозврВидСравнения = "Интервал (>, <)"; 
	ИначеЕсли НомерВидаСравнения = 8 Тогда
		ВозврВидСравнения = "Интервал (>=, <=)";
	ИначеЕсли НомерВидаСравнения = 9 Тогда 
		ВозврВидСравнения = "Интервал (>=, <)"; 
	ИначеЕсли НомерВидаСравнения = 10 Тогда 
		ВозврВидСравнения = "Интервал (>, <=)"; 
	КонецЕсли;
	
	Возврат ВозврВидСравнения;
	
КонецФункции

// Функция проверяет таблицу состояний на однозначность условий.
//
// Возвращаемое значение:
//   Булево - Истина - условия все однозначны Ложь: не однозначны.
//
&НаСервере
Функция СостоянияОднозначны()
	
	Для каждого строкаСостояния Из ТаблицаСостояний Цикл
		
		Если УсловиеКонфликтует(строкаСостояния) Тогда
			
			Сообщение = НСтр("ru = 'Обнаружены конфликты между условиями, наложенными на значения показателя.'");
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
						
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
 
// Функция проверяет передаваемую строку на конфликтность с другими условиями табличного поля "Состояния".
//
&НаСервере
Функция УсловиеКонфликтует(текСтрока)
	
	// Проверим текущую строку. Условия не должны совпадать.
	Отказ = Ложь;
	Если текСтрока = Неопределено Тогда
		Возврат Отказ;
	КонецЕсли;
	
	интексТекСтроки = ТаблицаСостояний.Индекс(текСтрока);
	текВидСравнения = текСтрока.ВидСравнения;
	Для каждого вСтрока Из ТаблицаСостояний Цикл
		
		Если интексТекСтроки = ТаблицаСостояний.Индекс(вСтрока) Тогда
			Продолжить;
		КонецЕсли;
		
		Если вСтрока.ВидСравнения = "Больше" Тогда
			
			Если текВидСравнения = "Больше"
			 ИЛИ текВидСравнения = "Больше или равно"
			 ИЛИ текВидСравнения = "Не равно" Тогда
				 Отказ = Истина;
				 Прервать;
			ИначеЕсли текВидСравнения = "Интервал (>, <)"
				  ИЛИ текВидСравнения = "Интервал (>=, <)"
				  ИЛИ текВидСравнения = "Интервал (>=, <=)"
				  ИЛИ текВидСравнения = "Интервал (>, <=)" Тогда
				Если текСтрока.ЗначениеПО > вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			ИначеЕсли текВидСравнения = "Меньше"
				  ИЛИ текВидСравнения = "Меньше или равно"
				  ИЛИ текВидСравнения = "Равно" Тогда
				Если текСтрока.Значение > вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			КонецЕсли;
			
		ИначеЕсли вСтрока.ВидСравнения = "Больше или равно" Тогда
			
			Если текВидСравнения = "Больше"
			 ИЛИ текВидСравнения = "Больше или равно"
			 ИЛИ текВидСравнения = "Не равно" Тогда
				 Отказ = Истина;
				 Прервать;
			ИначеЕсли текВидСравнения = "Интервал (>=, <=)"
				  ИЛИ текВидСравнения = "Интервал (>, <=)" Тогда
				Если текСтрока.ЗначениеПО >= вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			ИначеЕсли текВидСравнения = "Интервал (>, <)"
				  ИЛИ текВидСравнения = "Интервал (>=, <)" Тогда
				Если текСтрока.ЗначениеПО > вСтрока.Значение Тогда
				 	Отказ = Истина;
				 	Прервать;
				КонецЕсли;		
			ИначеЕсли текВидСравнения = "Меньше или равно"
				  ИЛИ текВидСравнения = "Равно" Тогда
				Если текСтрока.Значение >= вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			ИначеЕсли текВидСравнения = "Меньше" Тогда
				Если текСтрока.Значение > вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			КонецЕсли;
			
		ИначеЕсли вСтрока.ВидСравнения = "Интервал (>, <)" Тогда
			
			Если текВидСравнения = "Меньше"
			 ИЛИ текВидСравнения = "Меньше или равно" Тогда
				Если вСтрока.ЗначениеС < текСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Больше"
				  ИЛИ текВидСравнения = "Больше или равно" Тогда
				Если вСтрока.ЗначениеПО > текСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>, <)"
				  ИЛИ текВидСравнения = "Интервал (>=, <)"
				  ИЛИ текВидСравнения = "Интервал (>, <=)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС < вСтрока.ЗначениеПО)
					ИЛИ(текСтрока.ЗначениеПО > вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС <= вСтрока.ЗначениеС И текСтрока.ЗначениеПО >= вСтрока.ЗначениеПО))
					И НЕ (текСтрока.ЗначениеС = текСтрока.ЗначениеПО ИЛИ вСтрока.ЗначениеС = вСтрока.ЗначениеПО) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>=, <=)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС < вСтрока.ЗначениеПО)
					ИЛИ (текСтрока.ЗначениеПО > вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС <= вСтрока.ЗначениеС И текСтрока.ЗначениеПО >= вСтрока.ЗначениеПО))
					И НЕ (вСтрока.ЗначениеС = вСтрока.ЗначениеПО) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Не равно" Тогда
				Отказ = Истина;
				Прервать;
			ИначеЕсли текВидСравнения = "Равно" Тогда
				Если текСтрока.Значение > вСтрока.ЗначениеС И текСтрока.Значение < вСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			КонецЕсли;
			
		ИначеЕсли вСтрока.ВидСравнения = "Интервал (>=, <=)" Тогда
			
			Если текВидСравнения = "Меньше" Тогда
				Если текСтрока.Значение > вСтрока.ЗначениеС Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Меньше или равно" Тогда
				Если текСтрока.Значение >= вСтрока.ЗначениеС Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Больше" Тогда
				Если текСтрока.Значение < вСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Больше или равно" Тогда
				Если текСтрока.Значение <= вСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>, <)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС < вСтрока.ЗначениеПО)
					ИЛИ (текСтрока.ЗначениеПО > вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС <= вСтрока.ЗначениеС И текСтрока.ЗначениеПО >= вСтрока.ЗначениеПО))
					И НЕ (текСтрока.ЗначениеС = текСтрока.ЗначениеПО) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>=, <)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС <= вСтрока.ЗначениеПО)
					ИЛИ (текСтрока.ЗначениеПО > вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС < вСтрока.ЗначениеС И текСтрока.ЗначениеПО > вСтрока.ЗначениеПО))
					И НЕ (текСтрока.ЗначениеС = текСтрока.ЗначениеПО) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>, <=)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС < вСтрока.ЗначениеПО)
					ИЛИ (текСтрока.ЗначениеПО >= вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС <= вСтрока.ЗначениеС И текСтрока.ЗначениеПО >= вСтрока.ЗначениеПО))
					И НЕ (текСтрока.ЗначениеС = текСтрока.ЗначениеПО) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>=, <=)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС <= вСтрока.ЗначениеПО)
					ИЛИ (текСтрока.ЗначениеПО >= вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС <= вСтрока.ЗначениеС И текСтрока.ЗначениеПО >= вСтрока.ЗначениеПО)) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Не равно" Тогда
				Если НЕ (вСтрока.ЗначениеС = текСтрока.Значение
				   И вСтрока.ЗначениеПО = текСтрока.Значение) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Равно" Тогда
				Если текСтрока.Значение >= вСтрока.ЗначениеС И текСтрока.Значение <= вСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			КонецЕсли;
			
		ИначеЕсли вСтрока.ВидСравнения = "Интервал (>=, <)" Тогда
			
			Если текВидСравнения = "Меньше" Тогда
				Если текСтрока.Значение > вСтрока.ЗначениеС Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Меньше или равно" Тогда
				Если текСтрока.Значение >= вСтрока.ЗначениеС Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			 ИначеЕсли текВидСравнения = "Больше"
				   ИЛИ текВидСравнения = "Больше или равно" Тогда
				Если вСтрока.ЗначениеПО > текСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>, <)"
				  ИЛИ текВидСравнения = "Интервал (>=, <)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС < вСтрока.ЗначениеПО)
					ИЛИ (текСтрока.ЗначениеПО > вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС <= вСтрока.ЗначениеС И текСтрока.ЗначениеПО >= вСтрока.ЗначениеПО))
					И НЕ (текСтрока.ЗначениеС = текСтрока.ЗначениеПО ИЛИ вСтрока.ЗначениеС = вСтрока.ЗначениеПО) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>, <=)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС < вСтрока.ЗначениеПО)
					ИЛИ (текСтрока.ЗначениеПО >= вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС <= вСтрока.ЗначениеС И текСтрока.ЗначениеПО >= вСтрока.ЗначениеПО))
					И НЕ (текСтрока.ЗначениеС = текСтрока.ЗначениеПО ИЛИ вСтрока.ЗначениеС = вСтрока.ЗначениеПО) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>=, <=)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС < вСтрока.ЗначениеПО)
					ИЛИ (текСтрока.ЗначениеПО >= вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС <= вСтрока.ЗначениеС И текСтрока.ЗначениеПО >= вСтрока.ЗначениеПО))
					И НЕ (вСтрока.ЗначениеС = вСтрока.ЗначениеПО) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Не равно" Тогда
				Отказ = Истина;
				Прервать;
			ИначеЕсли текВидСравнения = "Равно" Тогда
				Если текСтрока.Значение >= вСтрока.ЗначениеС И текСтрока.Значение < вСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			КонецЕсли;
			
		ИначеЕсли вСтрока.ВидСравнения = "Интервал (>, <=)" Тогда
			
			Если текВидСравнения = "Меньше"
			 ИЛИ текВидСравнения = "Меньше или равно" Тогда
				Если вСтрока.ЗначениеС < текСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Больше" Тогда
				Если текСтрока.Значение < вСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Больше или равно" Тогда
				Если текСтрока.Значение <= вСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>, <)"
				  ИЛИ текВидСравнения = "Интервал (>, <=)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС < вСтрока.ЗначениеПО)
					ИЛИ (текСтрока.ЗначениеПО > вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС <= вСтрока.ЗначениеС И текСтрока.ЗначениеПО >= вСтрока.ЗначениеПО))
					И НЕ (текСтрока.ЗначениеС = текСтрока.ЗначениеПО ИЛИ вСтрока.ЗначениеС = вСтрока.ЗначениеПО) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>=, <)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС <= вСтрока.ЗначениеПО)
					ИЛИ (текСтрока.ЗначениеПО > вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС <= вСтрока.ЗначениеС И текСтрока.ЗначениеПО >= вСтрока.ЗначениеПО))
					И НЕ (текСтрока.ЗначениеС = текСтрока.ЗначениеПО ИЛИ вСтрока.ЗначениеС = вСтрока.ЗначениеПО) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>=, <=)" Тогда
				Если (((текСтрока.ЗначениеС > вСтрока.ЗначениеС И текСтрока.ЗначениеС <= вСтрока.ЗначениеПО)
					ИЛИ (текСтрока.ЗначениеПО > вСтрока.ЗначениеС И текСтрока.ЗначениеПО < вСтрока.ЗначениеПО))
					ИЛИ (текСтрока.ЗначениеС <= вСтрока.ЗначениеС И текСтрока.ЗначениеПО >= вСтрока.ЗначениеПО))
					И НЕ (вСтрока.ЗначениеС = вСтрока.ЗначениеПО) Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Не равно" Тогда
				Отказ = Истина;
				Прервать;
			ИначеЕсли текВидСравнения = "Равно" Тогда
				Если текСтрока.Значение > вСтрока.ЗначениеС И текСтрока.Значение <= вСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			КонецЕсли;
			
		ИначеЕсли вСтрока.ВидСравнения = "Меньше" Тогда
			
			Если текВидСравнения = "Меньше"
			 ИЛИ текВидСравнения = "Меньше или равно"
			 ИЛИ текВидСравнения = "Не равно" Тогда
				 Отказ = Истина;
				 Прервать;
			ИначеЕсли текВидСравнения = "Интервал (>, <)"
				  ИЛИ текВидСравнения = "Интервал (>=, <)"
				  ИЛИ текВидСравнения = "Интервал (>=, <=)"
				  ИЛИ текВидСравнения = "Интервал (>, <=)" Тогда
				Если текСтрока.ЗначениеС < вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			ИначеЕсли текВидСравнения = "Больше"
				  ИЛИ текВидСравнения = "Больше или равно"
				  ИЛИ текВидСравнения = "Равно" Тогда
				Если текСтрока.Значение < вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			КонецЕсли;
			
		ИначеЕсли вСтрока.ВидСравнения = "Меньше или равно" Тогда
			
			Если текВидСравнения = "Меньше"
			 ИЛИ текВидСравнения = "Меньше или равно"
			 ИЛИ текВидСравнения = "Не равно" Тогда
				 Отказ = Истина;
				 Прервать;
			ИначеЕсли текВидСравнения = "Интервал (>, <)"
				  ИЛИ текВидСравнения = "Интервал (>, <=)" Тогда
				Если текСтрока.ЗначениеС < вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			ИначеЕсли текВидСравнения = "Интервал (>=, <)"
				  ИЛИ текВидСравнения = "Интервал (>=, <=)" Тогда
				Если текСтрока.ЗначениеС <= вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			ИначеЕсли текВидСравнения = "Больше или равно"
				  ИЛИ текВидСравнения = "Равно" Тогда
				Если текСтрока.Значение <= вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			ИначеЕсли текВидСравнения = "Больше" Тогда
				Если текСтрока.Значение < вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			КонецЕсли;
			
		ИначеЕсли вСтрока.ВидСравнения = "Не равно" Тогда
			
			Если текВидСравнения = "Меньше"
			 ИЛИ текВидСравнения = "Меньше или равно"
			 ИЛИ текВидСравнения = "Больше"
			 ИЛИ текВидСравнения = "Больше или равно"
			 ИЛИ текВидСравнения = "Интервал (>, <)"
			 ИЛИ текВидСравнения = "Интервал (>=, <)"
			 ИЛИ текВидСравнения = "Интервал (>, <=)"
			 ИЛИ текВидСравнения = "Не равно" Тогда
				 Отказ = Истина;
				 Прервать;
			 ИначеЕсли текВидСравнения = "Интервал (>=, <=)" Тогда
				 Если НЕ (текСтрока.ЗначениеС = вСтрока.Значение
					И текСтрока.ЗначениеПО = вСтрока.Значение) Тогда
					Отказ = Истина;
					Прервать;
				КонецЕсли; 
			ИначеЕсли текВидСравнения = "Равно" Тогда
				Если НЕ текСтрока.Значение = вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			КонецЕсли;
			
		ИначеЕсли вСтрока.ВидСравнения = "Равно" Тогда
			
			Если текВидСравнения = "Меньше" Тогда
				Если вСтрока.Значение < текСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Меньше или равно" Тогда
				Если вСтрока.Значение <= текСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Больше" Тогда
				Если вСтрока.Значение > текСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Больше или равно" Тогда
				Если вСтрока.Значение >= текСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;	
			ИначеЕсли текВидСравнения = "Интервал (>, <)" Тогда
				Если вСтрока.Значение > текСтрока.ЗначениеС И 
					 вСтрока.Значение < текСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>=, <)" Тогда
				Если вСтрока.Значение >= текСтрока.ЗначениеС И 
					 вСтрока.Значение < текСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>, <=)" Тогда
				Если вСтрока.Значение > текСтрока.ЗначениеС И 
					 вСтрока.Значение <= текСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли текВидСравнения = "Интервал (>=, <=)" Тогда
				Если вСтрока.Значение >= текСтрока.ЗначениеС И 
					 вСтрока.Значение <= текСтрока.ЗначениеПО Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;	
			 ИначеЕсли текВидСравнения = "Не равно" Тогда
				 Если НЕ текСтрока.Значение = вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли; 
			ИначеЕсли текВидСравнения = "Равно" Тогда
				Если текСтрока.Значение = вСтрока.Значение Тогда
				 	Отказ = Истина;
					Прервать;
				КонецЕсли;		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

// Функция получает число по строке с видом сравнения.
//
// Параметры:
//  ВидСравнения - Тип: Строка, содержит строку для которой нужно вернуть число.
//
// Возвращаемое значение:
//  Число
//
&НаКлиенте
Функция ПолучитьНомерВидаСравнения(ВидСравнения)
	
	НомерВида = 0;
	
	Если ВидСравнения = "Равно" Тогда 
		Возврат 1;
	ИначеЕсли ВидСравнения = "Не равно" Тогда 
		Возврат 2;
	ИначеЕсли ВидСравнения = "Меньше" Тогда 
		Возврат 3;
	ИначеЕсли ВидСравнения = "Меньше или равно" Тогда 
		Возврат 4;
	ИначеЕсли ВидСравнения = "Больше" Тогда 
		Возврат 5;
	ИначеЕсли ВидСравнения = "Больше или равно" Тогда 
		Возврат 6;
	ИначеЕсли ВидСравнения = "Интервал (>, <)" Тогда 
		Возврат 7; 
	ИначеЕсли ВидСравнения = "Интервал (>=, <=)" Тогда
		Возврат 8;
	ИначеЕсли ВидСравнения = "Интервал (>=, <)" Тогда
		Возврат 9; 
	ИначеЕсли ВидСравнения = "Интервал (>, <=)" Тогда
		Возврат 10; 
	КонецЕсли;
	
	Возврат НомерВида;
	
КонецФункции

// Процедура синхронизирует табличную часть "Состояния" с реквизитом формы "ТаблицаСостояний".
//
&НаКлиенте
Процедура СохранитьСостояния()
	
	Объект.Состояния.Очистить();
	
	Для каждого вСтрока Из ТаблицаСостояний Цикл
		
		НоваяСтрока = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, вСтрока);
		НоваяСтрока.ВидСравнения = ПолучитьНомерВидаСравнения(вСтрока.ВидСравнения);
		НоваяСтрока.Оформление = вСтрока.Картинка;
		НоваяСтрока.ВыражениеЗначения = вСтрока.ВыражениеЗначения;
		
	КонецЦикла;           
	
КонецПроцедуры

// Определяет используется ли данный индикатор как расчетный в формулах
// других индикаторов.
//
// Параметры:
//  нет.
//
// Возвращаемое значение:
//   Булево - Истина, используется - Ложь, не используется.
//
&НаСервере
Функция ИспользуетсяВРасчетныхИндикаторах()
	
	Если Объект.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ Объект.ТипЗаполнения = 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТЧРасчетныеИндикаторы.Ссылка КАК Индикатор
	               |ИЗ
	               |	Справочник.упоПоказателиПроектов.РасчетныеИндикаторы КАК ТЧРасчетныеИндикаторы
	               |ГДЕ
	               |	ТЧРасчетныеИндикаторы.Индикатор = &Индикатор";
	
	Запрос.УстановитьПараметр("Индикатор", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		
		Сообщение = НСтр("ru = 'Индикатор используется для расчета других индикаторов. Отмена установки значения.
                          |Используется в след. индикаторах:'");
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначения.СообщитьПользователю("- " + Выборка.Индикатор);
		КонецЦикла;
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Процедура устанавливает активным определенную панель источника для заполнения (Запрос, Формула)
// в соответствии со значением реквизата "ТипЗаполнения".
//
&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьЭУИсточникДанныхЗначенияПоказателя(ТипЗаполнения, ПринадлежностьПоказателя, Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.СтраницаСостоянияИндикатора.Видимость = Истина;
	Элементы.ВидЗаполнения.ТолькоПросмотр = Ложь;
	Элементы.ТипИндикатора.ТолькоПросмотр = Ложь;
    Элементы.ПоказательИнвестирования.Видимость = Истина;
	Элементы.ГруппаНастройкиИндикаторКартинка.Видимость = Истина;
	Элементы.ГруппаФорматнаяСтрока.Видимость = Истина;
    Элементы.ГруппаСчитатьНастройкиГруппировок.Видимость = Истина;
	
	Если ТипЗаполнения = 0 Тогда // выполнение запроса
		Элементы.СтраницаЗапрос.Заголовок = нСтр("ru='Текст запроса для проекта'", "ru");
		Элементы.ПараметрыЗапроса.Заголовок = нСтр("ru='Параметры запроса для проекта'", "ru"); 
		Элементы.СтраницаФормулаРасчета.Видимость = Ложь;
		Элементы.СтраницаЗапрос.Видимость = Истина;
		Элементы.ПараметрыЗапроса.Видимость = Истина;
		Элементы.СтраницаЗапросПЗ.Видимость = Истина;
		Элементы.ПараметрыЗапросаПЗ.Видимость = Истина;
	ИначеЕсли ТипЗаполнения = 1 Тогда // по формуле		
		Элементы.СтраницаЗапрос.Видимость = Ложь;
		Элементы.ПараметрыЗапроса.Видимость = Ложь;
		Элементы.СтраницаЗапросПЗ.Видимость = Ложь;
		Элементы.ПараметрыЗапросаПЗ.Видимость = Ложь;
		Элементы.СтраницаФормулаРасчета.Видимость = Истина;
	ИначеЕсли ТипЗаполнения = 2 Тогда // особый		
		Элементы.СтраницаИсточник.Видимость = Ложь;		
	КонецЕсли; 

	Если ПринадлежностьПоказателя = 
			ПредопределенноеЗначение("Перечисление.упоПринадлежностьПоказателя.Общий") Тогда
		Элементы.ГруппаПараметрыЗапроса.Видимость = Истина;
	ИначеЕсли ПринадлежностьПоказателя = 
			ПредопределенноеЗначение("Перечисление.упоПринадлежностьПоказателя.ТолькоДляПроекта") Тогда
		Элементы.СтраницаЗапросПЗ.Видимость = Ложь;
		Элементы.ПараметрыЗапросаПЗ.Видимость = Ложь;
		Элементы.ГруппаПараметрыЗапроса.Видимость = Истина;
	ИначеЕсли ПринадлежностьПоказателя = 
			ПредопределенноеЗначение("Перечисление.упоПринадлежностьПоказателя.ТолькоДляПроектнойЗадачи") Тогда
		Элементы.СтраницаЗапрос.Видимость = Ложь;
		Элементы.ПараметрыЗапроса.Видимость = Ложь;
	ИначеЕсли ПринадлежностьПоказателя = 
			ПредопределенноеЗначение("Перечисление.упоПринадлежностьПоказателя.Произвольный") Тогда
		Элементы.СтраницаСостоянияИндикатора.Видимость = Ложь;
		Элементы.СтраницаЗапросПЗ.Видимость = Ложь;
		Элементы.ПараметрыЗапросаПЗ.Видимость = Ложь;
		Элементы.ГруппаПараметрыЗапроса.Видимость = Ложь;
		Элементы.СтраницаЗапрос.Заголовок = нСтр("ru='Текст запроса'", "ru");
		Элементы.ПараметрыЗапроса.Заголовок = нСтр("ru='Параметры запроса'", "ru");
		Элементы.ВидЗаполнения.ТолькоПросмотр = Истина;
		Элементы.ТипИндикатора.ТолькоПросмотр = Истина;
		Элементы.ПоказательИнвестирования.Видимость = Ложь;
		Элементы.ГруппаНастройкиИндикаторКартинка.Видимость = Ложь;
		Элементы.ГруппаФорматнаяСтрока.Видимость = Ложь;
		Элементы.ГруппаСчитатьНастройкиГруппировок.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыражениеГруппировки()
	
	Если Объект.СчитатьСуммуПоГруппировкам
		И Объект.ТипЗаполнения = 1 Тогда
		
		Объект.ВыражениеГруппировки = "Формула";
		Элементы.ВыражениеГруппировки.Доступность = Ложь;
		
	Иначе 
		
		Элементы.ВыражениеГруппировки.Доступность = Истина;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыИзЗапросаНаСервере(ЗапросПЗ = Ложь)
	
	Если ЗапросПЗ Тогда
		ЗапросТекст  = Объект.ТекстЗапросаПЗ;
		ТабПараметры = ТаблицаПараметровПЗ;
	Иначе 
		ЗапросТекст  = Объект.ТекстЗапроса;
		ТабПараметры = ТаблицаПараметров;	
	КонецЕсли; 
	
	ТекстОшибки = "";
	Если НЕ упоФункцииОбщегоНазначенияСервер.ПроверитьЗапрос(ЗапросТекст, ТекстОшибки, , Истина) Тогда
		Сообщение = НСтр("ru = 'Параметры не могут быть извлечены из запроса.
                          |'");
		ОбщегоНазначения.СообщитьПользователю(Сообщение + ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ЗапросТекст;
	ПараметрыЗапроса = Запрос.НайтиПараметры();
	
	Для каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		НоваяСтрока = ТабПараметры.Добавить();
		НоваяСтрока.ИмяПараметра = ПараметрЗапроса.Имя;
		НоваяСтрока.ЭтоВыражение = Ложь;
		
		Если НЕ Модифицированность Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

// Устанавливает свойства колонок табличного поля "Параметры" в зависимости от различных условий,
// которые могут меняться динамически.
//
// Параметры:
//  нет.
//
&НаКлиенте
Процедура УправлениеКолонкамиПараметры(ЗапросПЗ = Ложь)
	
	Если ЗапросПЗ Тогда	
		Элементы.ТаблицаПараметровПЗ.ПодчиненныеЭлементы.ТаблицаПараметровПЗЗначениеПараметра.ВыбиратьТип =
			(Элементы.ТаблицаПараметровПЗ.ТекущиеДанные.ЭтоВыражение = Ложь);		
	Иначе 		
		Элементы.ТаблицаПараметров.ПодчиненныеЭлементы.ТаблицаПараметровЗначениеПараметра.ВыбиратьТип =
			(Элементы.ТаблицаПараметров.ТекущиеДанные.ЭтоВыражение = Ложь);		
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокВыбора(ИмяПоляИсточника, ДанныеВыбора, ТекстПредупреждения = "")
	
	ЗапросПЗ = ИмяПоляИсточника = "ИмяПоляОбъектаПЗ" Или ИмяПоляИсточника = "ИмяПоляЗначенияПЗ"; 	
	
	Если ДанныеВыбора = Неопределено Тогда
		ДанныеВыбора = Новый СписокЗначений;
	КонецЕсли;
	
	ТекстЗапросаИзОбъекта = ?(ЗапросПЗ, Объект.ТекстЗапросаПЗ, Объект.ТекстЗапроса);
	Если ПустаяСтрока(ТекстЗапросаИзОбъекта) Тогда
		ДанныеВыбора.Очистить();
		Возврат;
	КонецЕсли;
	
	ВремПоле = Объект[ИмяПоляИсточника];
	
	ДанныеВыбора.Очистить();
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.Текст = ТекстЗапросаИзОбъекта;
	ПостроительОтчета.ЗаполнитьНастройки();
	
	ТипИндикатора = Объект.ТипИндикатора;
	Для каждого Поле Из ПостроительОтчета.ДоступныеПоля Цикл
		
		Если НЕ Поле.Поле Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоЗначение = Ложь;
		ЭтоОбъект 	= Истина;
		Если ТипИндикатора = Перечисления.упоТипИндикатора.Число И Поле.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			ЭтоЗначение = Истина;
			ЭтоОбъект 	= Ложь;
		ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Дата И Поле.ТипЗначения.СодержитТип(Тип("Дата")) Тогда
			ЭтоЗначение = Истина;
			ЭтоОбъект 	= Ложь;
		ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Булево И Поле.ТипЗначения.СодержитТип(Тип("Булево")) Тогда
			ЭтоЗначение = Истина;
			ЭтоОбъект 	= Ложь;
		ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Строка И Поле.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
			ЭтоЗначение = Истина;
			ЭтоОбъект 	= Ложь;
		ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Ссылка И Поле.ТипЗначения.СодержитТип(ТипЗнч(Объект.ТипСсылки)) Тогда
			ЭтоЗначение = Истина;
			ЭтоОбъект 	= Истина;
		КонецЕсли;
		
		Если ЭтоЗначение Тогда
			Если ИмяПоляИсточника = "ИмяПоляЗначения" Или ИмяПоляИсточника = "ИмяПоляЗначенияПЗ" Тогда
				ДанныеВыбора.Добавить(Поле.Имя, Поле.Представление);
			КонецЕсли;
		КонецЕсли;
		Если ЭтоОбъект Тогда
			Если ИмяПоляИсточника = "ИмяПоляОбъекта" Или ИмяПоляИсточника = "ИмяПоляОбъектаПЗ" Тогда
				ДанныеВыбора.Добавить(Поле.Имя, Поле.Представление);
			КонецЕсли;
		КонецЕсли;
				
	КонецЦикла;
	
	НайденноеПоле = ДанныеВыбора.НайтиПоЗначению(ВремПоле);
	Если НайденноеПоле = Неопределено Тогда
		Если ДанныеВыбора.Количество() > 0 Тогда
			Объект[ИмяПоляИсточника] = ДанныеВыбора[0].Значение;
		Иначе
			Если ИмяПоляИсточника = "ИмяПоляЗначения" 
				Или ИмяПоляИсточника = "ИмяПоляЗначенияПЗ" Тогда
				ТекстПредупреждения = НСтр("ru = 'Ошибка! Возможно, тип значения показателя не соответствует 
											|типу значения показателя(ей) в запросе!'");
			Иначе
				Объект[ИмяПоляИсточника] = Неопределено;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Объект[ИмяПоляИсточника] = НайденноеПоле.Значение;
	КонецЕсли;
	
КонецПроцедуры

// Функция проверяет возможность выполнения формулы.
//
// Возвращаемое значение:
//   Булево - успешность выполнения функции.
//
&НаСервере
Функция ФормулаКорректна()
	
	// Суть: сначала подставляем вместо индикатора какие-то значения,
	// потом подставляю 0. Всю эту строку надо вставить в запрос и проверить,
	// получит ли он какое-нибудь значение.
	
	ВсеКорректно = Ложь;
	
	ЧислоПоУмолчанию = "1";
	ДатаПоУмолчанию = "ДАТАВРЕМЯ(2000, 12, 16, 0, 0, 0)";
	БулевоЗначениеПоУмолчанию = "Истина";
	СтрокаЗначениеПоУмолчанию = """""";
	СсылкаЗначениеПоУмолчанию = Неопределено;
	ИмяПараметраНачальное = "Параметр";
	Итератор = 1;
	СоответствиеПараметраИПустойСсылки = Новый Структура;
	
	МассивИндикаторов = Объект.РасчетныеИндикаторы.Выгрузить(, "Индикатор").ВыгрузитьКолонку("Индикатор");
	ДанныеИндикаторовТаблицы = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивИндикаторов, "ТипИндикатора, ТипСсылки");
	
	ПолеЗапроса = Объект.СтрокаФормулы;
	Для каждого ИндикаторФормулы Из Объект.РасчетныеИндикаторы Цикл
		ДанныеИндикатора = ДанныеИндикаторовТаблицы.Получить(ИндикаторФормулы.Индикатор);
		Если ДанныеИндикатора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТипИндикатора = ДанныеИндикатора.ТипИндикатора;
		Если ТипИндикатора = Перечисления.упоТипИндикатора.Число Тогда
			ЗначениеПоУмолчанию = ЧислоПоУмолчанию;
		ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Дата Тогда
			ЗначениеПоУмолчанию = ДатаПоУмолчанию;
		ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Булево Тогда
			ЗначениеПоУмолчанию = БулевоЗначениеПоУмолчанию;
		ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Строка Тогда
			ЗначениеПоУмолчанию = СтрокаЗначениеПоУмолчанию;
		ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Ссылка Тогда
			ИмяПараметра = ИмяПараметраНачальное + Строка(Итератор);
			Если ДанныеИндикатора.ТипСсылки = Неопределено Тогда
				ЗначениеПараметра = СсылкаЗначениеПоУмолчанию;
			Иначе
				ЗначениеПараметра = ДанныеИндикатора.ТипСсылки;
			КонецЕсли;
			СоответствиеПараметраИПустойСсылки.Вставить(ИмяПараметра, ЗначениеПараметра);			
			ЗначениеПоУмолчанию = "&" + ИмяПараметра;
			Итератор = Итератор + 1;			
		КонецЕсли;
		ПолеЗапроса = СтрЗаменить(ПолеЗапроса, ИндикаторФормулы.Представление, ЗначениеПоУмолчанию);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ " + ПолеЗапроса + " КАК Значение";
	
	Для Каждого Элемент Из СоответствиеПараметраИПустойСсылки Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Попытка
		
		Сообщение = НСтр("ru = 'Тип значения, вычисляемого по формуле, не соответствует типу значения показателя.'");
		ТипИндикатора = Объект.ТипИндикатора;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ТипИндикатора = Перечисления.упоТипИндикатора.Число Тогда
				Если НЕ ТипЗнч(Выборка.Значение) = Тип("Число") Тогда
					ОбщегоНазначения.СообщитьПользователю(Сообщение);
					ВсеКорректно = Ложь;
					Прервать;
				КонецЕсли;
			ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Дата Тогда
				Если Не ТипЗнч(Выборка.Значение) = Тип("Дата") Тогда
					ОбщегоНазначения.СообщитьПользователю(Сообщение);
					ВсеКорректно = Ложь;
					Прервать;
				КонецЕсли;
			ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Булево Тогда
				Если НЕ ТипЗнч(Выборка.Значение) = Тип("Булево") Тогда
					ОбщегоНазначения.СообщитьПользователю(Сообщение);
					ВсеКорректно = Ложь;
					Прервать;
				КонецЕсли;
			ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Строка Тогда
				Если НЕ ТипЗнч(Выборка.Значение) = Тип("Строка") Тогда
					ОбщегоНазначения.СообщитьПользователю(Сообщение);
					ВсеКорректно = Ложь;
					Прервать;
				КонецЕсли;
			ИначеЕсли ТипИндикатора = Перечисления.упоТипИндикатора.Ссылка Тогда
				Если НЕ (ТипЗнч(Выборка.Значение) = ТипСсылки Или 
					(ТипСсылки = Неопределено И ТипЗнч(Выборка.Значение) = Тип("Неопределено"))) Тогда
					ОбщегоНазначения.СообщитьПользователю(Сообщение);
					ВсеКорректно = Ложь;
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			ВсеКорректно = Истина;
			
		КонецЦикла;
		
	Исключение
		
		ТекстОшибки = ОписаниеОшибки();
		ПозицияСимвола = СтрНайти(ТекстОшибки, ":");
		Пока Не ПозицияСимвола = 0 Цикл
			ТекстОшибки = Сред(ТекстОшибки, ПозицияСимвола + 2);
		    ПозицияСимвола = СтрНайти(ТекстОшибки, ":");
		КонецЦикла;
		
		ШаблонТекстаОшибка = НСтр("ru = 'Обнаружена ошибка: %1'");
		Текст = СтрШаблон(ШаблонТекстаОшибка, ТекстОшибки); 
		
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
		ВсеКорректно = Ложь;
		
	КонецПопытки;
	
	Возврат ВсеКорректно;
	
КонецФункции

&НаКлиенте
Процедура РасчетныеИндикаторыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Индикатор",
		Объект.РасчетныеИндикаторы, ЭтаФорма, Истина);		

КонецПроцедуры

// Выполняет дополнительные действия при подборе над данными строки.
//
// Параметры:
//  СтрокаТабличнойЧасти - Структура, ДанныеФормыЭлементКоллекции - строка табличной части.
//  ПараметрыПодбора	 - Произвольный - не используется.
//
&НаКлиенте
Процедура ВыполнитьДействияПриПодборе(СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт
	
	ЗаполнитьПредставлениеВФормуле(СтрокаТабличнойЧасти);
					 	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеТиповДляЭлементаТЧ(Элемент, ИмяКолонкиТЧ, ИмяТЧ)
	
	ТекДанные = Элементы[ИмяТЧ].ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда 
		
		ТипОграничение = Неопределено;
		Если Объект.ТипИндикатора = ПредопределенноеЗначение("Перечисление.упоТипИндикатора.Число") Тогда
			ТипОграничение = "Число";
		ИначеЕсли Объект.ТипИндикатора = ПредопределенноеЗначение("Перечисление.упоТипИндикатора.Дата") Тогда
			ТипОграничение = "Дата";
		ИначеЕсли Объект.ТипИндикатора = ПредопределенноеЗначение("Перечисление.упоТипИндикатора.Булево") Тогда
			ТипОграничение = "Булево";
		ИначеЕсли Объект.ТипИндикатора = ПредопределенноеЗначение("Перечисление.упоТипИндикатора.Строка") Тогда
			ТипОграничение = "Строка";
		ИначеЕсли Объект.ТипИндикатора = ПредопределенноеЗначение("Перечисление.упоТипИндикатора.Ссылка") Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипСсылки);
			ТипОграничение = Новый ОписаниеТипов(МассивТипов);			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТипОграничение) Тогда
			Элемент.ОграничениеТипа = Новый ОписаниеТипов(ТипОграничение);
			Значение = ТекДанные[ИмяКолонкиТЧ];
			ТекДанные[ИмяКолонкиТЧ] = Элемент.ОграничениеТипа.ПривестиЗначение(Значение);
			Элемент.ВыбиратьТип = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте	
Процедура ЗаполнитьПредставлениеВФормуле(ТекДанные)
	
	ПредставлениеВФормуле = "[" + ТекДанные.Индикатор + "]";
		
	ТекДанные.Представление = ПредставлениеВФормуле;
	ОбновитьПредставлениеВФормуле(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокВыбораНаКлиенте(ИмяЭлемента, ДанныеВыбора)
	
	ТекстПредупреждения = "";
	
	СформироватьСписокВыбора(ИмяЭлемента, ДанныеВыбора, ТекстПредупреждения);
	
	Если НЕ ПустаяСтрока(ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(, ТекстПредупреждения, 120, "Внимание");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте	
Процедура ВидимостьВыраженияГруппировки()
	
	Элементы.ВыражениеГруппировки.Видимость = Объект.СчитатьСуммуПоГруппировкам;
	УстановитьВыражениеГруппировки();
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры(имяКоманды)
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	 		
	АдресХранилища = "";
	
	Если имяКоманды = "ПодобратьРасчетныеИндикаторы" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.РасчетныеИндикаторы;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоПоказателиПроектов";
        ТаблицаФормы = Объект.РасчетныеИндикаторы;
	    ИмяКолонки = "Индикатор";		
				
	КонецЕсли;
		
	СтруктураДоп = ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы, ИмяКолонки,
		ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
		
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
	
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаСервере
Функция ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
	
	СтруктураДоп  = Новый Структура;
	
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");
	
	Если имяКоманды = "ТаблицаИндикаторыПодобрать" Тогда
		
		СтруктураДоп.АдресХранилищаОтбора = ПодготовитьТаблицуОтбораПодбора(имяКоманды);
			
	КонецЕсли;

	АдресХранилища  = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок);
	СтруктураДоп.АдресХранилищаВыбранных = АдресХранилища;
	
	Возврат СтруктураДоп;
	
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуОтбораПодбора(имяКоманды)
	
	Перем ТаблицаОтбора;	
	
	упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуОтбора(ТаблицаОтбора);	  
	  
	Если имяКоманды = "ПодобратьРасчетныеИндикаторы" Тогда
	  
		  НоваяСтрока =  ТаблицаОтбора.Добавить();
		  
		  НоваяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидЗаполнения");
		  НоваяСтрока.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеРавно;
	      НоваяСтрока.Применение =  ТипПримененияОтбораКомпоновкиДанных.Элементы;
		  НоваяСтрока.Использование  = Истина;
		  НоваяСтрока.РежимОтображения =  РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
		  НоваяСтрока.ПравоеЗначение = Объект.Ссылка;
		
  	КонецЕсли;
 
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьКонструктораЗапроса()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Элементы.КомандаКонструкторЗапроса.Видимость = Истина;
	Элементы.ТекстЗапросаКонтекстноеМенюКомандаКонструкторЗапроса.Видимость = Истина;
	
	Элементы.КомандаКонструкторЗапросаПЗ.Видимость = Истина;
	Элементы.ТекстЗапросаКонтекстноеМенюКомандаКонструкторЗапросаПЗ.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапросов(ЭтоПЗ = Ложь)

#Если Не МобильныйКлиент Тогда
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЭтоПЗ", ЭтоПЗ);
	
	Если ЭтоПЗ Тогда
		ТекстЗапроса = Объект.ТекстЗапросаПЗ;
	Иначе
		ТекстЗапроса = Объект.ТекстЗапроса;	
	КонецЕсли;
	
	КонструкторЗапроса = Новый КонструкторЗапроса;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗакрытииКонструктораЗапросов", ЭтаФорма, ДопПараметры);
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		КонструкторЗапроса.Текст = ТекстЗапроса;
	КонецЕсли;
	КонструкторЗапроса.Показать(ОписаниеОповещения);
#КонецЕсли

КонецПроцедуры

// Обработчик события "При закрытии конструктора запросов".
//
// Параметры:
//  ТекстЗапроса			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
&НаКлиенте
Процедура ПриЗакрытииКонструктораЗапросов(ТекстЗапроса, ДополнительныеПараметры) Экспорт 
	
	Если ТекстЗапроса <> Неопределено Тогда
		Если ДополнительныеПараметры.ЭтоПЗ Тогда
			Объект.ТекстЗапросаПЗ = ТекстЗапроса;
		Иначе
			Объект.ТекстЗапроса = ТекстЗапроса;	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗапросСПредупреждением(Текст)
	
	ТекстОшибки = "";
	ПроверкаПройдена = ПроверитьЗапросСервер(Текст, ТекстОшибки);
	Если ПроверкаПройдена Тогда
		ТекстОшибки = НСтр("ru = 'Ошибок не обнаружено'");
	КонецЕсли;
	
	ПоказатьПредупреждение( , ТекстОшибки, 120);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьЗапросСервер(Текст, ТекстОшибки)
	
	 Возврат упоФункцииОбщегоНазначенияСервер.ПроверитьЗапрос(Текст, ТекстОшибки, , Истина)
	
КонецФункции

&НаСервере
Процедура ПересчитатьТипСсылки()
	
	Если Объект.ТипСсылки <> Неопределено Тогда
		ТипСсылки = ТипЗнч(Объект.ТипСсылки);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокТиповИУстановитьЗначенияПоУмолчаниюДляТипСсылки()
	
	ОписаниеТипаВсеСсылки = ОбщегоНазначения.ОписаниеТипаВсеСсылки();
	
	СписокТипов.ЗагрузитьЗначения(ОписаниеТипаВсеСсылки.Типы());	
	СписокТипов.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	ОбработатьТипСсылкиИСчитатьСуммуПоГруппировкам(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьТипСсылкиИСчитатьСуммуПоГруппировкам(ЭтаФорма)
	
	Если ЭтаФорма.Объект.ТипИндикатора = ПредопределенноеЗначение("Перечисление.упоТипИндикатора.Ссылка") Тогда
		ЭтаФорма.Элементы.ТипСсылки.Видимость = Истина;
		ЭтаФорма.Объект.СчитатьСуммуПоГруппировкам = Ложь;
		ЭтаФорма.Элементы.СчитатьСуммуПоГруппировкам.ТолькоПросмотр = Истина;
	Иначе
		ЭтаФорма.Элементы.ТипСсылки.Видимость = Ложь;
		ЭтаФорма.Элементы.СчитатьСуммуПоГруппировкам.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура МодифицироватьЗаблокироватьФормуПредустановленного()
	
	Если Не ЭтоПредопределенныйЭлемент(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаПредопределенныйЭлемент.Видимость = Истина;
	
	Элементы.ПанельГлавная.ТолькоПросмотр = Истина;
	
	КомандыТолькоПросмотр = Новый Массив;
	КомандыТолькоПросмотр.Добавить("ВыбратьКартинку");
	КомандыТолькоПросмотр.Добавить("КомандаКонструкторЗапроса");
	КомандыТолькоПросмотр.Добавить("КомандаКонструкторЗапросаПЗ");
	КомандыТолькоПросмотр.Добавить("ЗагрузитьТекстЗапросаИзФайла");
	КомандыТолькоПросмотр.Добавить("ЗагрузитьТекстЗапросаИзФайлаПЗ");
	КомандыТолькоПросмотр.Добавить("ТаблицаПараметровЗаполнитьПараметрыИзЗапроса");
	КомандыТолькоПросмотр.Добавить("ТаблицаПараметровЗаполнитьПараметрыИзЗапросаПЗ");
	КомандыТолькоПросмотр.Добавить("РасчетныеИндикаторыПодобратьРасчетныеИндикаторы");
	Для Каждого КомандаТолькоПросмотр Из КомандыТолькоПросмотр Цикл
		Элементы[КомандаТолькоПросмотр].Доступность = Ложь;
	КонецЦикла;
	
	Элементы.ГруппаОператорыФормулы.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПредопределенныйЭлемент(Объект)
	
	ЭтоПредопределенныйЭлемент = ЗначениеЗаполнено(Объект.ПредустановленныйКод)
		Или Объект.Предопределенный;
		
	Возврат ЭтоПредопределенныйЭлемент;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьНастроекДляМонитораПроекта()
	
	Элементы.ГруппаНастройкиДляМонитораПроекта.Видимость = (Объект.ТипИндикатора = Перечисления.упоТипИндикатора.Число);
    Элементы.ИнвертироватьЦветовоеВыделениеПоложительныхИОтрицательныхЗначений.Доступность = Объект.ЦветовоеВыделениеПоложительныхИОтрицательныхЗначений;
	
	Если Не Элементы.ГруппаНастройкиДляМонитораПроекта.Видимость Тогда
		Объект.ИнвертироватьЦветовоеВыделениеПоложительныхИОтрицательныхЗначений = Ложь;  
		Объект.ЦветовоеВыделениеПоложительныхИОтрицательныхЗначений = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступнуюПринадлежностьПоказателей()
	
	ДоступнаяПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ДоступныеЗначения();
	
	Элементы.ПринадлежностьПоказателя.СписокВыбора.ЗагрузитьЗначения(ДоступнаяПринадлежностьПоказателя);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()
		
	ВосстановитьСостояния();
	
	ЗаполнитьДоступнуюПринадлежностьПоказателей();
	
	ВидимостьЭУСтраницаИсточник(Объект.ВидЗаполнения, ЭтаФорма);
	
	Если Элементы.СтраницаИсточник.Видимость Тогда
		ВидимостьЭУИсточникДанныхЗначенияПоказателя(Объект.ТипЗаполнения, Объект.ПринадлежностьПоказателя, ЭтаФорма);
	КонецЕсли;
	
	ЕстьЗначениеКопирования = Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	
	// Восстановим параметры
	Обж = РеквизитФормыВЗначение("Объект");
		
	Если ЕстьЗначениеКопирования Тогда
		ТаблицаИзРеквизита = Параметры.ЗначениеКопирования.ПараметрыЗапроса.Получить();
	Иначе
		ТаблицаИзРеквизита = Обж.ПараметрыЗапроса.Получить();
	КонецЕсли;
	Если НЕ ТаблицаИзРеквизита = Неопределено Тогда
		ТаблицаПараметров.Загрузить(ТаблицаИзРеквизита);
	КонецЕсли;
	
	Если ЕстьЗначениеКопирования Тогда
		ТаблицаИзРеквизита = Параметры.ЗначениеКопирования.ПараметрыЗапросаПЗ.Получить();
	Иначе
		ТаблицаИзРеквизита = Обж.ПараметрыЗапросаПЗ.Получить();
	КонецЕсли;
	Если НЕ ТаблицаИзРеквизита = Неопределено Тогда
		ТаблицаПараметровПЗ.Загрузить(ТаблицаИзРеквизита);
	КонецЕсли;
	
	Если ЕстьЗначениеКопирования 
		И Объект.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.АвтоматическиВДокументеРасчетЭффективности Тогда
		Объект.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.ПустаяСсылка();
	КонецЕсли;
	
	Если Объект.ПринадлежностьПоказателя.Пустая() Тогда
	    // Всем старым показателям устанавливаем "ТолькоДляПроекта", т.к. раньше
		// был "только для проекта".
		Объект.ПринадлежностьПоказателя = ?(Объект.Ссылка.Пустая(),
									Перечисления.упоПринадлежностьПоказателя.Общий,
									Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроекта);
	КонецЕсли;

	ПредыдущийТипЗначения = Объект.ТипИндикатора;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПересчитатьТипСсылки();
	КонецЕсли;
	
	ПолучитьСписокТиповИУстановитьЗначенияПоУмолчаниюДляТипСсылки();	
	
	УстановитьВидимостьНастроекДляМонитораПроекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТекстЗапросаВФайлОбщий(ЭтоПЗ)
	
	Если ЭтоПЗ Тогда
		СтрокаТекста = Объект.ТекстЗапросаПЗ;
	Иначе
		СтрокаТекста = Объект.ТекстЗапроса;
	КонецЕсли;

	Если ПустаяСтрока(СтрокаТекста) Тогда
		Возврат;
	КонецЕсли;
	
	АдресДанных = ПоместитьВоВременноеХранилище(СтрокаТекста);
	
	ОписаниеОповещенияПослеРаботыСФайлом = Новый ОписаниеОповещения("СохранитьНастройкуВФайлЗавершение", ЭтотОбъект);
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Диалог.МножественныйВыбор = Ложь;
	ИмяФайлаШаблон = "%1.txt";
	ИмяФайла = СтрШаблон(ИмяФайлаШаблон, СтрШаблон(НСтр("ru = 'Текст запроса показателя %1'"), Объект.Наименование));
	ФайловаяСистемаКлиент.СохранитьФайл(ОписаниеОповещенияПослеРаботыСФайлом, АдресДанных, ИмяФайла, ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкуВФайлЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПолученныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Файл сохранен в выбранный каталог.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТекстЗапросаИзФайлаОбщий(ЭтоПЗ)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	Фильтр = "Текст (*.txt)|*.txt";
	ДиалогОткрытияФайла.Фильтр = Фильтр; 
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл'");
	
	ДополнительныеПараметры = Новый Структура("ЭтоПЗ", ЭтоПЗ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьТекстЗапросаИзФайлаЗавершение",
		ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = ЭтотОбъект.УникальныйИдентификатор;
	ПараметрыЗагрузки.Интерактивно = Истина;
	ПараметрыЗагрузки.Диалог = ДиалогОткрытияФайла;
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТекстЗапросаИзФайлаЗавершение(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПЗ = ДополнительныеПараметры.ЭтоПЗ;
	
	ИзвлеченныйТекст = ИзвлеченныйТекст(ПомещенныйФайл.Хранение);
	
	Если ЭтоПЗ Тогда
		Объект.ТекстЗапросаПЗ = ИзвлеченныйТекст;
	Иначе
		Объект.ТекстЗапроса = ИзвлеченныйТекст;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзвлеченныйТекст(АдресФайла)
	
	РезультатИзвлечения = РаботаСФайламиСлужебный.ИзвлечьТекст(АдресФайла);
	Текст = РезультатИзвлечения.ТекстХранилище.Получить();
	Возврат Текст;
	
КонецФункции

#КонецОбласти
