
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектСсылка = Объект.Ссылка;
	Если ОбъектСсылка.Пустая() И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ОбъектСсылка = Параметры.ЗначениеКопирования;
		ЭлементСозданКопированием = Истина;
	КонецЕсли;
	
	ЗаполнитьДанныеФормыПоРегистрам(ОбъектСсылка);
		
	Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Количество() Тогда
		
		ЗаполнитьЗначенияСвойств(СвойстваРиска, Параметры.ЗначенияЗаполнения);
		ЗаполнитьЗначенияСвойств(СтатусРиска, Параметры.ЗначенияЗаполнения);
		ЗаполнитьЗначенияСвойств(СвойстваРискаФакт, Параметры.ЗначенияЗаполнения);
		Если Параметры.ЗначенияЗаполнения.Свойство("ПроектнаяЗадача") Тогда
			СвойстваРиска.СвязанСПроектнаяЗадача = Параметры.ЗначенияЗаполнения.ПроектнаяЗадача;
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
		
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	ИзменитьФормуИОбъектПоТипуРиска(ЭтаФорма);
	
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
	ИзменитьФормуВебКлиент();
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
	Если Не Отказ Тогда
		Объект.Наименование = СвойстваРиска.Наименование;
	КонецЕсли;
	
	Если НЕ Отказ И НЕ ПроверитьЗаполнениеПолностью(ЭтаФорма) Тогда
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ);
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	ЗаписатьИзмененияВРегистры(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	ЗаполнитьДанныеФормыПоРегистрам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "ИзмененПриоритетРискаПроекта" И Параметр = Объект.Ссылка Тогда
		 ОбновитьДанныеПриоритета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	  
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СвойстваРискаВероятностьВозникновенияПриИзменении(Элемент)
	
	РассчитатьОжидаемуюСумму(СвойстваРиска);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваРискаСуммаПриИзменении(Элемент)
	
	РассчитатьОжидаемуюСумму(СвойстваРиска);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваРискаТипРискаПриИзменении(Элемент)
	
	ИзменитьФормуИОбъектПоТипуРиска(ЭтаФорма);
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваРискаСвязанСПроектнаяЗадачаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("Проект", Объект.Владелец);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора", ПараметрыФормы, Элемент, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьЗаполнениеПолностью(ЭтаФорма) 
	
	Результат = ЭтаФорма.ПроверитьЗаполнение();	
	
	Если Результат Тогда
			
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьВидимостьДоступностьЭлементов(ЭтаФорма) 
	
	РискСвершился = ЗначениеЗаполнено(ЭтаФорма.СвойстваРискаФакт.ДатаНаступленияФакт);
	
	ЭтаФорма.Элементы.СвойстваРискаВероятностьВозникновения.ТолькоПросмотр = РискСвершился;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИзменитьФормуИОбъектПоТипуРиска(ЭтаФорма) 
	
	Если ЭтаФорма.СвойстваРиска.ТипРиска = ПредопределенноеЗначение("Перечисление.упоТипыРисковПроектов.Возможность") Тогда
		Заголовок = НСтр("ru = 'Возможность'");
		ЗаголовокСумма = НСтр("ru = 'Возможность'");
		ЗаголовокОжидаемая = НСтр("ru = 'Ожидаемая возможность'");
	ИначеЕсли ЭтаФорма.СвойстваРиска.ТипРиска = ПредопределенноеЗначение("Перечисление.упоТипыРисковПроектов.Угроза") Тогда
		Заголовок = НСтр("ru = 'Угроза'");
		ЗаголовокСумма = НСтр("ru = 'Ущерб'");
		ЗаголовокОжидаемая = НСтр("ru = 'Ожидаемый ущерб'");
	Иначе
		Заголовок = НСтр("ru = '***'");
		ЗаголовокСумма = НСтр("ru = 'Сумма'");
		ЗаголовокОжидаемая = НСтр("ru = 'Ожидаемая сумма'");
	КонецЕсли;
	
	Если Заголовок <> ЭтаФорма.Заголовок Тогда
		ЭтаФорма.Заголовок = Заголовок;
	КонецЕсли;
	
	Если ЗаголовокСумма <> ЭтаФорма.Элементы.СвойстваРискаСумма.Заголовок Тогда
		ЭтаФорма.Элементы.СвойстваРискаСумма.Заголовок = ЗаголовокСумма;
	КонецЕсли;
	
	Если ЗаголовокОжидаемая <> ЭтаФорма.Элементы.СвойстваРискаОжидаемаяСумма.Заголовок Тогда
		ЭтаФорма.Элементы.СвойстваРискаОжидаемаяСумма.Заголовок = ЗаголовокОжидаемая;
	КонецЕсли;	
	
	СтруктураСтратегий = Новый Структура("СтратегияРеагированияНаРиск, ЗапаснаяСтратегияРеагированияНаРиск");
	Если ЭтаФорма.СвойстваРиска.ТипРиска = ПредопределенноеЗначение("Перечисление.упоТипыРисковПроектов.Возможность") Тогда		
		ТипСтратегии = ПредопределенноеЗначение("Перечисление.упоСтратегииРеагированияНаРискТипаВозможность.ПустаяСсылка");
	Иначе	
		ТипСтратегии = ПредопределенноеЗначение("Перечисление.упоСтратегииРеагированияНаРискТипаУгроза.ПустаяСсылка");
	КонецЕсли;
	
	Для Каждого КлючЗначение Из СтруктураСтратегий Цикл
		Если ТипЗнч(ТипСтратегии) <> ТипЗнч(ЭтаФорма.Объект[КлючЗначение.Ключ]) Тогда
			ЭтаФорма.Объект[КлючЗначение.Ключ] = ТипСтратегии;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтаФорма.СвойстваРиска.ТипРиска = ПредопределенноеЗначение("Перечисление.упоТипыРисковПроектов.Возможность") Тогда
		ЭтаФорма.Элементы.СвойстваРискаНаименование.ЦветТекста = WebЦвета.Зеленый;
	ИначеЕсли ЭтаФорма.СвойстваРиска.ТипРиска = ПредопределенноеЗначение("Перечисление.упоТипыРисковПроектов.Угроза") Тогда
		ЭтаФорма.Элементы.СвойстваРискаНаименование.ЦветТекста = WebЦвета.Красный;
	Иначе
		ЭтаФорма.Элементы.СвойстваРискаНаименование.ЦветТекста = Новый Цвет();
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеФормыПоРегистрам(ОбъектСсылка = Неопределено) 
	
	Если ОбъектСсылка = Неопределено Тогда
		ОбъектСсылка = Объект.Ссылка;
	КонецЕсли;
	
	врСвойстваРиска = Справочники.упоРискиПроектов.ПолучитьТекущиеСвойстваРиска(ОбъектСсылка);
	врСвойстваРискаФакт = Справочники.упоРискиПроектов.ПолучитьТекущиеСвойстваРискаФакта(ОбъектСсылка);
	врСтатусРиска = Справочники.упоРискиПроектов.ПолучитьТекущийСтатусРиска(ОбъектСсылка);
	
	ЗаполнитьЗначенияСвойств(СвойстваРиска, врСвойстваРиска);
	ЗаполнитьЗначенияСвойств(СвойстваРискаБД, врСвойстваРиска);
	Объект.Наименование = СвойстваРиска.Наименование;
	
	Если НЕ ЭлементСозданКопированием Тогда
		ЗаполнитьЗначенияСвойств(СтатусРиска, врСтатусРиска);
		ЗаполнитьЗначенияСвойств(СтатусРискаБД, врСтатусРиска);
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(СвойстваРискаФакт, врСвойстваРискаФакт);
	ЗаполнитьЗначенияСвойств(СвойстваРискаФактБД, врСвойстваРискаФакт);
	
	ОбновитьДанныеПриоритета(ОбъектСсылка);
				
КонецФункции

&НаСервере
Функция ОбновитьДанныеПриоритета(ОбъектСсылка = Неопределено)
	
	Если ОбъектСсылка = Неопределено Тогда
		ОбъектСсылка = Объект.Ссылка;
	КонецЕсли;
	
	врПриоритетРискаБД = Справочники.упоРискиПроектов.ПолучитьТекущиеПриоритетыРиска(ОбъектСсылка); 
	ЗаполнитьЗначенияСвойств(ПриоритетРискаБД, врПриоритетРискаБД);
	
КонецФункции

&НаСервере
Функция ЗаписатьИзмененияВРегистры(пОбъект) 
	
	врСвойстваРиска = Справочники.упоРискиПроектов.ПолучитьПустуюСтруктуруСвойств();	
	ЕстьИзмененияСвойств = Ложь;
	Для Каждого КлючЗначение Из врСвойстваРиска Цикл
		ИмяПоля = КлючЗначение.Ключ;
		Если СвойстваРиска[ИмяПоля] <> СвойстваРискаБД[ИмяПоля] ИЛИ ЭлементСозданКопированием Тогда
			ЕстьИзмененияСвойств = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	врСвойстваРискаФакт = Справочники.упоРискиПроектов.ПолучитьПустуюСтруктуруСвойствФакта();	
	ЕстьИзмененияСвойствФакта = Ложь;
	Для Каждого КлючЗначение Из врСвойстваРискаФакт Цикл
		ИмяПоля = КлючЗначение.Ключ;
		Если СвойстваРискаФакт[ИмяПоля] <> СвойстваРискаФактБД[ИмяПоля] Тогда
			ЕстьИзмененияСвойствФакта = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	врСтатусРиска = Справочники.упоРискиПроектов.ПолучитьПустуюСтруктуруСтатусов(); 
	ЕстьИзмененияСтатуса = Ложь;
	Для Каждого КлючЗначение Из врСтатусРиска Цикл
		ИмяПоля = КлючЗначение.Ключ;
		Если СтатусРиска[ИмяПоля] <> СтатусРискаБД[ИмяПоля] Тогда
			ЕстьИзмененияСтатуса = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	ЕстьИзменения = ЕстьИзмененияСвойств ИЛИ ЕстьИзмененияСтатуса ИЛИ ЕстьИзмененияСвойствФакта;
	
	Если ЕстьИзменения Тогда
		
		ДокументРегистрацииИзменений = Документы.упоРегистрацияИзмененийРисковПроектов.СоздатьДокумент();
		ДокументРегистрацииИзменений.Дата = ТекущаяДатаСеанса();
		
		Если ЕстьИзмененияСвойств Тогда
			НоваяСтрока = ДокументРегистрацииИзменений.СвойстваПлан.Добавить();
			Для Каждого КлючЗначение Из врСвойстваРиска Цикл
				НоваяСтрока[КлючЗначение.Ключ] = СвойстваРиска[КлючЗначение.Ключ];
			КонецЦикла;
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, СвойстваРиска);
			НоваяСтрока.Риск = пОбъект.Ссылка;
		КонецЕсли;
		
		Если ЕстьИзмененияСвойствФакта Тогда
			НоваяСтрока = ДокументРегистрацииИзменений.СвойстваФакт.Добавить();
			Для Каждого КлючЗначение Из врСвойстваРискаФакт Цикл
				НоваяСтрока[КлючЗначение.Ключ] = СвойстваРискаФакт[КлючЗначение.Ключ];
			КонецЦикла;
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, СвойстваРиска);
			НоваяСтрока.Риск = пОбъект.Ссылка;
		КонецЕсли;		
		
		Если ЕстьИзмененияСтатуса Тогда
			НоваяСтрока = ДокументРегистрацииИзменений.Статусы.Добавить();
			Для Каждого КлючЗначение Из врСтатусРиска Цикл
				НоваяСтрока[КлючЗначение.Ключ] = СтатусРиска[КлючЗначение.Ключ];
			КонецЦикла;			
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтатусРиска);
			НоваяСтрока.Риск = пОбъект.Ссылка;
		КонецЕсли;	
		
		ДокументРегистрацииИзменений.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;	
	
КонецФункции

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьОжидаемуюСумму(Контекст) 
	
	Контекст.ОжидаемаяСумма = Контекст.Сумма * Контекст.ВероятностьВозникновения / 100;	
	
КонецФункции

&НаКлиенте
Процедура СвойстваРискаФактДатаНаступленияФактПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(СвойстваРискаФакт.ДатаНаступленияФакт) Тогда
		СвойстваРиска.ВероятностьВозникновения = 100;
		РассчитатьОжидаемуюСумму(СвойстваРиска);
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьФормуВебКлиент();
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда	
		Элементы.Переместить(Элементы.СвойстваРискаНаименование, Элементы.ГруппаВебКлиент);	
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти
