////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы библиотеки УправлениеПроектами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область СведенияОБиблиотекеИлиКонфигурации

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                  Обработчики обновления таких библиотек должны быть вызваны ранее
//                                  обработчиков обновления данной библиотеки.
//                                  При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                  порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                  в процедуре ПриДобавленииПодсистем общего модуля
//									ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	ИмяПодсистемы = ПолучитьИмяПодсистемы();
	
	Описание.Имя    = ИмяПодсистемы;
	Описание.Версия = "4.2.40.1";
	
	ИмяПодсистемыКОРП = ПолучитьИмяПодсистемыPM_КОРП();
	ИмяПодсистемыПРОФ = ПолучитьИмяПодсистемыPM_ПРОФ();
	Если Метаданные.Имя = ИмяПодсистемыКОРП Тогда
		Описание.ИдентификаторИнтернетПоддержки = "PMCorp";
	ИначеЕсли Метаданные.Имя = ИмяПодсистемыПРОФ Тогда
		Описание.ИдентификаторИнтернетПоддержки = "PM";
	КонецЕсли;
	
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");

	Описание.Вставить("ОсновнаяПодсистема", Не упоИнтеграцияВызовСервера.ЭтоИнтегрированнаяКонфигурация());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновленияИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список.
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	// Обработчики, выполняемые при заполнении пустой ИБ.
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьПустуюИБ";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьВводНаОсновании";
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "*";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "Обработки.упоГеографияПроектов.ЗаполнитьСписокВыбораГородовГеографическойСхемы";
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьКонфигурациюПродуктаPM";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ПроверитьИспользованиеВключитьРегламентноеЗаданиеРасчетСроковПроектов";
	Обработчик.РежимВыполнения = "Монопольно";
	
	ПриДобавленииОбработчиковОбновления_EPM(Обработчики);
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPMO()
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.1.1.17";
		Обработчик.НачальноеЗаполнение = Истина;
		Обработчик.Процедура = "ПользователиСлужебный.ОбновитьПредопределенныеВидыКонтактнойИнформацииПользователей";
		
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.1.18";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.УстановитьКорневыеПроектыУПроектов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.1.18";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.УстановитьКонстантуРассчитыватьПроцентГотовностиЭтаповПроектаПриРучнойАктуализацииПроекта";
		
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.1.20";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "упоОповещенияВызовСервера.ЗаполнитьПредопределенныеДанныеОповещений";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.1.20";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоПроектыИЗадачиСервер.ЗаполнитьРеквизитЭтоВехаВРучнойАктуализации";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.1.20";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьСвойстваПроектныхЗадач";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.1.28";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоПроектыИЗадачиСервер.ОчиститьДанныеУдаленныхЗадач";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.1.28";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоПроектыИЗадачиСервер.ЗаполнитьРеквизитКомпонентПроекта";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.2.4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ПереименоватьПредопределенныеПрофили";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.2.5";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоПоказателиПроектовСервер.ЗаполнитьПоказателиMove";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.2.6";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ПерепровестиДокументыСохранениеДанныхПроекта";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.2.9";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПредопределенныеПоказателиПроектов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.2.11";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.УстановитьПараметрыНабораСвойств_ФазыПроектов";
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.1.2.19";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьСвойстваВидовКонтактнойИнформации";
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.1.2.22";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьРеквизитКонтрагентПоВладельцу";
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.1.5";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.СинхронизироватьПодразделениеИСтруктуруПредприятия";
		
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.3.2";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.СоздатьПроектСтруктуры";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.3.4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоОповещенияВызовСервера.ЗаполнитьПредопределенныеДанныеОповещений";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.3.5";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьНастройкиПользователейПанелиПоказателей";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.1.1";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьУровеньПланированияРолей";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.1.4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьДоляТрудозатратПоУровнюПланирования";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.1.7";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьРегистрыЗатратРесурсовФакт";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.1.7";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьРегистрыЗатратРесурсовПлан";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.1.8";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.КорректироватьПоказателиПроектов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.1.9";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьУровеньПланированияДокуПрогнозТрудозатратПоРолям";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.1.11";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ИсправитьПоказателиВНастройкахСтруктурыПроекта";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.2.3";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ПереносПользователейВНовыеГруппыУдалениеСтарыхРолейИзПрофилей";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.2.32";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоИерархияИПолномочияСервер.АктуализироватьРуководителейВсехПроектныхЗадач";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.2.42";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ИсправитьДвиженияДРПоПодразделениям";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.3.4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ПереименоватьПрофильБазовыеПраваPM";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.3.14";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьПолеПодчиненныйПроект";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.3.15";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоПоказателиПроектовСервер.ЗаполнитьПоказателиПредшественники";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.3.16";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьСтандартнуюНастройкаКалендаря";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.4.8";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ПереименоватьКолонкиСтруктуры4248";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.4.23";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ИсправитьРасписаниеОтраженияТрудозатрат";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.4.26";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоОповещенияВызовСервера.ЗаполнитьПредопределенныеДанныеОповещений";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.4.30";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоИнтеграция.ЗаполнитьПоставляемыеГруппыДоступа";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.4.32";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ПеренестиРаспределениеПлановыхТрудозатратВНовыеРегистры";
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPMO()
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.4.33";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьКонтрагентовВДоговорах";
		
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.4.35";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьНастройкуУровняПланированияПриРасчетеГотовностиПроектов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.4.36";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ПеренестиОчередьРаспределенияПлановыхТрудозатрат";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.4.37";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьПроектСтруктурыВПортфеляхИПрограммах";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.4.40";
	Обработчик.Процедура = "УправлениеДоступомСлужебный.ЗаполнениеДанныхДляОграниченияДоступа";
	Обработчик.РежимВыполнения = "Монопольно";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.5.3";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ОбновлениеПользовательскихНастроекОперативнаяЗагрузкаСпециалистов";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.5.8";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ОбновлениеИспользованияРегламентногоЗаданияупоПересчетОграниченийДоступаПоПроектам";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.5.9";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьРегистрСвязейПроектаСНД";
	Обработчик.РежимВыполнения = "Монопольно";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.6.3";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ДобавитьПользователейВГруппыДоступаВыборПроектныхЗадачКакПроектаНаОсновеИхРолей";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.7.1";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоРабочиеКалендариВызовСервера.РассчитатьСмещенияДляВсехКалендарей";	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.8.3";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ИсправитьОписаниеПоказателя";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.8.5";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьПоказателиЭффективности";
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.8.7";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "упоПоказателиЭффективностиПроектов.УстановитьПараметрыНабораСвойств";
		
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPMO()
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.9.3";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьКонтрагентовВДоговорах";
		
	КонецЕсли;
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.9.3";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьТипЮридическихУсловийДоговора";
		
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.9.4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ПерезаполнитьКодИНаименованиеРегистраСведенийупоСписокВыбораПроектов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.9.6";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьВсеНаправленияДеятельности";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.9.8";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоПоказателиПроектовСервер.ЗаполнитьПоказателиПроектаПродажи";
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.10.3";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = 
			"ОбновлениеИнформационнойБазыPMO.ЗаполнитьВыводитьВСводныйСтатусОтчетИНеВыводитьВСтатусОтчетРегупоСвойстваПроектныхЗадач";
		
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.10.8";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ЗаполнитьЭтоАктируемаяИВнешняяНормаСтоимостиРегупоСвойстваПроектныхЗадач";
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		УправлениеДоступом.ДобавитьОбработчикОбновленияДляВключенияУниверсальногоОграничения("4.2.11.2", Обработчики);
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.11.7";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьВариантыОтчетовПользователяПоПортфелюПрограмме";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.11.11";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьПредопределеннуюНастройкуРаспределенияБДР";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.12.4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьКонстантыОтраженияФактаПервичнымиДокументами";
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.12.8";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьТипЗадачиуВПрогнозТрудозатратПоРолям";
		
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.12.12";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьВерсиюВРегистрахВыполнения";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.14.2";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьВидЗаданияПодразделениюВЗадания";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.14.3";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ПроектноеБюджетирование_ЗаполнитьПризнакЗаполнятьПоРаспределению";
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.14.4";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = 
			"ОбновлениеИнформационнойБазыPMO.ЗаполнитьПредопределенныеПрофилиНастроекПрогнозаТрудозатрат";
	
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.14.4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ПерезаписатьДокументыСинхронизацииФактическихДоходовИРасходов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.14.5";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ЗаполнитьНаправлениеДвиженияВСтатьиДвиженияДенежныхСредств";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.14.6";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ПерезаполнитьИсточникДанныхУДокументовСинхронизации";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.14.7";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьВводНаОсновании";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.14.8";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПравилаИнтеграцииС1СДокументооборотом";
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.14.9";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьНастройкиПоУмолчаниюПанелиРуководителяПодразделения";
		
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.14.10";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ИсправитьДвиженияСозданныеОбработкойПереносПроектныхЗадач";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1e57386f-bf29-4b2c-a586-fdc28a5a3698");
	Обработчик.Комментарий = 
		НСтр("ru = 'Исправляет движения регистров ""Проценты готовности проектных задач"", ""Статусы проектных задач""
		|и ""Фактические даты начала и окончания проектных задач"", сделанные обработкой 
		|""Перенос проектных задач (экспериментальная функция)"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.14.13";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура =
		"ОбновлениеИнформационнойБазыPMO.ПерепровестиДокументыупоРегистрацияФактическиВыполненногоОбъема";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.15.1";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура =
		"ОбновлениеИнформационнойБазыPMO.ОбновитьПользовательскиеНастройкиКолонокСтруктурыПроекта";
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.15.6";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура =
			"ОбновлениеИнформационнойБазыPMO.ОтключитьИспользованиеПодсистемыДоговоровИЗаявокНаПроекты";
		
	КонецЕсли;
		
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.15.6";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура =
			"ОбновлениеИнформационнойБазыPMO.ЗаполнитьУровеньГруппировкиПланированиеТрудозатратПоТрудовымРесурсам";
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.15.6";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура =
			"ОбновлениеИнформационнойБазыPMO.ЗаполнитьУровеньГруппировкиПрогнозТрудозатратПоРолям";
		
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.15.8";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыPMO.ОчиститьЗаписиРегистровПередУдалениемПланаОбменаУдалить_упоПолный";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b2449811-e0c8-46e6-a708-18ccad274a06");
	Обработчик.Комментарий = 
		НСтр("ru = 'Очистка данных в регистрах сведений по объектам типа ""ПланОбмена.Удалить_упоПолный"" 
		|перед полным удалением указанного плана обмена.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.15.9";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьВидСобытия_НазначениеНаПроектнуюЗадачу";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b86638aa-f54b-449b-9f0c-e95d6d636026");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление выполняемого кода в тэгах предопределенного элемента ""Назначение проектной задачи"" 
		|справочника ""Виды событий"".'");
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.15.10";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьВалютуДоговорыКонтрагентов";
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.17.12";
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ИзменитьИмяПодсистемыКОРПНаПРОФ";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("6e12ac5b-ca68-463f-8703-364d66ee7513");
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.17.13";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.СоздатьНовыеОбновитьПоказателиПроектовИзМакета";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.21.3";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_ПроцентГотовности";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f216fe11-f61c-423a-8ed9-09e1d3ba2082");
	Обработчик.Комментарий = НСтр("ru = 'Обновление показателя проектов ""Процент готовности"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.21.8";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьРеквизитШифрПроекта";
	Обработчик.РежимВыполнения = "Монопольно"; 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.22.5";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПредопределенныеВидыСобытий";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.23.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьРеквизитРегистрацииППНоменклатурыРегистрацииОбъемов";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.24.7";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ВыполнитьПереходНаНовыйМеханизмНастроекРаботаСЗаданиями";
	Обработчик.Комментарий = 
		НСтр("ru = 'Выполнение перехода на новый механизм сохранения/загрузки настроек в обработке ""Работа с Заданиями"".'");
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.24.10";
		Обработчик.НачальноеЗаполнение = Истина;
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Процедура = 
			"ОбновлениеИнформационнойБазыPMO.ЗаполнитьПредопределенныеПрофилиНастроекПрогнозаТрудозатрат";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("2f255884-9b61-4007-8098-63e789588ea4");
		Обработчик.Комментарий = 
			НСтр("ru = 'Заполнение предопределенных профилей настроек документа ""Прогноз трудозатрат по ролям"".'");
		
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.24.12";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьСправочникНастроекРаспределенияБДР";
	Обработчик.Комментарий = НСтр("ru = 'Обновление справочника ""Настройки распределения БДР"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.24.15";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.УстановитьИспользованиеПроектнойПродукции";
	Обработчик.Комментарий = НСтр("ru = 'Включение использования функционала ""Проектная продукция"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.26.4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьДанныеРегистраПричинОтклонения";
	Обработчик.Комментарий = НСтр("ru = 'Обновление данных регистра ""Причины отклонений"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.26.5";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.СоздатьВерсииДополнительныхРеквизитов";
	Обработчик.Комментарий = НСтр("ru = 'Создание версий дополнительных реквизитов.'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.26.7";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПредопределенныеПравилаПолученияФакта_4_2_26_7";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("5231de73-d235-475e-8a69-9f90fbc147d5");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление правил получения факта проектного бюджетирования из поставляемых макетов.'");
		
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.27.4";
		Обработчик.НачальноеЗаполнение = Ложь;
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "упоПроектнаяПродукция.ЗаполнениеРеквизитаПроектПроектнойПродукции";
		Обработчик.Комментарий = НСтр("ru = 'Заполнение реквизита ""Проект"" для проектной продукции.'");
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.28.5";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_ОтставаниеОтПлана";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("eccdfaa3-5ea1-484d-aa0a-0e7368ffd27e");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление предустановленных показателей проектов: '") +
		НСтр("ru = '""Отставание от БП"", ""Отставание от ТП"", ""Отставание от ДП"".'"); 
		
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.28.5";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ВключитьВПользовательскиеНастройкиТипПлана";
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.29.2";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьКомпонентСлужебныйВПроекте";
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.29.5";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьКорневыеПроектыПроектов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.30.13";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "упоОповещенияВызовСервера.ЗаполнитьПредопределенныеДанныеОповещений";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("17c89d40-c1ce-4016-a522-59a8767a7820");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление предопределенных данных видов получателей оповещений.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.31.9";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.УдалитьПараметрыПоказателяДоКонцаПроектаНедель";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7f64105e-b9a4-45b1-8b21-afa7ff9b2388");
	Обработчик.Комментарий = 
		НСтр("ru = 'Удаление параметров запросов показателя ""До конца проекта (недель)"".'");
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.31.11";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьСлужебныеРеквизитыДляПереходаНаРМ5";
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.31.13";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_423110";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("82484b72-fea9-4ac6-84aa-fd53986b20fe");
	Обработчик.Комментарий = 
		НСтр("ru = 'Полное обновление предустановленных показателей проектов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.35.5";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_42355";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0ef6f253-475a-4322-bd90-6673ef96198e");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление описаний предустановленных показателей проектов: EV, PV, AC, CPI, SPI, BAC, TCPI.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.35.8";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ПересчитатьТрудозатратыПроектныхЗадач";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("76fc583d-e8ce-430c-a4e4-86985621cdfb");
	Обработчик.Комментарий = НСтр("ru = 'Пересчитывает неверно распределенные трудозатраты проектных задач.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.35.9";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_42359";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c67c0904-1dd6-4ef6-8236-9d84dcb144f9");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление расчета предустановленных показателей проектов: % Трудозатрат (Количество) П, 
																			| % Трудозатрат (Количество) О, 
																			| % Трудозатрат (Стоимость) П, 
																			| % Трудозатрат (Стоимость) О,
																			| Объем Р (факт).
				   |Добавление новых предустановленных показателей проектов: Трудозатраты план (Количество) О,
					                                                        | Трудозатраты факт (Количество) О,
																			| Трудозатраты план (Стоимость) О,
																			| Трудозатраты факт (Стоимость) О,
																			| Трудозатраты план (Количество) П,
																			| Трудозатраты план (Стоимость) П'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.36.4";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_42364";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("71063ac0-6f64-4a78-8c07-084dba1b46c2");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление описания предустановленных показателей проектов: Трудозатраты факт (Количество),
																			| Трудозатраты факт (Стоимость) О'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.36.6";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПредопределенныеПравилаПолученияФакта_4_2_36_6";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("2af0ed79-6df3-4954-bb05-8c632e813134");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление правил получения факта проектного бюджетирования из поставляемых макетов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.36.6";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ДобавитьНовыеПоказателиСтавкаСтоимостиДенегИПроцентСтоимостиДенег";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("43f56edd-068a-49c3-b4e7-b093723a6cb5");
	Обработчик.Комментарий = 
		НСтр("ru = 'Добавление новых показателей ""Ставка стоимости денег"" и ""% стоимости денег"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.36.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьИсточникПланаТрудозатратДляЗадачСТрансляциейПроектнойПродукции";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e4a14f8a-26ed-42a3-b66f-4b8d5bdbf9a9");
	Обработчик.Комментарий = 
		НСтр("ru = 'Заполнение изменения ""ИсточникПлана"" в регистрах ""упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия""
		|и ""упоАктуальныеПланыТрудозатратСводноТекущаяВерсия"" для задач с трансляцией проектной продукции в трудозатраты.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.36.8";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_42368";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a95a3024-7e32-439f-8cd8-45a3b6534004");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление представления расчетных индикаторов в формулах для предустановленных показателей проектов: 
																			| % Трудозатрат (Количество) П, 
																			| % Трудозатрат (Количество) О, 
																			| % Трудозатрат (Стоимость) П, 
																			| % Трудозатрат (Стоимость) О'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.36.9";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_42369";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6c501a9e-d266-4fa7-8c6d-f58e8319e90f");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление предустановленных показателей проектов: Объемы Д (Т), 
																	 | Трудозатраты факт (Количество).
				   |Добавление новых предустановленных показателей проектов: EV Тр,
					                                                       | CPI Тр,
																		   | Трудозатраты план (Количество) предв. уровень, на текущую дату,
																		   | Трудозатраты план (Количество) предв. уровень, на дату актуальности,
																		   | SPI Тр (тек.дата),
																		   | SPI Тр'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.37.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_58194";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7763b1a5-0228-486b-b638-5118e5aea9e8");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление наименования предустановленных показателей проектов: ""Длительность"".
				   |Добавление новых предустановленных показателей проектов: ""Длительность, день"".'");
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоERPУХ() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.НачальноеЗаполнение = Истина;
		Обработчик.Версия = "4.2.37.1";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = 
			"ОбновлениеИнформационнойБазыPMO.ВключитьИспользованиеПредопределенныхДополнительныхРеквизитов";
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.37.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ea25ce07-c528-4715-b951-0cfda71a59c9");
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ПересчитатьТрудозатратыПроектныхЗадачСДублямиРолей";
	Обработчик.Комментарий = НСтр("ru = 'Пересчитывает неверно распределенные трудозатраты проектных задач
		|(исторические данные с дублями ролей в одной проектной задаче).'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.37.8";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("38c13af5-87e3-4772-916e-d93ef63e70f3");
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнениеРеквизитаДатаЗакрытияЭтапаДокументовЗакрытияЭтапа";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение реквизита ""Дата закрытия этапа"" в документах ""Закрытие этапа"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.37.9";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_42379";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("eebd3cb1-4504-4799-b0bd-f44d7f0445a0");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление описания предустановленных показателей проектов: ""Готовность задачи-родителя, %""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.37.10";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_423710";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6defdc93-9fb9-492b-a5e0-b3ad25e12f27");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление предустановленных показателей проектов: ""Длительность, день"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.37.13";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаполнитьНомераДоговоровЮрУсловий";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("fe364163-f72b-4d1d-88ca-972657b91c0e");
	Обработчик.Комментарий = 
		НСтр("ru = 'Заполнение номеров договоров в документах ""Регистрация юридических условий договора"".'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.37.14";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьДвиженияДокументаПоРегистру_упоСинхронизацияФактическихТрудозатрат";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("65996a7a-89c9-4cc3-a9e7-843496773edc");
	Обработчик.Комментарий = 
		НСтр("ru = 'Заполнение аналитики ""Задача и/или причина"" в движениях документов ""Синхронизация фактических трудозатрат"" по регистру ""Использование рабочего времени"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.37.16";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_423716";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b4d2e5f3-332b-4faf-a2f3-cdcef2411a66");
	Обработчик.Комментарий = 
		НСтр("ru = 'Добавление предустановленных показателей проектов: ""Трудозатраты факт (Количество) по портфелю"",
																	 | ""Трудозатраты факт (Количество) по проекту"",
																	 | ""Трудозатраты факт (Стоимость) по портфелю"",
																	 | ""Трудозатраты факт (Стоимость) по проекту"",
																	 | ""Сумма доходного объема по портфелю (факт)"",
																	 | ""Сумма доходного объема по проекту (факт)"",
																	 | ""Сумма расходного объема по портфелю (факт)"",
																	 | ""Сумма расходного объема по проекту (факт)"",
																	 | ""Доходы (факт по портфелю)""
																	 | ""Доходы (факт по подчиненному проекту)"",
																	 | ""Доходы (факт общий)"",
																	 | ""Расходы (факт по портфелю)"",
																	 | ""Расходы (факт по подчиненному проекту)"",
																	 | ""Расходы (факт общий)"",
																	 | ""Маржа порт.% (план)"",
																	 | ""Маржа порт.% (факт)"",
																	 | ""Маржа портфеля (план)"",
																	 | ""Маржа портфеля (факт)"",
																	 | ""Отклонение по портфелю Д"",
																	 | ""Отклонение по портфелю Р"",
																	 | ""Выплаты (факт по портфелю)"",
																	 | ""Выплаты (факт по подчиненному проекту)"",
																	 | ""Поступления (факт по портфелю)"",
																	 | ""Поступления (факт по подчиненному проекту)"",
																	 | ""Выплаты (факт общий)"",
																	 | ""Денежный поток портфеля (план)"",
																	 | ""Денежный поток портфеля (факт)"",
																	 | ""Отклонение выплат по портфелю"",
																	 | ""Отклонение денежного потока по портфелю"",
																	 | ""Отклонение поступлений по портфелю"",
																	 | ""Поступления (факт общий)""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.38.3";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ЗаменитьРоль_упоЧтениеДополнительныхОтчетовИОбработок";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("eb9c35f6-3a22-465b-acaf-af79ebd5b897");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.39.4";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьПоказателиПроектовИзМакета_423904";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("71c16c48-2c85-41cc-b8c3-90b6d9539415");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление формата предустановленных показателей проектов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.39.6";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ПерейтиНаВерсию_4_2_39_6";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("82b2dfeb-f10c-44dd-88d6-34b7258397e6");
	Обработчик.Комментарий = 
		НСтр("ru = 'Исправление ошибки потери данных трансляции БДР в БДДС.'");
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
			
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - (возвращаемое значение) если установить Истина,
//                                то будет выведена форма с описанием обновлений. По умолчанию, Истина.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример обхода выполненных обработчиков обновления:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//									ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список.
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        	Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации,
//			следует указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, 
	Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт 	
	
КонецПроцедуры

// Функция создает элемент справочника Валюты, если такого нет.
//
// Параметры:
//  Код -                     - значение соответствующего реквизита справочника,
//  Наименование              - значение соответствующего реквизита справочника,
//  НаименованиеПолное        - значение соответствующего реквизита справочника,
//  ПараметрыПрописиНаРусском - значение соответствующего реквизита справочника.
//
// Возвращаемое значение:
//  Ссылка - ссылка на добавленный или существующий элемент.
//
Функция НайтиСоздатьВалюту(Код, Наименование, НаименованиеПолное, ПараметрыПрописиНаРусском) Экспорт

	Ссылка = Справочники.Валюты.НайтиПоКоду(Код);

	Если Ссылка.Пустая() Тогда
		
		СправочникОбъект = Справочники.Валюты.СоздатьЭлемент();

		СправочникОбъект.Код                       = Код;
		СправочникОбъект.Наименование              = Наименование;
		СправочникОбъект.НаименованиеПолное        = НаименованиеПолное;
		СправочникОбъект.ПараметрыПрописи = ПараметрыПрописиНаРусском;

		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);

		Ссылка = СправочникОбъект.Ссылка;

		// установим курс и кратность = 1 на 1 января 1980
		РаботаСКурсамиВалют.ПроверитьКорректностьКурсаНа01_01_1980(Ссылка);

	КонецЕсли;

	Возврат Ссылка;

КонецФункции

// Функция заполняет новые реквизиты документов Распределение рабочего времени.
Функция ЗаполнитьРаспределениеРабочегоВремени() Экспорт
	
	ТекЗнач = ПараметрыСеанса.упоОтключитьПроверкуОграничений;
	ПараметрыСеанса.упоОтключитьПроверкуОграничений = Истина;
	
	Выборка = Документы.упоРаспределениеРабочегоВремениЗаНеделю.Выбрать();
	
	МассивДней = Новый Массив;
	МассивДней.Добавить("Понедельник");
	МассивДней.Добавить("Вторник");
	МассивДней.Добавить("Среда");
	МассивДней.Добавить("Четверг");
	МассивДней.Добавить("Пятница");
	МассивДней.Добавить("Суббота");
	МассивДней.Добавить("Воскресенье");
	
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого Строка Из Объект.РасшифровкаТрудозатрат Цикл
			Если Не ЗначениеЗаполнено(Строка.РазделУчета) Тогда
				Строка.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Строка.РольРесурса) Тогда
				СтрокаРодителя = Объект.РабочиеЗадания.Найти(Строка.РабочееЗадание, "РабочееЗадание");	
				Если СтрокаРодителя <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(Строка, СтрокаРодителя, "РольРесурса, Подразделение");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		РасшифровкаТрудозатрат = Объект.РасшифровкаТрудозатрат.Выгрузить();
		Объект.РасшифровкаТрудозатрат.Очистить();
		Для Каждого Строка Из РасшифровкаТрудозатрат Цикл
			Если ЗначениеЗаполнено(Строка.ДеньНедели) Тогда
				ЗаполнитьЗначенияСвойств(Объект.РасшифровкаТрудозатрат.Добавить(), Строка);
			Иначе
				Для Каждого ДеньНедели Из МассивДней Цикл
					Трудозатраты = Строка["Удалить_"+ДеньНедели];
					Если ЗначениеЗаполнено(Трудозатраты) Тогда
						НоваяСтрока = Объект.РасшифровкаТрудозатрат.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						НоваяСтрока.ИтогоПоСтроке = Трудозатраты;
						НоваяСтрока.ДеньНедели = ДеньНедели;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если Объект.Модифицированность() Тогда
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыСеанса.упоОтключитьПроверкуОграничений = ТекЗнач;
	
	ЗаполнитьВидыОпераций();
	
КонецФункции

// Заполняет предопределенные значения в справочнике упоВидыОпераций.
Функция ЗаполнитьВидыОпераций() Экспорт
	
	МассивВидовОпераций = Новый Массив;
	МассивВидовОпераций.Добавить("ВнепроектноеВремя");
	МассивВидовОпераций.Добавить("Командировка");
	МассивВидовОпераций.Добавить("ПотеряВремени");
	МассивВидовОпераций.Добавить("Явка");
	
	Для Каждого ВидОперации Из МассивВидовОпераций Цикл
		Объект = Справочники.упоВидыОпераций[ВидОперации].ПолучитьОбъект();
		Объект.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача;
		Объект.Записать();
	КонецЦикла;
	
КонецФункции

// Устанавливает корневые проекты у проектов-зеркал проектных задач.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура УстановитьКорневыеПроектыУПроектов(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.Ссылка,
	               |	Проекты.СсылкаНаПроектнуюЗадачу.Проект КАК упоКорневойПроект
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.ЭтоПроектнаяЗадача
	               |	И НЕ Проекты.ПометкаУдаления
	               |	И Проекты.упоКорневойПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПроектОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПроектОбъект.упоКорневойПроект = Выборка.упоКорневойПроект;
			ПроектОбъект.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает корневые проекты у проектов и проектов-зеркал проектных задач.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура ЗаполнитьКорневыеПроектыПроектов(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.Ссылка КАК Ссылка,
	               |	Проекты.Ссылка КАК КорневойПроект
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	НЕ Проекты.ЭтоПроектнаяЗадача
	               |	И Проекты.упоКорневойПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Проекты.Ссылка,
	               |	Проекты.СсылкаНаПроектнуюЗадачу.Проект
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.ЭтоПроектнаяЗадача
	               |	И Проекты.упоКорневойПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПроектОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПроектОбъект.упоКорневойПроект = Выборка.КорневойПроект;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПроектОбъект);
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает константу "рассчитывать процент готовности этапов проекта при ручной актуализации проекта".
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура УстановитьКонстантуРассчитыватьПроцентГотовностиЭтаповПроектаПриРучнойАктуализацииПроекта(Параметры = Неопределено) Экспорт
	
	Константы.упоАвтоматическиРассчитыватьПроцентГотовностиЭтаповПроекта.Установить(Истина);
	
КонецПроцедуры

// Осуществляет заполнение пустой информационной базы.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура ЗаполнитьПустуюИБ(Параметры = Неопределено) Экспорт
	
	// Коэффициенты единиц времени и признак временной единицы по умолчанию.
	Единица 					= Справочники.упоЕдиницыВремени.Час.ПолучитьОбъект();
	Единица.Коэффициент 		= 1;
	Единица.ЭтоЕдиницаВремени 	= Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Единица);
		
	Единица 					= Справочники.упоЕдиницыВремени.Сутки.ПолучитьОбъект();
	Единица.Коэффициент 		= 24;
	Единица.ЭтоЕдиницаВремени 	= Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Единица);
		
	Единица 					= Справочники.упоЕдиницыВремени.РабочийДень.ПолучитьОбъект();
	Единица.Коэффициент 		= 8;
	Единица.ЭтоЕдиницаВремени 	= Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Единица);
				
	Единица 					= Справочники.упоЕдиницыВремени.РабочаяНеделя.ПолучитьОбъект();
	Единица.Коэффициент 		= 40;
	Единица.ЭтоЕдиницаВремени 	= Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Единица);
	
	// Параметры распределения по умолчанию.		
	Профиль = Справочники.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение.ПолучитьОбъект();
	Профиль.СпособРаспределения = Перечисления.упоСпособРаспределенияТрудозатрат.ПоТаблицеРаспределенияСПериодами;
	
	новСтрока 			   = Профиль.ТаблицаРаспределенияПоПериоду.Добавить();
	новСтрока.ДоляПериода  = 100;
	новСтрока.Трудозатраты = 100;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Профиль);
	
	ВалютаРегламентированногоУчета = 
		НайтиСоздатьВалюту("643", "руб.", 	"Российский рубль", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	ВалютаУправленческогоУчета = 
		НайтиСоздатьВалюту("840", "USD", 	"Доллар США",       "доллар, доллара, долларов, м, цент, цента, центов, м, 2");
	ВалютаМеждународногоУчета =
		НайтиСоздатьВалюту("978", "EUR", 	"Евро",		       	"евро, евро, евро, м, цент, цента, центов, м, 2");	
	
	ЗаполнитьРаспределениеРабочегоВремени();
	
	СоздатьНовыеПоказателиПроектовИзМакета();
	упоПоказателиПроектовСервер.ЗаполнитьПоказателиGoGetFreeze();
	упоПоказателиПроектовСервер.ЗаполнитьПоказательКоэффициентСложности();
	упоПоказателиПроектовСервер.ЗаполнитьКартинкиПоказателей();
	упоПоказателиПроектовСервер.ЗаполнитьПорядокПоказателей();
	упоПоказателиПроектовСервер.ЗаполнитьПоказателиПредшественники();
	упоПоказателиПроектовСервер.ЗаполнитьПоказателиПроектаПродажи();
	упоПоказателиПроектовСервер.ЗаполнитьПоказательСтавкаСтоимостиДенег();
	
	УстановитьПараметрыНабораСвойств_ФазыПроектов();
	
	упоОповещенияВызовСервера.ЗаполнитьПредопределенныеДанныеОповещений();
	
	ОбновлениеИнформационнойБазыPMO.ЗаполнитьСвойстваВидовКонтактнойИнформации();
	
	ОбновлениеИнформационнойБазыPMO.ОбновитьПрофилиИГруппыДоступа();
	
	Константы.ВалютаУправленческогоУчета.Установить(ВалютаРегламентированногоУчета);
	
	Константы.упоАвтоматическиРассчитыватьПроцентГотовностиЭтаповПроекта.Установить(Истина);
	Константы.упоМетодОперативногоПланированияПоУмолчанию.Установить(
		Перечисления.упоМетодОперативногоПланирования.ПрямоеВыделениеРесурсовНаПроект);
	
	Константы.упоСоздаватьДокументСохранениеДанныхПроектаОдинЗаДень.Установить(Ложь);
	Константы.упоРазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи.Установить(Истина);
	
	Константы.упоВариантРаспределенияРабочегоВремени.Установить(
		Перечисления.упоВариантыРаспределенияРабочегоВремени.ПоЗаданиямИПроектнымЗадачам);
	Константы.упоПравилоРаспределенияРабочегоВремениНаЗаданияИПроектныеЗадачи.Установить(
		Перечисления.упоПравилаРаспределенияРабочегоВремениНаЗаданияИПроектныеЗадачи.
			НеРаспределятьНаЗадачиПоКоторымЕстьЗадания);
		
	Константы.упоИспользоватьСтавкуТрудовогоРесурсаПриРасчетеСтоимостиТрудозатрат.Установить(Истина);
	
	Константы.упоПланироватьТрудозатратыПоПроекту.Установить(Истина);
	Константы.упоУказыватьПодразделениеРолиПриПланированииТР.Установить(Истина);
	
	Константы.упоПоказыватьНаЗакладкахПланДоходовПланРасходовДДСДанныеОтраженияСДругихЗакладок.Установить(Истина);
	
	ЗаполнитьСтандартнуюНастройкаКалендаря();
	
	РабочийКалендарьПоУмолчанию = СоздатьЗарегистрироватьРабочийКалендарьПоУмолчанию();
	
	Константы.упоРабочийКалендарьПоУмолчанию.Установить(РабочийКалендарьПоУмолчанию);
	
	ЗаполнитьПредопределенныеЗначения_СправочникРоли();
	
	ЗаполнитьПоказателиЭффективности();
	
	упоИнтеграцияEPMСервер.ЗаполнитьНаправлениеДвиженияСтатейДДС(Истина);
	
КонецПроцедуры

// Заполняет стандартную настройку календаря.
// 
Функция ЗаполнитьСтандартнуюНастройкаКалендаря() Экспорт
	НастройкаКалендаря = Справочники.упоНастройкиКалендарей2.Стандартная.ПолучитьОбъект();
	НастройкаКалендаря.Заполнить(Неопределено);
	НастройкаКалендаря.Записать();
КонецФункции 

Функция СоздатьЗарегистрироватьРабочийКалендарьПоУмолчанию()
	
	СтандартнаяНастройка = Справочники.упоНастройкиКалендарей.СоздатьЭлемент();
	СтандартнаяНастройка.Заполнить(Неопределено);
	СтандартнаяНастройка.Наименование = НСтр("ru = 'Стандартная'");
	СтандартнаяНастройка.ПолноеНаименование = НСтр("ru = 'Стандартная'");
	СтандартнаяНастройка.Записать();
	
	РабочийКалендарь = Справочники.упоРабочиеКалендари.СоздатьЭлемент();
	РабочийКалендарь.Наименование = НСтр("ru = 'Стандартный'");
	РабочийКалендарь.ПолноеНаименование = НСтр("ru = 'Стандартный'");
	РабочийКалендарь.Записать();
	
	ТекДата = ТекущаяДата();
	ТекущийГод = Год(ТекДата);
	НачалоПериода = ТекущийГод - 5;
	КонецПериода = ТекущийГод + 15;
	Для к = НачалоПериода По КонецПериода Цикл
		ДокРегистрацияРабочегоКалендаря = Документы.упоРегистрацияРабочегоКалендаря.СоздатьДокумент();
		ДокРегистрацияРабочегоКалендаря.Дата = ТекДата;
		ДокРегистрацияРабочегоКалендаря.ГодКалендаря = к;
		ДокРегистрацияРабочегоКалендаря.Календарь = РабочийКалендарь.Ссылка;
		ДокРегистрацияРабочегоКалендаря.НастройкаКалендаря = СтандартнаяНастройка.Ссылка;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокРегистрацияРабочегоКалендаря, 
													Ложь, 
													Истина, 
													РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	упоРабочиеКалендариВызовСервера.РассчитатьСмещенияДляКалендаря(РабочийКалендарь.Ссылка);
	
	Возврат РабочийКалендарь.Ссылка;
	
КонецФункции

// Обновляет профили и группы доступа.
// 
// Параметры:
//  Параметры - Произвольный - параметры.
//
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ОбновитьПрофилиИГруппыДоступа(Параметры = Неопределено) Экспорт
	
	упоИнтеграция.ЗаполнитьПоставляемыеГруппыДоступа();
	
КонецФункции

// Заполняет свойства проектных задач.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура ЗаполнитьСвойстваПроектныхЗадач(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Свойства.Период,
	               |	Свойства.Регистратор КАК Регистратор,
	               |	Свойства.НомерСтроки,
	               |	Свойства.Активность,
	               |	Свойства.Версия,
	               |	Свойства.ПроектнаяЗадача,
	               |	Свойства.Длительность,
	               |	Свойства.ЗадачаРодитель,
	               |	Свойства.КрайнийСрок,
	               |	Свойства.МетодРасчетаМоделиПакетаРабот,
	               |	Свойства.НазваниеЗадачи,
	               |	Свойства.НормаСтоимости,
	               |	Свойства.СпособПланированияРасходов,
	               |	Свойства.СпособПривязкиДопЗатрат,
	               |	Свойства.УчестьРучнойВводСроковПриАктуализации,
	               |	Свойства.ЭтоМодельПакетаРабот,
	               |	Свойства.ЭтоПакетРабот,
	               |	Свойства.ПланироватьТрудозатратыНаИсполнителей,
	               |	Свойства.ВидОперации,
	               |	Свойства.ДлительностьМоделиПакетаРабот,
	               |	Свойства.ЕдиницаНормированияДлительности,
	               |	Свойства.НормаСтоимостиТрудовыхРесурсов,
	               |	Свойства.ДлительностьБезУчетаКалендаряПроекта,
	               |	Свойства.ВключитьСубпродуктыВПланДоходов,
	               |	Свойства.ВключитьМатРесурсыВПланРасходов,
	               |	Свойства.РучнойВводСроков,
	               |	Свойства.КодПроектногоДокумента,
	               |	Свойства.ЭтоВеха,
	               |	Свойства.Объект КАК Объект,
	               |	Свойства.ОписаниеЗадачи КАК ОписаниеЗадачи
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач КАК Свойства";
				   
	Результат = Запрос.Выполнить().Выгрузить();
	Регистраторы = Результат.Скопировать(,"Регистратор");
	Регистраторы.Свернуть("Регистратор");
	
	Для каждого Строка Из Регистраторы Цикл
		
		Регистратор = Строка.Регистратор;
		
		НЗ = РегистрыСведений.упоСвойстваПроектныхЗадач.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Регистратор);
		НЗ.Прочитать();
		
		Данные = Результат.Скопировать(Новый Структура("Регистратор", Регистратор));
		НЗ.Загрузить(Данные);
		НЗ.Записать();
		
	КонецЦикла;
		
КонецПроцедуры

// Переименовывает предопределенные профили.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура ПереименоватьПредопределенныеПрофили(Параметры = Неопределено) Экспорт
	
	СпрОбъект = Справочники.ПрофилиГруппДоступа.упоИсполнительРаботБезФинансов.ПолучитьОбъект();
	СпрОбъект.Наименование = "Исполнитель работ";
	СпрОбъект.Записать();
	
КонецПроцедуры

// Перепроводит последние регистраторы по регистру со способом привязки дохода и расхода на дату.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура ПерепровестиДокументыСохранениеДанныхПроекта(Параметры = Неопределено) Экспорт
	
	ПараметрыСеанса.упоОтключитьПроверкуОграничений = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Регистратор
	                      |ИЗ
	                      |	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(, СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
	                      |ГДЕ
	                      |	(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Регистратор ССЫЛКА Документ.упоСохранениеДанныхПроекта
	                      |			ИЛИ упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Регистратор ССЫЛКА Документ.упоРасчетКалендарногоПланаПроекта)");
						  
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();		
		Пока Выборка.Следующий() Цикл
		
			ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект();			
			Попытка								
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, 
													Ложь, 
													Истина, 
													РежимЗаписиДокумента.Проведение);
			Исключение
			КонецПопытки;	
						
		КонецЦикла;	
		
	КонецЕсли;	
	
	ПараметрыСеанса.упоОтключитьПроверкуОграничений = Ложь;
	
КонецПроцедуры

// Заполняет ввод на основании для указанных объектов
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура ОбновитьВводНаОсновании(Параметры = Неопределено) Экспорт
	
	Объекты = Новый Массив;
	Объекты.Добавить("Документ.упоПроектнаяЗадача");
	Объекты.Добавить("Справочник.Проекты");
	
	ТаблицаВводНаОсновании = упоФункцииОбщегоНазначенияСервер.ПолучитьТаблицуОбъектовДляВводаНаОсновании(Объекты, Истина);
	
	ХранилищеЗначений = Новый ХранилищеЗначения(ТаблицаВводНаОсновании);
	Константы.упоВводНаОсновании.Установить(ХранилищеЗначений);
	
КонецПроцедуры

// Обновляет предопределенные показатели проектов.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура ОбновитьПредопределенныеПоказателиПроектов(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	упоПоказателиПроектовСостояния.Ссылка
	                      |ИЗ
	                      |	Справочник.упоПоказателиПроектов.Состояния КАК упоПоказателиПроектовСостояния
	                      |ГДЕ
	                      |	упоПоказателиПроектовСостояния.Ссылка.Предопределенный
	                      |	И упоПоказателиПроектовСостояния.Значение = НЕОПРЕДЕЛЕНО
	                      |	И ТИПЗНАЧЕНИЯ(упоПоказателиПроектовСостояния.ЗначениеС) = Тип(Число)");
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПоказательОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Состояния = ПоказательОбъект.Состояния;
			Для Каждого Состояние Из Состояния Цикл
				Если Состояние.Значение = НЕОПРЕДЕЛЕНО Тогда
					Состояние.Значение = 0;
				КонецЕсли;	
			КонецЦикла;	
			ПоказательОбъект.Записать();
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры	

// Функция - Вкл доп реквизиты и свойства для фаз
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Функция УстановитьПараметрыНабораСвойств_ФазыПроектов(Параметры = Неопределено) Экспорт
	
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Справочник_упоФазыПроектов");
	
КонецФункции

// Процедура обновления ИБ для справочника видов контактной информации.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
// Инструкция.
// Для каждого объекта, владельца КИ, для каждого соответствующего ему вида КИ добавить 
// строчку вида: ОбновитьВидКИ(.....). При этом,
// важен порядок в котором будут осуществляться эти вызовы, чем раньше вызов для вида КИ,
// тем выше этот вид КИ будет располагаться на форме объекта.
//
// Параметры функции УправлениеКонтактнойИнформацией.ОбновитьВидКИ:
// 1. Вид КИ - Ссылка на предопределенный вид КИ.
// 2. Тип КИ - Ссылка на перечисление
// 3. МожноИзменятьСпособРедактирования  - Определяет, можно ли в режиме Предприятие изменить способ редактирования,
//                                         например, для адресов, которые попадают в регл. отчетность, нужно
//                                         запретить возможность изменения.
// 4. РедактированиеТолькоВДиалоге       - Если установить Истина, то будет значение вида КИ можно будет
//                                         редактировать только в форме ввода (имеет смысл только для
//                                         адресов, телефонов и факсов).
// 5. АдресТолькоРоссийский              - Если установить Истина, то для адресов можно будет ввести 
//                                         только российский адрес (имеет смысл только для адресов).
// 6. Порядок                            - Определяет порядок элемента, для сортировки относительно других.
//
//
Процедура ЗаполнитьСвойстваВидовКонтактнойИнформации(Параметры = Неопределено) Экспорт
	
	МенеджерКонтактнойИнформации = Справочники["ВидыКонтактнойИнформации"];
	
	// СтандартныеПодсистемы 
	// СтандартныеПодсистемы.Пользователи
	ОбновитьВидКИ(МенеджерКонтактнойИнформации.EmailПользователя,
		Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, 	Истина, Ложь, Ложь, 1);
	ОбновитьВидКИ(МенеджерКонтактнойИнформации.ТелефонПользователя,
		Перечисления.ТипыКонтактнойИнформации.Телефон,               	Истина, Ложь, Ложь, 2);
	// Конец СтандартныеПодсистемы.Пользователи 
	
	// Справочник "Контрагенты"
	ОбновитьВидКИ(МенеджерКонтактнойИнформации.ФактАдресКонтрагента,
		Перечисления.ТипыКонтактнойИнформации.Адрес, 					Истина, Ложь, Ложь, 3);
	ОбновитьВидКИ(МенеджерКонтактнойИнформации.ЮрАдресКонтрагента,
		Перечисления.ТипыКонтактнойИнформации.Адрес, 					Истина, Ложь, Ложь, 4);
	ОбновитьВидКИ(МенеджерКонтактнойИнформации.ПочтовыйАдресКонтрагента,
		Перечисления.ТипыКонтактнойИнформации.Адрес, 					Истина, Ложь, Ложь, 5);
	ОбновитьВидКИ(МенеджерКонтактнойИнформации.ТелефонКонтрагента,
		Перечисления.ТипыКонтактнойИнформации.Телефон, 					Истина, Ложь, Ложь, 6);
		
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда	
		КИФаксКонтрагента 	= МенеджерКонтактнойИнформации["ФаксКонтрагента"];
		КИДругаяИнформация 	= МенеджерКонтактнойИнформации["ДругаяИнформацияКонтрагента"];
	Иначе
		КИФаксКонтрагента 	= МенеджерКонтактнойИнформации.ФаксКонтрагенты;
		КИДругаяИнформация 	= МенеджерКонтактнойИнформации.ДругаяИнформацияКонтрагенты;
	КонецЕсли;
	ОбновитьВидКИ(КИФаксКонтрагента,
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Факс"), 
		Истина, Ложь, Ложь, 7);
	ОбновитьВидКИ(МенеджерКонтактнойИнформации.EmailКонтрагента,
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"),
		Истина, Ложь, Ложь, 8);
	ОбновитьВидКИ(КИДругаяИнформация,
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Другое"), 
		Истина, Ложь, Ложь, 9);
	
КонецПроцедуры

// Обновляет вид контактной информации.
//
// Параметры:
//  ВидКИ 								- Произвольный - вид контактной информации. 
//  Тип									- Произвольный - тип.
//  МожноИзменятьСпособРедактирования	- Булево - изменение способа редактирования.
//  РедактированиеТолькоВДиалоге		- Булево - возможность редактировать вне диалога.
//  АдресТолькоРоссийский				- Булево - российский адрес.
//  Порядок								- Произвольный - порядок.
//
Процедура ОбновитьВидКИ(ВидКИ, Тип, МожноИзменятьСпособРедактирования, РедактированиеТолькоВДиалоге, АдресТолькоРоссийский,	Порядок = Неопределено)

	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Тип);
	ПараметрыВида.Вид = ВидКИ;
	ПараметрыВида.Тип = Тип;
	ПараметрыВида.Порядок = Порядок;	
	ПараметрыВида.МожноИзменятьСпособРедактирования = МожноИзменятьСпособРедактирования;
	ПараметрыВида.РедактированиеТолькоВДиалоге = РедактированиеТолькоВДиалоге;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;	
	ПараметрыВида.НастройкиПроверки = ?(ТипЗнч(ПараметрыВида.НастройкиПроверки) = Тип("Структура"), ПараметрыВида.НастройкиПроверки,
		Неопределено);
	
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
КонецПроцедуры

// Заполняет реквизит Контрагент по владельцу.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура ЗаполнитьРеквизитКонтрагентПоВладельцу(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.Владелец
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Контрагент = &КонтрагентПустаяСсылка";
	Запрос.УстановитьПараметр("КонтрагентПустаяСсылка", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Контрагент = Выборка.Владелец;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры 

// Создание и обновление показателей из макета обработки упоУстановкаИндикаторов.ДанныеИндикаторов.
//
// Параметры:
//  КодыПоказателейДляОбновления - Массив, Неопределено - выборочные показатели (коды), которые необходимо обновить.
//  ТолькоНовые - Булево - признак принудительного обновления показателей. При значении ЛОЖЬ будут обновлены
//   только те показатели, которые добавлены в макете, но еще не созданы как элементы справочника Показатели.
// 
// Возвращаемое значение:
//  Булево - признак успешного выполнения.
//
Функция СоздатьНовыеПоказателиПроектовИзМакета(КодыПоказателейДляОбновления = Неопределено, ТолькоНовые = Ложь) Экспорт
	
	ЕстьУспех = Истина;
	
	ДанныеИндикаторов = Новый ТаблицаЗначений;
	Состояния = Обработки.упоУстановкаИндикаторов.Создать().Состояния.ВыгрузитьКолонки();
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДанныеИндикаторов", ДанныеИндикаторов);
	СтруктураДанных.Вставить("Состояния", Состояния);
	Обработки.упоУстановкаИндикаторов.УстановитьДанныеИндикаторов(СтруктураДанных);
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗВсеПоказателиИзМакета.Код КАК Код,
	|	ТЗВсеПоказателиИзМакета.Порядок КАК Порядок
	|ПОМЕСТИТЬ ВТВсеПоказателиИзМакета
	|ИЗ
	|	&ТЗВсеПоказателиИзМакета КАК ТЗВсеПоказателиИзМакета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеПоказателиИзМакета.Код КАК Код,
	|	ВсеПоказателиИзМакета.Порядок
	|ИЗ
	|	ВТВсеПоказателиИзМакета КАК ВсеПоказателиИзМакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упоПоказателиПроектов КАК ИндикаторыОбъектов
	|		ПО ВсеПоказателиИзМакета.Код = ИндикаторыОбъектов.ПредустановленныйКод
	|// Условие
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВсеПоказателиИзМакета.Порядок";
	
	ЭтоОбновлениеДанных = ЗначениеЗаполнено(КодыПоказателейДляОбновления) 
		И ТипЗнч(КодыПоказателейДляОбновления) = Тип("Массив");
	
	ПолучитьСуществующиеПоказатели = Истина;
	
	Если ЭтоОбновлениеДанных Тогда
		
		Условие = "ГДЕ
		|	ВсеПоказателиИзМакета.Код В (&мсКодовДляОбновления)";
		
		Запрос.УстановитьПараметр("мсКодовДляОбновления", КодыПоказателейДляОбновления);
		
	ИначеЕсли ТолькоНовые Тогда
		
		Условие = "ГДЕ
		|	ИндикаторыОбъектов.Ссылка ЕСТЬ NULL";
		
		ПолучитьСуществующиеПоказатели = Ложь;
		
	КонецЕсли;
	
	Если ПолучитьСуществующиеПоказатели Тогда
		
		ЗапросСуществующихПоказателей = Новый Запрос("Выбрать 
		|Ссылка КАК Индикатор,
		|ПредустановленныйКод КАК КодИндикатора
		|Из Справочник.упоПоказателиПроектов
		|Где Не ПредустановленныйКод = """" И Не ПометкаУдаления");
		
		ТаблицаСуществующих = ЗапросСуществующихПоказателей.Выполнить().Выгрузить();
		
	Иначе
		ТаблицаСуществующих = Неопределено;
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "// Условие", Условие);
	
	Запрос.УстановитьПараметр("ТЗВсеПоказателиИзМакета", ДанныеИндикаторов);
	
	КэшИндикаторов = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЕстьУспех = Обработки.упоУстановкаИндикаторов.УстановитьПоУмолчаниюПоказательПроекта(
				Выборка.Код, КэшИндикаторов, ДанныеИндикаторов, Состояния, ТаблицаСуществующих);
				
		Если Не ЕстьУспех Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЕстьУспех;
	
КонецФункции

// Функция заполняет уровень планирования ролей.
//
Функция ЗаполнитьУровеньПланированияРолей() Экспорт
	
	ПустоеПеречисление = Перечисления.упоУровеньПланирования.ПустаяСсылка();
	СтруктураОтбор = Новый Структура("УровеньПланирования", ПустоеПеречисление);
	
	//
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойУровеньПланирования", Перечисления.упоУровеньПланирования.ПустаяСсылка());
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоШаблоныПроектныхЗадач.Ссылка,
	               |	упоШаблоныПроектныхЗадач.ПланироватьТрудозатратыНаИсполнителей
	               |ИЗ
	               |	Справочник.упоШаблоныПроектныхЗадач.ТрудовыеРесурсы КАК упоШаблоныПроектныхЗадачТрудовыеРесурсы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоШаблоныПроектныхЗадач КАК упоШаблоныПроектныхЗадач
	               |		ПО упоШаблоныПроектныхЗадачТрудовыеРесурсы.Ссылка = упоШаблоныПроектныхЗадач.Ссылка
	               |ГДЕ
	               |	упоШаблоныПроектныхЗадачТрудовыеРесурсы.УровеньПланирования = &ПустойУровеньПланирования";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		
		СтрокиТЧ = Объект.ТрудовыеРесурсы.НайтиСтроки(СтруктураОтбор);
		
		Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
			СтрокаТЧ.УровеньПланирования = Перечисления.упоУровеньПланирования.Предварительный;		
			Если Не Объект.ПланироватьТрудозатратыНаИсполнителей Тогда
				НоваяСтрока = Объект.ТрудовыеРесурсы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный;		
			КонецЕсли;
		КонецЦикла;
		
		Объект.ДополнительныеСвойства.Вставить("упоИгнорироватьОповещения", Истина);
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();			
		
	КонецЦикла;
	
	//
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойУровеньПланирования", ПустоеПеречисление);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоДанныеПлановТрудозатратРолей.Регистратор,
	               |	ЕСТЬNULL(упоСвойстваПроектныхЗадачСрезПоследних.ПланироватьТрудозатратыНаИсполнителей, ИСТИНА) КАК ПланироватьТрудозатратыНаИсполнителей,
	               |	упоДанныеПлановТрудозатратРолей.ПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановТрудозатратРолей КАК упоДанныеПлановТрудозатратРолей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО упоДанныеПлановТрудозатратРолей.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И упоДанныеПлановТрудозатратРолей.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	               |ГДЕ
	               |	упоДанныеПлановТрудозатратРолей.УровеньПланирования = &ПустойУровеньПланирования";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Регистратор = Выборка.Регистратор;
		
		Если НЕ ЗначениеЗаполнено(Регистратор) Тогда
			Продолжить;
		КонецЕсли;		
		
		НаборЗаписей = РегистрыСведений.упоДанныеПлановТрудозатратРолей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
		НаборЗаписей.Прочитать();
		ТаблицаНабораЗаписей = НаборЗаписей.Выгрузить();
		
		СтрокиТаблицы = ТаблицаНабораЗаписей.НайтиСтроки(СтруктураОтбор);
		
		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			СтрокаТаблицы.УровеньПланирования = Перечисления.упоУровеньПланирования.Предварительный;		
			Если Не Выборка.ПланироватьТрудозатратыНаИсполнителей Тогда
				НоваяСтрока = ТаблицаНабораЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				НоваяСтрока.УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный;		
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
		НаборЗаписей.ДополнительныеСвойства.Вставить("упоИгнорироватьОповещения", Истина);
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();	
		
	КонецЦикла;			   
		
КонецФункции 

// Функция заполняет трудозатраты по уровню планирования.
//
Функция ЗаполнитьДоляТрудозатратПоУровнюПланирования() Экспорт
	
	ПустоеПеречисление = Перечисления.упоУровеньПланирования.ПустаяСсылка();
	СтруктураОтбор = Новый Структура("ДоляТрудозатратПоУровнюПланирования", ПустоеПеречисление);		
	
	//
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойУровеньПланирования", ПустоеПеречисление);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоВыделенныеТрудовыеРесурсы.Регистратор
	               |ИЗ
	               |	РегистрСведений.упоВыделенныеТрудовыеРесурсы КАК упоВыделенныеТрудовыеРесурсы
	               |ГДЕ
	               |	упоВыделенныеТрудовыеРесурсы.ДоляТрудозатратПоУровнюПланирования = &ПустойУровеньПланирования";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Регистратор = Выборка.Регистратор;
		
		Если НЕ ЗначениеЗаполнено(Регистратор) Тогда
			Продолжить;
		КонецЕсли;		
		
		НаборЗаписей = РегистрыСведений.упоВыделенныеТрудовыеРесурсы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
		НаборЗаписей.Прочитать();
		ТаблицаНабораЗаписей = НаборЗаписей.Выгрузить();
		
		СтрокиТаблицы = ТаблицаНабораЗаписей.НайтиСтроки(СтруктураОтбор);
		
		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			СтрокаТаблицы.ДоляТрудозатратПоУровнюПланирования = Перечисления.упоУровеньПланирования.Предварительный;		
		КонецЦикла;
		
		НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
		НаборЗаписей.ДополнительныеСвойства.Вставить("упоИгнорироватьОповещения", Истина);
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();	
		
	КонецЦикла;	
	
	//
	
	ПустойВариантРаспределения = Перечисления.упоВариантыРаспределенияТрудозатрат.ПустаяСсылка();
	СтруктураОтбор = Новый Структура("ВариантРаспределения", ПустойВариантРаспределения);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойВариантРаспределения", ПустойВариантРаспределения);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоВыделенныеТрудовыеРесурсы.Регистратор
	               |ИЗ
	               |	РегистрСведений.упоВыделенныеТрудовыеРесурсы КАК упоВыделенныеТрудовыеРесурсы
	               |ГДЕ
	               |	упоВыделенныеТрудовыеРесурсы.ВариантРаспределения = &ПустойВариантРаспределения";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Регистратор = Выборка.Регистратор;
		
		Если НЕ ЗначениеЗаполнено(Регистратор) Тогда
			Продолжить;
		КонецЕсли;		
		
		НаборЗаписей = РегистрыСведений.упоВыделенныеТрудовыеРесурсы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
		НаборЗаписей.Прочитать();
		ТаблицаНабораЗаписей = НаборЗаписей.Выгрузить();
		
		СтрокиТаблицы = ТаблицаНабораЗаписей.НайтиСтроки(СтруктураОтбор);
		
		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			СтрокаТаблицы.ВариантРаспределения = Перечисления.упоВариантыРаспределенияТрудозатрат.ПоДолеТрудозатрат;		
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДоляТрудозатрат) Тогда
				СтрокаТаблицы.ДоляТрудозатрат = 100;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
		НаборЗаписей.ДополнительныеСвойства.Вставить("упоИгнорироватьОповещения", Истина);
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();	
		
	КонецЦикла;	
		
КонецФункции 

// Функция синхронизирует подразделение и структуру предприятия
//
Функция СинхронизироватьПодразделениеИСтруктуруПредприятия() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСоответствиеПодразделенийИСтруктурыПредприятия.СтруктураПредприятия
	               |ИЗ
	               |	РегистрСведений.упоСоответствиеПодразделенийИСтруктурыПредприятия КАК упоСоответствиеПодразделенийИСтруктурыПредприятия";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			упоИнтеграция.СинхронизироватьПодразделениеИСтруктуруПредприятия(Выборка.СтруктураПредприятия, Истина);
		КонецЦикла;
	КонецЕсли;	
				   	
КонецФункции	

Функция ЗаполнитьРегистрыЗатратРесурсовФакт() Экспорт
	
	ВызватьИсключение ТекстОграниченияПереходаНаВерсию("4.2.8.1");
		
КонецФункции 

Функция ЗаполнитьРегистрыЗатратРесурсовПлан() Экспорт
		
	ВызватьИсключение ТекстОграниченияПереходаНаВерсию("4.2.8.1");
	
КонецФункции 

Функция ЗаполнитьКонтрагентовВДоговорах() Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Владелец КАК Владелец,
	               |	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ЕСТЬNULL(ДоговорыКонтрагентов.Владелец, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	И ЕСТЬNULL(ДоговорыКонтрагентов.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	ТаблицаДоговоров = Запрос.Выполнить();
	
	Если НЕ ТаблицаДоговоров.Пустой() Тогда
		
		Выборка = ТаблицаДоговоров.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДоговорДляЗаполнения = Выборка.Ссылка.ПолучитьОбъект();
			ДоговорДляЗаполнения.Контрагент = ДоговорДляЗаполнения.Владелец;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДоговорДляЗаполнения);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция КорректироватьПоказателиПроектов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоПоказателиПроектов.Ссылка КАК Ссылка,
	               |	упоПоказателиПроектов.Наименование КАК Наименование,
	               |	упоПоказателиПроектов.ПредустановленныйКод КАК ПредустановленныйКод
	               |ИЗ
	               |	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	               |ГДЕ
	               |	упоПоказателиПроектов.ПредустановленныйКод В (""ПроцентТрудозатратКоличество"", ""ПроцентТрудозатратСтоимость"")
	               |	И НЕ упоПоказателиПроектов.ПометкаУдаления";
				   
	ТаблицаРедактируемых = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаПоказателя Из ТаблицаРедактируемых Цикл
		
		Если СтрНайти(ВРег(СтрокаПоказателя.Наименование), "НЕ ИСПОЛЬЗУЕТСЯ") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПоказательСсылка = СтрокаПоказателя.Ссылка;
		ПоказательОбъект = ПоказательСсылка.ПолучитьОбъект();
		ПоказательОбъект.Наименование = НСтр("ru = '(не используется) '") + ПоказательОбъект.Наименование;
		ПоказательОбъект.ПолноеНаименование = НСтр("ru = '(не используется) '") + ПоказательОбъект.ПолноеНаименование;
		ПредустановленныйКод = ВРег(СокрЛП(СтрокаПоказателя.ПредустановленныйКод));
		Если ПредустановленныйКод = ВРег("ПроцентТрудозатратКоличество") Тогда
			СтрОписание = НСтр("ru = 'Данный показатель устарел и может считаться некорректно.
                                |Вместо него необходимо испольовать показатели ""% Трудозатрат (Количество) предв. уровень"" и ""% Трудозатрат (Количество) оконч. уровень"".'");
		ИначеЕсли ПредустановленныйКод = ВРег("ПроцентТрудозатратСтоимость") Тогда
			СтрОписание = НСтр("ru = 'Данный показатель устарел и может считаться некорректно.
                                |Вместо него необходимо испольовать показатели ""% Трудозатрат (Стоимость) предв. уровень"" и ""% Трудозатрат (Стоимость) оконч. уровень"".'");
		КонецЕсли;
		ПоказательОбъект.ОписаниеПоказателя = СтрОписание;
		ПоказательОбъект.Комментарий = НСтр("ru = 'Данный показатель не использовать.'");
		ПоказательОбъект.Записать();
		
	КонецЦикла;
	
КонецФункции 

Функция ЗаполнитьПолеПодчиненныйПроект() Экспорт
	
	ТекСостояние_упоОтключитьПроверкуОграничений = ПараметрыСеанса.упоОтключитьПроверкуОграничений;
	ТекСостояние_упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов = ПараметрыСеанса.упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов;
	
	ПараметрыСеанса.упоОтключитьПроверкуОграничений = Истина;
	ПараметрыСеанса.упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов = Истина;
	
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоПроектнаяЗадача.Ссылка,
	               |	упоПроектнаяЗадача.ПодчиненныйПроект
	               |ПОМЕСТИТЬ ПроектныеЗадачи
	               |ИЗ
	               |	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	               |ГДЕ
	               |	упоПроектнаяЗадача.ПодчиненныйПроект <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСвойстваПроектныхЗадач.Регистратор,
	               |	упоСвойстваПроектныхЗадач.ПроектнаяЗадача,
	               |	ПроектныеЗадачи.ПодчиненныйПроект
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач КАК упоСвойстваПроектныхЗадач
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПроектныеЗадачи КАК ПроектныеЗадачи
	               |		ПО упоСвойстваПроектныхЗадач.ПроектнаяЗадача = ПроектныеЗадачи.Ссылка
	               |ГДЕ
	               |	упоСвойстваПроектныхЗадач.ПодчиненныйПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.упоСвойстваПроектныхЗадач.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Если НЕ Запись.ПроектнаяЗадача = Выборка.ПроектнаяЗадача Тогда
				Продолжить;
			КонецЕсли;
			Запись.ПодчиненныйПроект = Выборка.ПодчиненныйПроект;
		КонецЦикла;
		Если НаборЗаписей.Модифицированность() Тогда
			НаборЗаписей.ДополнительныеСвойства.Вставить("упоИгнорироватьОповещения", Истина);
			НаборЗаписей.Записать();
		КонецЕсли;
		Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.упоСохранениеДанныхПроекта") Тогда
			РегистраторОбъект = Выборка.Регистратор.ПолучитьОбъект();
			Для Каждого СтрокаТЧ Из РегистраторОбъект.ПроектныеЗадачи Цикл
				Если НЕ СтрокаТЧ.ПроектнаяЗадача = Выборка.ПроектнаяЗадача Тогда
					Продолжить;
				КонецЕсли;
				СтрокаТЧ.ПодчиненныйПроект = Выборка.ПодчиненныйПроект;	
			КонецЦикла;
			Если РегистраторОбъект.Модифицированность() Тогда
				РегистраторОбъект.ДополнительныеСвойства.Вставить("упоИгнорироватьОповещения", Истина);
				РегистраторОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДатуДокумента", Истина);
				РегистраторОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//
	
	ПараметрыСеанса.упоОтключитьПроверкуОграничений = ТекСостояние_упоОтключитьПроверкуОграничений;
	ПараметрыСеанса.упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов = ТекСостояние_упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов;	
	
КонецФункции 

Процедура ЗаполнитьУровеньПланированияДокуПрогнозТрудозатратПоРолям() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоПрогнозТрудозатратПоРолям.Ссылка
	               |ИЗ
	               |	Документ.упоПрогнозТрудозатратПоРолям КАК упоПрогнозТрудозатратПоРолям";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ ЗначениеЗаполнено(ДокОбъект.УровеньПланированияРолей) Тогда
			ДокОбъект.УровеньПланированияРолей = Перечисления.упоУровеньПланирования.Предварительный;
			ДокОбъект.АктуализироватьПланПоФактическимДанным = Истина;
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;				
	КонецЦикла;
	
КонецПроцедуры

// Исправляет показатели в настройках структуры проекта.
//
Процедура ИсправитьПоказателиВНастройкахСтруктурыПроекта() Экспорт
	
	// Настройки обработки без детализации по проектам.
	КлючОбъекта = "Обработка.упоУпрощенныйВводСтруктурыПроекта";
	Отбор = Новый Структура("КлючОбъекта", КлючОбъекта);
	Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
	Пока Выборка.Следующий() Цикл
		РедактироватьНастройкуСтруктурыПроекта(
			Выборка.КлючОбъекта, Выборка.КлючНастроек, Выборка.Настройки, Выборка.Представление, Выборка.Пользователь);
	КонецЦикла;
	
	// Настройки по умолчанию по проектам.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.Ссылка
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	НЕ Проекты.ПометкаУдаления
	               |	И НЕ Проекты.ЭтоПроектнаяЗадача";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПроекты = Результат.Выбрать();
	Пока ВыборкаПроекты.Следующий() Цикл
		
		ЗагружаемыеНастройки = Неопределено;
		
		СсылкаНаПроект = ВыборкаПроекты.Ссылка;
		
		// Сначала ищем сохраненную настройку по ИД, если не находим, то ищем по коду.
		МассивСуффиксовКлючейОбъекта = Новый Массив;
		МассивСуффиксовКлючейОбъекта.Добавить("" + СокрЛП(СсылкаНаПроект.УникальныйИдентификатор()));
		МассивСуффиксовКлючейОбъекта.Добавить("" + СокрЛП(СсылкаНаПроект.Код));
		Для каждого СуффиксКлючаОбъекта Из МассивСуффиксовКлючейОбъекта Цикл
			
			КлючОбъекта = "Обработка.упоУпрощенныйВводСтруктурыПроекта" + СокрЛП(СуффиксКлючаОбъекта); // Настройка для конкретного проекта
			Отбор = Новый Структура("КлючОбъекта", КлючОбъекта);
			
			Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
			Пока Выборка.Следующий() Цикл
				РедактироватьНастройкуСтруктурыПроекта(
			Выборка.КлючОбъекта, Выборка.КлючНастроек, Выборка.Настройки, Выборка.Представление, Выборка.Пользователь);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереименоватьКолонкиСтруктуры4248() Экспорт
	
	СтруктураПереименования = Новый Структура;
	
	СтруктураПереименования.Вставить("Задача", "НазваниеЗадачи");
	СтруктураПереименования.Вставить("ЕдиницаИзмеренияВБазе", "База_ЕдиницаИзмерения");
	СтруктураПереименования.Вставить("КодСДРВБазе", "База_КодСДР");
	СтруктураПереименования.Вставить("ДатаНачалаТекущая", "База_ДатаНачала");
	СтруктураПереименования.Вставить("ДатаЗавершенияТекущая", "База_ДатаЗавершения");
	СтруктураПереименования.Вставить("РучнойВводСроковТекущее", "База_РучнойВводСроков");
	СтруктураПереименования.Вставить("ДлительностьТекущая", "База_Длительность");
	СтруктураПереименования.Вставить("НазваниеЗадачиТекущее", "База_НазваниеЗадачи");
	СтруктураПереименования.Вставить("ЗадачаРодительТекущая", "База_ЗадачаРодитель");
	СтруктураПереименования.Вставить("ВидОперацииТекущий", "База_ВидОперации");
	СтруктураПереименования.Вставить("СтатусТекущий", "База_Статус");
	СтруктураПереименования.Вставить("ПроцентГотовностиТекущий", "База_ПроцентГотовности");
	СтруктураПереименования.Вставить("ЭтоМодельПакетаРаботТекущее", "База_ЭтоМодельПакетаРабот");
	СтруктураПереименования.Вставить("ЭтоПакетРаботТекущее", "База_ЭтоПакетРабот");
	СтруктураПереименования.Вставить("ЭтоВехаТекущее", "База_ЭтоВеха");
	СтруктураПереименования.Вставить("ДатаНачалаФактТекущая", "База_ДатаНачалаФакт");
	СтруктураПереименования.Вставить("ДатаЗавершенияФактТекущая", "База_ДатаЗавершенияФакт");
	СтруктураПереименования.Вставить("КритерийРезультатаТекущее", "База_КритерийРезультата");
	СтруктураПереименования.Вставить("НормаСтоимостиТрудовыхРесурсовТекущая", "База_НормаСтоимостиТрудовыхРесурсов");
	СтруктураПереименования.Вставить("ОписаниеРезультатаТекущее", "База_ОписаниеРезультата");
	СтруктураПереименования.Вставить("КалендарьЗадачиТекущий", "База_КалендарьЗадачи");
	СтруктураПереименования.Вставить("ДлительностьБезУчетаКалендаряПроектаТекущее", "База_ДлительностьБезУчетаКалендаряПроекта");
	СтруктураПереименования.Вставить("ПодчиненныйПроектТекущий", "База_ПодчиненныйПроект");
	СтруктураПереименования.Вставить("ДатаРаннегоСтартаТекущая", "База_РаннийСтарт");
	СтруктураПереименования.Вставить("ДатаПозднегоСтартаТекущая", "База_ПозднийСтарт");
	СтруктураПереименования.Вставить("ДатаРаннегоФинишаТекущая", "База_РаннийФиниш");
	СтруктураПереименования.Вставить("ДатаПозднегоФинишаТекущая", "База_ПозднийФиниш");
	
	упоСтруктураПроекта.ПереименоватьКолонкиВСохраненныхНастройкахСтруктуры(СтруктураПереименования);

КонецПроцедуры

Процедура ОбновитьНастройкиПользователейПанелиПоказателей() Экспорт
	
	КлючОбъекта = "Обработка.упоПанельПоказателей";
	
	СписокПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Для Каждого Пользователь Из СписокПольЗователей Цикл
		
		ИмяПользователя = Пользователь.Имя;
		
		Отбор = Новый Структура("КлючОбъекта", КлючОбъекта);
		Отбор.Вставить("Пользователь", ИмяПользователя());
		
		Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
		
		Пока Выборка.Следующий() Цикл
			
			Если Найти(Выборка.КлючНастроек, "НастройкиОбработки") <> 0 Тогда
				
				Настройка = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, Выборка.КлючНастроек,, ИмяПользователя); 
				
				Если ТипЗнч(Настройка) = Тип("Структура") И Настройка.Свойство("НастройкиКомпоновщика") Тогда
					
					ОписаниеНастройки = ХранилищеОбщихНастроек.ПолучитьОписание(КлючОбъекта, Выборка.КлючНастроек, ИмяПользователя);
					упоПанельПоказателейВызовСервера.ЗаполнитьОтборПоКомпоненту(Настройка.НастройкиКомпоновщика);
					ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, Выборка.КлючНастроек, Настройка, ОписаниеНастройки, ИмяПользователя);
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьПроектСтруктуры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упоПрограммыПроектов.Ссылка
		|ИЗ
		|	Справочник.упоПрограммыПроектов КАК упоПрограммыПроектов
		|ГДЕ
		|	упоПрограммыПроектов.ПроектСтруктуры = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СсылкаНаПрограмму = ВыборкаДетальныеЗаписи.Ссылка;
		ПрограммаПроектовОбъект = СсылкаНаПрограмму.ПолучитьОбъект();
		
		НовыйПроект = Справочники.Проекты.СоздатьЭлемент();
		НовыйПроект.Наименование = СсылкаНаПрограмму.Наименование;
		НовыйПроект.ПометкаУдаления = СсылкаНаПрограмму.ПометкаУдаления;
		НовыйПроект.Заполнить(СсылкаНаПрограмму);
		
		НовыйПроект.Записать();    			
		
		ПрограммаПроектовОбъект.ПроектСтруктуры = НовыйПроект.Ссылка;
		ПрограммаПроектовОбъект.Записать();
		
	КонецЦикла;
				
КонецПроцедуры

Процедура ПереносПользователейВНовыеГруппыУдалениеСтарыхРолейИзПрофилей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГруппыДоступаНовые.Ссылка КАК ГруппаДоступаНовая,
	               |	ПользователиГруппДоступа.Пользователь КАК ПользователиГруппыПользователей,
	               |	Профили.Ссылка КАК ПрофильТекущий,
	               |	РолиПрофилей.Роль КАК РольКакОбъктМД_НаУдалениеИзТекущегоПрофиля
	               |ИЗ
	               |	Справочник.ГруппыДоступа КАК ГруппыДоступа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ПользователиГруппДоступа
	               |		ПО (ПользователиГруппДоступа.Ссылка = ГруппыДоступа.Ссылка)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа КАК Профили
	               |		ПО ГруппыДоступа.Профиль = Профили.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК РолиПрофилей
	               |		ПО (Профили.Ссылка = РолиПрофилей.Ссылка)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МД.Ссылка КАК Ссылка,
	               |			МД.Имя КАК Имя
	               |		ИЗ
	               |			Справочник.ИдентификаторыОбъектовМетаданных КАК МД
	               |		ГДЕ
	               |			МД.Имя В (""? упоАдминистраторПроектногоОфиса"", ""? упоИсполнительРабот"", ""? упоИсполнительРаботБезФинансов"", ""? упоРуководительПроектногоОфиса"", ""? упоРуководительПроектовПодразделений"", ""? упоРуководительПроектовПодразделенийБезФинансов"", ""? упоФинансистПроектногоОфиса"")
	               |			И МД.ПометкаУдаления) КАК ИскомыеРоли
	               |		ПО (ИскомыеРоли.Ссылка = РолиПрофилей.Роль)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступаНовые
	               |		ПО (ГруппыДоступаНовые.Профиль = ВЫБОР
	               |				КОГДА ИскомыеРоли.Имя = ""? упоАдминистраторПроектногоОфиса""
	               |					ТОГДА ЗНАЧЕНИЕ(Справочник.ПрофилиГруппДоступа.упоАдминистраторПроектногоОфиса)
	               |				КОГДА ИскомыеРоли.Имя = ""? упоИсполнительРабот""
	               |					ТОГДА ЗНАЧЕНИЕ(Справочник.ПрофилиГруппДоступа.упоИсполнительРаботБезФинансов)
	               |				КОГДА ИскомыеРоли.Имя = ""? упоИсполнительРаботБезФинансов""
	               |					ТОГДА ЗНАЧЕНИЕ(Справочник.ПрофилиГруппДоступа.упоИсполнительРаботБезФинансов)
	               |				КОГДА ИскомыеРоли.Имя = ""? упоРуководительПроектногоОфиса""
	               |					ТОГДА ЗНАЧЕНИЕ(Справочник.ПрофилиГруппДоступа.упоРуководительПроектногоОфиса)
	               |				КОГДА ИскомыеРоли.Имя = ""? упоРуководительПроектовПодразделений""
	               |					ТОГДА ЗНАЧЕНИЕ(Справочник.ПрофилиГруппДоступа.упоРуководительПроектовПодразделений)
	               |				КОГДА ИскомыеРоли.Имя = ""? упоРуководительПроектовПодразделенийБезФинансов""
	               |					ТОГДА ЗНАЧЕНИЕ(Справочник.ПрофилиГруппДоступа.упоРуководительПроектовПодразделенийБезФинансов)
	               |				КОГДА ИскомыеРоли.Имя = ""? упоФинансистПроектногоОфиса""
	               |					ТОГДА ЗНАЧЕНИЕ(Справочник.ПрофилиГруппДоступа.упоФинансистПроектногоОфиса)
	               |			КОНЕЦ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГруппыДоступаНовые.Ссылка";
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКорректируемыхДанных = Результат.Выгрузить();
	
	ГруппыДоступаНовые = ТаблицаКорректируемыхДанных.Скопировать(, "ГруппаДоступаНовая");
	ГруппыДоступаНовые.Свернуть("ГруппаДоступаНовая");
	
	// Соберем объекты, чтоб позже записать.
	МассивНовыхГрупп = Новый Массив;
	
	ЗаписатьИзмененияВНовойГруппе = Ложь;
	Для Каждого СтрТЗ Из ГруппыДоступаНовые Цикл
		
		НоваяГруппа = СтрТЗ.ГруппаДоступаНовая;
		Если НЕ ЗначениеЗаполнено(НоваяГруппа) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяГруппаОбъект = НоваяГруппа.ПолучитьОбъект();
		
		СтруктураОтбораДанныхГруппы = Новый Структура("ГруппаДоступаНовая", НоваяГруппа);
		СтрокиНовойГруппы = ТаблицаКорректируемыхДанных.НайтиСтроки(СтруктураОтбораДанныхГруппы);
		Для Каждого ДанныеГруппы Из СтрокиНовойГруппы Цикл
			
			ПользовательГруппыДоступа = ДанныеГруппы.ПользователиГруппыПользователей;
			
			Если НЕ ЗначениеЗаполнено(ПользовательГруппыДоступа) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НоваяГруппаОбъект.Пользователи.Найти(ПользовательГруппыДоступа) = Неопределено Тогда
				
				НС = НоваяГруппаОбъект.Пользователи.Добавить();
				НС.Пользователь = ПользовательГруппыДоступа;
				
				ЗаписатьИзмененияВНовойГруппе = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
			
		Если МассивНовыхГрупп.Найти(НоваяГруппаОбъект) = Неопределено Тогда
			МассивНовыхГрупп.Добавить(НоваяГруппаОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
	// Удалим из профилей старые роли.
	РедактируемыеПрофили = ТаблицаКорректируемыхДанных.Скопировать(, "ПрофильТекущий");
	РедактируемыеПрофили.Свернуть("ПрофильТекущий");
	
	ПрофилиРоли = ТаблицаКорректируемыхДанных.Скопировать(, "ПрофильТекущий, РольКакОбъктМД_НаУдалениеИзТекущегоПрофиля");
	ПрофилиРоли.Свернуть("ПрофильТекущий, РольКакОбъктМД_НаУдалениеИзТекущегоПрофиля");
	
	МассивПрофилей = Новый Массив;
	
	ЗаписатьИзмененияВПрофилях = Ложь;
	Для Каждого СтрПрофиля Из РедактируемыеПрофили Цикл
		
		ТекПрофильСсылка = СтрПрофиля.ПрофильТекущий;
		Если НЕ ЗначениеЗаполнено(ТекПрофильСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ИскомыеСтрокиСРолямиПрофиля = ПрофилиРоли.НайтиСтроки(Новый Структура("ПрофильТекущий", ТекПрофильСсылка));
				
		ТекПрофильОбъект = ТекПрофильСсылка.ПолучитьОбъект();
		Для Каждого СтрокаПрофиляСРолью Из ИскомыеСтрокиСРолямиПрофиля Цикл
			
			РольПрофиля = СтрокаПрофиляСРолью.РольКакОбъктМД_НаУдалениеИзТекущегоПрофиля;
			Если НЕ ЗначениеЗаполнено(РольПрофиля) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаУдаляемая = ТекПрофильОбъект.Роли.Найти(СтрокаПрофиляСРолью.РольКакОбъктМД_НаУдалениеИзТекущегоПрофиля, "Роль");
			Если СтрокаУдаляемая = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТекПрофильОбъект.Роли.Удалить(СтрокаУдаляемая);
			
			ЗаписатьИзмененияВПрофилях = Истина;
			
		КонецЦикла;
		
		Если МассивПрофилей.Найти(ТекПрофильОбъект) = Неопределено Тогда
			МассивПрофилей.Добавить(ТекПрофильОбъект);
		КонецЕсли;
				
	КонецЦикла;
	
	// Записать в правильном порядке.
	
	Если ЗаписатьИзмененияВПрофилях Тогда 
		Для Каждого ЭлПрофиль Из МассивПрофилей Цикл
			ЭлПрофиль.Записать();
		КонецЦикла;
	КонецЕсли;
	
	Если ЗаписатьИзмененияВНовойГруппе Тогда 
		Для Каждого ЭлГруппа Из МассивНовыхГрупп Цикл
			ЭлГруппа.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры 

Функция ИсправитьДвиженияДРПоПодразделениям() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма) КАК Сумма,
	               |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	СУММА(упоАктуальныеПланыДоходовИРасходовСрезПоследних.СуммаВалютная) КАК СуммаВалютная,
	               |	упоВерсииПроекта.Версия
	               |ПОМЕСТИТЬ ДанныеДР
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыДоходовИРасходов.СрезПоследних КАК упоАктуальныеПланыДоходовИРасходовСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоАктуальныеПланыДоходовИРасходовСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача,
	               |	упоВерсииПроекта.Версия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма КАК Сумма,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная КАК СуммаВалютная,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоВерсииПроектаПодр.Версия
	               |ПОМЕСТИТЬ ДанныеДР_Подразделения
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроектаПодр
	               |		ПО упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Версия = упоВерсииПроектаПодр.Версия
	               |			И (упоВерсииПроектаПодр.Текущая)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеДР.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ДанныеДР.Сумма КАК Сумма,
	               |	0 КАК СуммаПодр,
	               |	ДанныеДР.СуммаВалютная КАК СуммаВалютная,
	               |	0 КАК СуммаВалютнаяПодр,
	               |	ДанныеДР.Версия
	               |ПОМЕСТИТЬ ОбъединениеДР
	               |ИЗ
	               |	ДанныеДР КАК ДанныеДР
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДанныеДР_Подразделения.ПроектнаяЗадача,
	               |	0,
	               |	ДанныеДР_Подразделения.Сумма,
	               |	0,
	               |	ДанныеДР_Подразделения.СуммаВалютная,
	               |	ДанныеДР_Подразделения.Версия
	               |ИЗ
	               |	ДанныеДР_Подразделения КАК ДанныеДР_Подразделения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъединениеДР.ПроектнаяЗадача.Проект КАК Проект,
	               |	ОбъединениеДР.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	СУММА(ОбъединениеДР.Сумма) КАК Сумма,
	               |	СУММА(ОбъединениеДР.СуммаПодр) КАК СуммаПодр,
	               |	СУММА(ОбъединениеДР.СуммаВалютная) КАК СуммаВалютная,
	               |	СУММА(ОбъединениеДР.СуммаВалютнаяПодр) КАК СуммаВалютнаяПодр,
	               |	ОбъединениеДР.Версия
	               |ПОМЕСТИТЬ Проблемные
	               |ИЗ
	               |	ОбъединениеДР КАК ОбъединениеДР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОбъединениеДР.ПроектнаяЗадача,
	               |	ОбъединениеДР.ПроектнаяЗадача.Проект,
	               |	ОбъединениеДР.Версия
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ОбъединениеДР.СуммаВалютная) <> СУММА(ОбъединениеДР.СуммаВалютнаяПодр)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Проблемные.Проект КАК Проект,
	               |	Проблемные.Проект.КонтрагентДоходов КАК КонтрагентДоходов,
	               |	Проблемные.Проект.ДоговорДоходов КАК ДоговорДоходов,
	               |	Проблемные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Проблемные.Сумма КАК Сумма,
	               |	Проблемные.СуммаПодр КАК СуммаПодр,
	               |	Проблемные.СуммаВалютная КАК СуммаВалютная,
	               |	Проблемные.СуммаВалютнаяПодр КАК СуммаВалютнаяПодр,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи,
	               |	упоСтатусыПроектовСрезПоследних.СтатусПроекта,
	               |	ЕСТЬNULL(упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаПлан,
	               |	ЕСТЬNULL(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗавершенияПлан,
	               |	Проблемные.Версия
	               |ИЗ
	               |	Проблемные КАК Проблемные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |		ПО Проблемные.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних КАК упоСтатусыПроектовСрезПоследних
	               |		ПО Проблемные.Проект = упоСтатусыПроектовСрезПоследних.Проект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК упоСрокиПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоСрокиПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |		ПО Проблемные.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекСостояние_упоОтключитьПроверкуОграничений = ПараметрыСеанса.упоОтключитьПроверкуОграничений;
	ТекСостояние_упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов = ПараметрыСеанса.упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов;
	
	ПараметрыСеанса.упоОтключитьПроверкуОграничений = Истина;
	ПараметрыСеанса.упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов = Истина;
	
	Ошибки = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		ЗадачаСсылка = Выборка.ПроектнаяЗадача;
		Проект = Выборка.Проект;
		
		Календарь = упоПроектыИЗадачиВызовСервера.обПолучитьКалендариПроекта(Проект);
		
		СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
			
		СвойстваПроведения = Новый Структура;
		СвойстваПроведения.Вставить("Проект", Проект);
		СвойстваПроведения.Вставить("Версия", Выборка.Версия);
		СвойстваПроведения.Вставить("ПроектнаяЗадача", ЗадачаСсылка);
		СвойстваПроведения.Вставить("НачДата", Выборка.ДатаНачалаПлан);
		СвойстваПроведения.Вставить("КонДата", Выборка.ДатаЗавершенияПлан);
		СвойстваПроведения.Вставить("Календарь", Календарь);
		СвойстваПроведения.Вставить("КонтрагентЗатрат", Выборка.КонтрагентДоходов);
		СвойстваПроведения.Вставить("ДоговорЗатрат", Выборка.ДоговорДоходов);
		
		упоАналитикаПоПодразделениямСервер.ЗаполнитьОбщиеНастройкиУчетаПоПодразделениям(ЗадачаСсылка, СвойстваПроведения);

		Движения = Новый Структура;
		
		НаборЗаписей = РегистрыСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЗадачаСсылка);
		
		ТаблицаДвижений = НаборЗаписей.Выгрузить();
		
		Движения.Вставить("упоАктуальныеПланыДоходовИРасходовПодразделения", ТаблицаДвижений);
		
		упоАналитикаПоПодразделениямСервер.ЗаполнитьДвиженияПланДоходовИРасходов(Неопределено,
			Движения,
			СвойстваПроекта,
			СвойстваПроведения,
			Ложь);
		
		ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
		ТаблицаДвижений.ЗаполнитьЗначения(ТекущаяДата(), "Период");
		ТаблицаДвижений.ЗаполнитьЗначения(ЗадачаСсылка, "Регистратор");
		
		НаборЗаписей.Загрузить(Движения.упоАктуальныеПланыДоходовИРасходовПодразделения);
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"",ТекстОшибки,"");
		КонецПопытки;
		
	КонецЦикла;	
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	ПараметрыСеанса.упоОтключитьПроверкуОграничений = ТекСостояние_упоОтключитьПроверкуОграничений;
	ПараметрыСеанса.упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов = ТекСостояние_упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов;
	
КонецФункции 

Функция ПереименоватьПрофильБазовыеПраваPM() Экспорт
	
	Профиль = Справочники.ПрофилиГруппДоступа.упоОсобыеПраваНаОповещения.ПолучитьОбъект();
	Профиль.Наименование = "Особые права на оповещения";
	Профиль.Записать();
	
КонецФункции

Процедура ИсправитьРасписаниеОтраженияТрудозатрат() Экспорт
		
	Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.упоОтражениеПлановыхТрудозатратЗадач);
	Расписание = Задание.Расписание;
	
	НужноЗаписать = Ложь;
	
	Если Расписание.ПериодПовтораДней = 0 Тогда
		Расписание.ПериодПовтораДней = 1;
		НужноЗаписать = Истина;		
	КонецЕсли;
	
	Если Расписание.ПериодПовтораВТечениеДня = 0 Тогда
		Расписание.ПериодПовтораВТечениеДня = 60;
		НужноЗаписать = Истина;		
	КонецЕсли;
	
	Если НужноЗаписать Тогда
		Задание.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ИсправитьОписаниеПоказателя() Экспорт
	
	ПроцентВыплат = Справочники.упоПоказателиПроектов.НайтиПоНаименованию("% Выплат");
	Описание = НСтр("ru = 'Вычисляется как отношение фактических выплат к плановым.'");
	Если ЗначениеЗаполнено(ПроцентВыплат) И СокрЛП(ПроцентВыплат.ОписаниеПоказателя) = Описание Тогда
		ПроцентВыплат = ПроцентВыплат.ПолучитьОбъект();
		ПроцентВыплат.ОписаниеПоказателя = НСтр("ru = '% отклонения фактических выплат ДС от плановых.'");
		ПроцентВыплат.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеренестиРаспределениеПлановыхТрудозатратВНовыеРегистры() Экспорт
	
	ВызватьИсключение ТекстОграниченияПереходаНаВерсию("4.2.8.1"); 
	
КонецПроцедуры

Процедура ЗаполнитьНастройкуУровняПланированияПриРасчетеГотовностиПроектов(Параметры = Неопределено) Экспорт
		
	Константы.упоНастройкаУровняПланированияПриРасчетеГотовностиПроектов.Установить(Перечисления.упоУровеньПланирования.Предварительный);
		
КонецПроцедуры

Процедура ПеренестиОчередьРаспределенияПлановыхТрудозатрат() Экспорт
	
	ВызватьИсключение ТекстОграниченияПереходаНаВерсию("4.2.8.1"); 
	
КонецПроцедуры

Функция ТекстОграниченияПереходаНаВерсию(МожноОбновитьсяПоВерсию) 
	Текст = НСтр("ru = 'Невозможно перейти на версию подсистемы PM боллее %1'");	
	Возврат СтрШаблон(Текст, МожноОбновитьсяПоВерсию);
КонецФункции

Процедура ЗаполнитьПроектСтруктурыВПортфеляхИПрограммах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоПрограммыПроектов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.упоПрограммыПроектов КАК упоПрограммыПроектов
	               |ГДЕ
	               |	упоПрограммыПроектов.ПроектСтруктуры = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоПортфелиПроектов.Ссылка
	               |ИЗ
	               |	Справочник.упоПортфелиПроектов КАК упоПортфелиПроектов
	               |ГДЕ
	               |	упоПортфелиПроектов.ПроектСтруктуры = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";
				   		
	Результат = Запрос.Выполнить();	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПортфельПрограмма = Выборка.Ссылка.ПолучитьОбъект();
		ПортфельПрограмма.Записать();
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбновлениеПользовательскихНастроекОперативнаяЗагрузкаСпециалистов() Экспорт
	
	КлючОбъекта = "Обработка.упоОперативнаяЗагрузкаСпециалистов";
	КлючНастроек = "НастройкиОбработки";
	Отбор = Новый Структура("КлючОбъекта", КлючОбъекта);
	ПолеКомпановкиРуководительПроекта = Новый ПолеКомпоновкиДанных("РуководительПроекта");
	ПолеКомпановкиСтатусЗадачи = Новый ПолеКомпоновкиДанных("СтатусЗадачи");
	ПолеКомпановкиСтатусПроекта = Новый ПолеКомпоновкиДанных("СтатусПроекта");
	
	Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
	Пока Выборка.Следующий() Цикл
		Если Найти(Выборка.КлючНастроек, КлючНастроек) <> 0 Тогда
			Настройки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, Выборка.КлючНастроек, , Выборка.Пользователь);
			Если ТипЗнч(Настройки) = Тип("Структура") И Настройки.Свойство("СКД_ОтборСпециалистов") Тогда
				мУдалить = Новый Массив;
				ЭлементыОтбораСпециалистов = Настройки.СКД_ОтборЗадач.Отбор.Элементы;	
				Для Каждого ЭлементОтбора Из ЭлементыОтбораСпециалистов Цикл
					Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпановкиРуководительПроекта
						ИЛИ ЭлементОтбора.ЛевоеЗначение = ПолеКомпановкиСтатусЗадачи
						ИЛИ ЭлементОтбора.ЛевоеЗначение = ПолеКомпановкиСтатусПроекта Тогда
						
						мУдалить.Добавить(ЭлементОтбора);
					КонецЕсли;	
				КонецЦикла;
				Для Каждого ЭлементМассива Из мУдалить Цикл
					ЭлементыОтбораСпециалистов.Удалить(ЭлементМассива);
				КонецЦикла;	
				ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, Выборка.КлючНастроек, Настройки, Выборка.Пользователь);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбновлениеИспользованияРегламентногоЗаданияупоПересчетОграниченийДоступаПоПроектам() Экспорт
	
	ПараметрыЗадания = Новый Структура("Использование", ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписей"));
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.упоПересчетОграниченийДоступаПоПроектам);
	РегламентныеЗаданияСервер.ИзменитьЗадание(РегламентноеЗадание, ПараметрыЗадания);

КонецПроцедуры

Процедура ОбновитьРегистрСвязейПроектаСНД() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСвязьПроектаСНаправлениемДеятельности.УдалитьНаправлениеДеятельности КАК УдалитьНаправлениеДеятельности,
	               |	упоСвязьПроектаСНаправлениемДеятельности.УдалитьПроект КАК УдалитьПроект,
	               |	упоСвязьПроектаСНаправлениемДеятельности.УдалитьНаправлениеДеятельности.Родитель КАК УдалитьНаправлениеДеятельностиРодитель
	               |ИЗ
	               |	РегистрСведений.упоСвязьПроектаСНаправлениемДеятельности КАК упоСвязьПроектаСНаправлениемДеятельности
	               |ГДЕ
	               |	упоСвязьПроектаСНаправлениемДеятельности.ПроектныйЭлемент = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.УдалитьПроект) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда		
			ПроектныйЭлемент = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(Выборка.УдалитьПроект);	
			ПроектнаяЗадача = Выборка.УдалитьПроект; 
		Иначе			
			ПроектныйЭлемент = Выборка.УдалитьПроект;	
			ПроектнаяЗадача = Документы.упоПроектнаяЗадача.ПустаяСсылка();
		КонецЕсли;
			
		НаборЗаписей = РегистрыСведений.упоСвязьПроектаСНаправлениемДеятельности.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПроектныйЭлемент.Установить(ПроектныйЭлемент);
		Запись = НаборЗаписей.Добавить();
		Запись.ПроектныйЭлемент = ПроектныйЭлемент; 
		Запись.НаправлениеДеятельностиЭлемент = Выборка.УдалитьНаправлениеДеятельности;
		Запись.НаправлениеДеятельностиГруппа = Выборка.УдалитьНаправлениеДеятельностиРодитель;
		Запись.ПроектныйЭлементПроектнаяЗадача = ПроектнаяЗадача;
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.упоСвязьПроектаСНаправлениемДеятельности.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УдалитьНаправлениеДеятельности.Установить(Выборка.УдалитьНаправлениеДеятельности);
		НаборЗаписей.Отбор.УдалитьПроект.Установить(Выборка.УдалитьПроект);
		НаборЗаписей.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбновитьВсеНаправленияДеятельности() Экспорт
	упоСвязьПроектаСНаправлениемДеятельности.СинхронизироватьВсеПроектыСНаправлениямиДеятельности();	
КонецПроцедуры

// Добавляет пользователей в группы доступа на основе их ролей.
//
Процедура ДобавитьПользователейВГруппыДоступаВыборПроектныхЗадачКакПроектаНаОсновеИхРолей(Параметры = Неопределено) Экспорт
	
	СтруктураГруппИПрофилей = Новый Структура("упоВыборПроектныхЗадачКакПроекта", "упоВыборПроектныхЗадачКакПроекта");
	
	Для Каждого КлючЗначение Из СтруктураГруппИПрофилей Цикл
		Профиль = Справочники.ГруппыДоступа[КлючЗначение.Ключ].Профиль;
		Если Не ЗначениеЗаполнено(Профиль) Или Профиль.ПометкаУдаления Тогда
			Объект = Справочники.ГруппыДоступа[КлючЗначение.Ключ].ПолучитьОбъект();
			Объект.Профиль = Справочники.ПрофилиГруппДоступа[КлючЗначение.Значение];
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	               |	Пользователи.Ссылка,
	               |	Пользователи.ИдентификаторПользователяИБ
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	НЕ Пользователи.ПометкаУдаления
	               |	И Пользователи.Наименование <> ""<Не указан>""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Попытка
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
				Выборка.ИдентификаторПользователяИБ);	
		Исключение
		    ПользовательИБ = Неопределено;
		КонецПопытки;
		
		
		Если ПользовательИБ = Неопределено Тогда
			Продолжить;			
		КонецЕсли;
		
		ВключитьВГруппуДоступа = Ложь;
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
			
			ВключитьВГруппуДоступа = ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеАктовВыполненныхРабот"])
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеЗаказовКлиентов"]) 
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеЗаказовНаПроизводство"]) 
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеЗаказовНаПроизводство2_2"]) 
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеЗаказовПоставщикам"])
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеДокументовПоБанку"])
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеПриобретенийТоваровУслугВозвратовПоставщикам"])
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеДокументовПоКассе"])
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеРеализацийТоваровУслуг"]);
		КонецЕсли;

		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() Тогда
			ВключитьВГруппуДоступа = ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеАктовВыполненныхРабот"])
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеЗаказовКлиентов"]) 
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["упоДобавлениеИзменениеЗаказаНаПроизводство"]) 
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеЗаказовПоставщикам"])
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеДокументовПоБанку"])
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеПриобретенийТоваровУслугВозвратовПоставщикам"])
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеДокументовПоКассе"])
									Или ПользовательИБ.Роли.Содержит(Метаданные.Роли["ДобавлениеИзменениеРеализацийТоваровУслуг"]);
		КонецЕсли;
			
		Если ВключитьВГруппуДоступа Или ПользовательИБ.Роли.Содержит(Метаданные.Роли.упоДобавлениеИзменениеОбъектовERP) Тогда
			ВключитьПользователяВГруппуДоступа(Выборка.Ссылка, "упоВыборПроектныхЗадачКакПроекта");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиЭффективности(Параметры = Неопределено) Экспорт
	
	ПоказателиМенеджер = Справочники.упоПоказателиПроектов;
	ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.АвтоматическиВДокументеРасчетЭффективности;
	ТипЗаполнения = Перечисления.упоТипИндикатора.Число;
	НаборПоказателей = "IRR,PI,NCF,PBP,NPV";
	
	МассивПоказателей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НаборПоказателей);
	Для Каждого Показатель Из МассивПоказателей Цикл	
		ПоказательОбъект = ПоказателиМенеджер[Показатель].ПолучитьОбъект();		
		ПоказательОбъект.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
		ПоказательОбъект.ФорматнаяСтрока = "ЧДЦ='2'";
		ПоказательОбъект.ВидЗаполнения = ВидЗаполнения;
		ПоказательОбъект.ТипИндикатора = ТипЗаполнения;
		ПоказательОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТипЮридическихУсловийДоговора() Экспорт
	
	ПолноеИмяОбъекта = "Документ.упоРегистрацияЮридическихУсловийДоговора";
	МетаданныеДокумента = Метаданные.Документы.упоРегистрацияЮридическихУсловийДоговора;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упоРегистрацияЮридическихУсловийДоговора.Ссылка КАК Ссылка,
		|	упоРегистрацияЮридическихУсловийДоговора.ЭтоДополнительноеСоглашение КАК ЭтоДополнительноеСоглашение
		|ИЗ
		|	Документ.упоРегистрацияЮридическихУсловийДоговора КАК упоРегистрацияЮридическихУсловийДоговора
		|ГДЕ
		|	НЕ упоРегистрацияЮридическихУсловийДоговора.ПометкаУдаления
		|	И (упоРегистрацияЮридическихУсловийДоговора.ТипЮридическихУсловийДоговора = ЗНАЧЕНИЕ(Перечисление.упоТипыЮридическихУсловийДоговора.ПустаяСсылка)
		|			ИЛИ упоРегистрацияЮридическихУсловийДоговора.Контрагент = ЗНАЧЕНИЕ(Справочник.КОнтрагенты.ПустаяСсылка)
		|			ИЛИ упоРегистрацияЮридическихУсловийДоговора.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ИЛИ упоРегистрацияЮридическихУсловийДоговора.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ИЛИ упоРегистрацияЮридическихУсловийДоговора.ВидДоговора = ЗНАЧЕНИЕ(Справочник.упоВидДоговора.ПустаяСсылка))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если ДокументОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			ОбъектИзменен = Ложь;
			
			Если Не ЗначениеЗаполнено(ДокументОбъект.ТипЮридическихУсловийДоговора) Тогда
				ДокументОбъект.ТипЮридическихУсловийДоговора = Перечисления.упоТипыЮридическихУсловийДоговора.ДоходныйРасходный;
				ОбъектИзменен = Истина;
			КонецЕсли;
			
			Если Выборка.ЭтоДополнительноеСоглашение Тогда
				ДокументОснование = ДокументОбъект.ПолучитьОсновнойРегистраторЮридическихУсловийДоговора(Выборка.Ссылка);
				Если Не ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
					ДокументОбъект.Контрагент = ДокументОснование.Контрагент;
					ОбъектИзменен = Истина;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
					ДокументОбъект.Организация = ДокументОснование.Организация;
					ОбъектИзменен = Истина;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ДокументОбъект.Валюта) Тогда
					ДокументОбъект.Валюта = ДокументОснование.Валюта;
					ОбъектИзменен = Истина;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ДокументОбъект.ВидДоговора) Тогда
					ДокументОбъект.ВидДоговора = ДокументОснование.ВидДоговора;
					ОбъектИзменен = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			КонецЕсли;

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать документ: %Регистратор% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеДокумента,
				Выборка.Ссылка,
				ТекстСообщения);
			Продолжить;;
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Процедура ПерезаполнитьКодИНаименованиеРегистраСведенийупоСписокВыбораПроектов() Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.упоСписокВыбораПроектов;
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("ВЫБРАТЬ" + Символы.ПС);
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		МассивСтрок.Добавить("	РегистрСведенийупоСписокВыбораПроектов.");
		МассивСтрок.Добавить(Измерение.Имя);
		МассивСтрок.Добавить(" КАК ");
		МассивСтрок.Добавить(Измерение.Имя);
		МассивСтрок.Добавить(",");
		МассивСтрок.Добавить(Символы.ПС);
	КонецЦикла;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		Если Ресурс.Имя <> "Код" И Ресурс.Имя <> "Наименование" Тогда			
			МассивСтрок.Добавить("	РегистрСведенийупоСписокВыбораПроектов.");
			МассивСтрок.Добавить(Ресурс.Имя);
			МассивСтрок.Добавить(" КАК ");
			МассивСтрок.Добавить(Ресурс.Имя);
			МассивСтрок.Добавить(",");
			МассивСтрок.Добавить(Символы.ПС);
		КонецЕсли;		
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл 
		МассивСтрок.Добавить("	РегистрСведенийупоСписокВыбораПроектов.");
		МассивСтрок.Добавить(Реквизит.Имя);
		МассивСтрок.Добавить(" КАК ");
		МассивСтрок.Добавить(Реквизит.Имя);
		МассивСтрок.Добавить(",");
		МассивСтрок.Добавить(Символы.ПС);
	КонецЦикла;
	
	МассивСтрок.Добавить(
	"	Проекты.Наименование КАК Наименование,
	|	Проекты.Код КАК Код
	|ИЗ
	|	РегистрСведений.упоСписокВыбораПроектов КАК РегистрСведенийупоСписокВыбораПроектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|		ПО РегистрСведенийупоСписокВыбораПроектов.Ссылка = Проекты.Ссылка
	|			И (РегистрСведенийупоСписокВыбораПроектов.Наименование <> Проекты.Наименование
	|				ИЛИ РегистрСведенийупоСписокВыбораПроектов.Код <> Проекты.Код)");
	
	ТекстЗапроса = СтрСоединить(МассивСтрок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	НаборЗаписей = РегистрыСведений.упоСписокВыбораПроектов.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей.Отбор.Ссылка.Установить(Выборка.Ссылка);
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);		 
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
		НаборЗаписей.Очистить();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьВыводитьВСводныйСтатусОтчетИНеВыводитьВСтатусОтчетРегупоСвойстваПроектныхЗадач() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упоСвойстваПроектныхЗадач.Регистратор КАК Регистратор,
	|	упоСвойстваПроектныхЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач КАК упоСвойстваПроектныхЗадач
	|ГДЕ
	|	НЕ упоСвойстваПроектныхЗадач.ЭтоВеха
	|	И НЕ упоСвойстваПроектныхЗадач.ЭтоМодельПакетаРабот
	|	И НЕ упоСвойстваПроектныхЗадач.ЭтоПакетРабот
	|ИТОГИ ПО
	|	Регистратор";
	
	ЗаполнитьВыбранныйРесурсРегистраупоСвойстваПроектныхЗадач(Запрос, "ВыводитьВСводныйСтатусОтчет");	
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упоСвойстваПроектныхЗадач.Регистратор КАК Регистратор,
	|	упоСвойстваПроектныхЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач КАК упоСвойстваПроектныхЗадач
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	|		ПО упоСвойстваПроектныхЗадач.ПроектнаяЗадача = упоПроектнаяЗадача.Ссылка
	|			И (упоПроектнаяЗадача.НеВыводитьВСтатусОтчет)
	|ИТОГИ ПО
	|	Регистратор";
	
	ЗаполнитьВыбранныйРесурсРегистраупоСвойстваПроектныхЗадач(Запрос, "НеВыводитьВСтатусОтчет");
		
КонецПроцедуры

Процедура ЗаполнитьЭтоАктируемаяИВнешняяНормаСтоимостиРегупоСвойстваПроектныхЗадач() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упоСвойстваПроектныхЗадач.Регистратор КАК Регистратор,
	|	упоСвойстваПроектныхЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСвойстваПроектныхЗадач.ПроектнаяЗадача.ЭтоАктируемаяЗадача КАК ЭтоАктируемаяЗадача,
	|	упоСвойстваПроектныхЗадач.ПроектнаяЗадача.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач КАК упоСвойстваПроектныхЗадач
	|ГДЕ
	|	(упоСвойстваПроектныхЗадач.ПроектнаяЗадача.ЭтоАктируемаяЗадача
	|			ИЛИ упоСвойстваПроектныхЗадач.ПроектнаяЗадача.ВнешняяНормаСтоимостиТрудовыхРесурсов <> ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка))
	|ИТОГИ ПО
	|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НаборЗаписей = РегистрыСведений.упоСвойстваПроектныхЗадач.СоздатьНаборЗаписей();
	
	Пока ВыборкаРегистратор.Следующий() Цикл
		
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		НаборЗаписей.Прочитать();
		
		Выборка = ВыборкаРегистратор.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Для Каждого Запись Из НаборЗаписей Цикл
				
				Если Запись.ПроектнаяЗадача <> Выборка.ПроектнаяЗадача Тогда
					Продолжить;
				КонецЕсли;
				
				Запись.ЭтоАктируемаяЗадача = Выборка.ЭтоАктируемаяЗадача;
				Запись.ВнешняяНормаСтоимостиТрудовыхРесурсов = Выборка.ВнешняяНормаСтоимостиТрудовыхРесурсов;
				
			КонецЦикла;	
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбновитьВариантыОтчетовПользователяПоПортфелюПрограмме() Экспорт
	
	СответствиеЗамен = Новый Соответствие;
	СответствиеЗамен.Вставить(Новый ПолеКомпоновкиДанных("День"), Новый ПолеКомпоновкиДанных("ПериодДень"));	
	СответствиеЗамен.Вставить(Новый ПолеКомпоновкиДанных("Месяц"), Новый ПолеКомпоновкиДанных("ПериодМесяц"));	
	//
	СответствиеЗамен.Вставить(Новый ПолеКомпоновкиДанных("ПроектнаяЗадачаПрограммыЗеркальныйПроект"), Новый ПолеКомпоновкиДанных("ПроектнаяЗадачаПрограммыПортфеляЗеркальныйПроект"));
	СответствиеЗамен.Вставить(Новый ПолеКомпоновкиДанных("ПроектнаяЗадачаПрограммы"), Новый ПолеКомпоновкиДанных("ПроектнаяЗадачаПрограммыПортфеля"));
	СответствиеЗамен.Вставить(Новый ПолеКомпоновкиДанных("ПодчиненныйПроектЗадачиПрограммы"), Новый ПолеКомпоновкиДанных("ПодчиненныйПроектЗадачиПрограммыПортфеля"));
	СответствиеЗамен.Вставить(Новый ПолеКомпоновкиДанных("ПроектПрограммы"), Новый ПолеКомпоновкиДанных("ПроектПрограммыПортфеля"));
 	//
	СответствиеЗамен.Вставить(Новый ПолеКомпоновкиДанных("ПроектнаяЗадачаПортфеляЗеркальныйПроект"), Новый ПолеКомпоновкиДанных("ПроектнаяЗадачаПрограммыПортфеляЗеркальныйПроект"));
	СответствиеЗамен.Вставить(Новый ПолеКомпоновкиДанных("ПроектнаяЗадачаПортфеля"), Новый ПолеКомпоновкиДанных("ПроектнаяЗадачаПрограммыПортфеля"));
	СответствиеЗамен.Вставить(Новый ПолеКомпоновкиДанных("ПодчиненныйПроектЗадачиПортфеля"), Новый ПолеКомпоновкиДанных("ПодчиненныйПроектЗадачиПрограммыПортфеля"));
	СответствиеЗамен.Вставить(Новый ПолеКомпоновкиДанных("ПроектПортфеля"), Новый ПолеКомпоновкиДанных("ПроектПрограммыПортфеля"));
	
	МассивПользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ПользовательИБ Из МассивПользователи Цикл
		ОбновитьВариантыОтчетаПользователя("Отчет." + Метаданные.Отчеты.упоПланФактныйАнализПоПортфелю.Имя, СответствиеЗамен, ПользовательИБ.Имя);
		ОбновитьВариантыОтчетаПользователя("Отчет." + Метаданные.Отчеты.упоПланФактныйАнализПоПрограмме.Имя, СответствиеЗамен, ПользовательИБ.Имя);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПредопределеннуюНастройкуРаспределенияБДР() Экспорт
	
	НастройкаОбъект = Справочники.упоНастройкиРаспределенияБДР.Стандартная.ПолучитьОбъект();	
	НастройкаОбъект.УчестьРасходы_ОтборСССП = Справочники.упоСобственныеСилыСубподряд.Субподряд;  
	НастройкаОбъект.РаспределитьПоТрудозатратам_ИсключитьСССП = Справочники.упоСобственныеСилыСубподряд.Субподряд;  
	НастройкаОбъект.ФлагРаспределитьПоТрудозатратам = Истина;
	НастройкаОбъект.ФлагУчестьРасходы = Истина;       
	НастройкаОбъект.ФлагВыделитьНДСДоходов = Истина;
	НастройкаОбъект.ФлагВыделитьНДСРасходов = Истина;
	НастройкаОбъект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");		
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаОбъект);
	
	МенеджерКонстанты = Константы.упоНастройкаРаспределенияБДРПоУмолчанию.СоздатьМенеджерЗначения();
	МенеджерКонстанты.Значение = Справочники.упоНастройкиРаспределенияБДР.Стандартная;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);

	МенеджерКонстанты = Константы.упоСтавкаНДСПоУмолчанию.СоздатьМенеджерЗначения();
	МенеджерКонстанты.Значение = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);

КонецПроцедуры

Процедура ЗаполнитьКонстантыОтраженияФактаПервичнымиДокументами() Экспорт
	
	Если Константы.упоОтражатьФактДоходовПервичнымиДокументами.Получить() Тогда
    	Константы.упоОтражатьФактРасходовПервичнымиДокументами.Установить(Истина);
		Если Константы.упоВключатьНДСВФактДоходовПервичныхДокументов.Получить() Тогда
			Константы.упоВключатьНДСВФактРасходовПервичныхДокументов.Установить(Истина);		
		КонецЕсли;
	Иначе
		Константы.упоВключатьНДСВФактДоходовПервичныхДокументов.Установить(Ложь);
	КонецЕсли;	
		
КонецПроцедуры

Процедура ЗаполнитьТипЗадачиуВПрогнозТрудозатратПоРолям() Экспорт
	
	ПолноеИмяОбъекта = "Документ.упоПрогнозТрудозатратПоРолям";
	МетаданныеДокумента = Метаданные.Документы.упоПрогнозТрудозатратПоРолям;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоПрогнозТрудозатратПоРолямДанные.Ссылка КАК Ссылка,
	               |	упоПрогнозТрудозатратПоРолямДанные.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
	               |	ВЫБОР
	               |		КОГДА упоСвойстваПроектныхЗадачСрезПоследних.ЭтоВеха
	               |			ТОГДА 5
	               |		КОГДА упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ТипЗадачи
	               |ИЗ
	               |	Документ.упоПрогнозТрудозатратПоРолям.Данные КАК упоПрогнозТрудозатратПоРолямДанные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |		ПО упоПрогнозТрудозатратПоРолямДанные.ПроектнаяЗадачаЗеркало.СсылкаНаПроектнуюЗадачу = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ИТОГИ ПО
	               |	ПроектнаяЗадачаЗеркало";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокумент.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если ДокументОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ОбъектИзменен = Ложь;
			Выборка = ВыборкаДокумент.Выбрать();
			Пока Выборка.Следующий() Цикл
				НайденнаяСтрока = ДокументОбъект.Данные.Найти(Выборка.ПроектнаяЗадачаЗеркало, "ПроектнаяЗадачаЗеркало");
				Если НайденнаяСтрока <> Неопределено Тогда
					НайденнаяСтрока.ТипЗадачи = Выборка.ТипЗадачи;
					ОбъектИзменен = Истина;
				КонецЕсли;	
			КонецЦикла;
			
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			КонецЕсли;

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать документ: %Регистратор% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеДокумента,
				Выборка.Ссылка,
				ТекстСообщения);
			Продолжить;;
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьВерсиюВРегистрахВыполнения() Экспорт
	
	// упоПроцентыГотовностиПроектныхЗадач
	ЗаполнитьВерсиюУказанногоРегистра("упоПроцентыГотовностиПроектныхЗадач");
	
	// упоСтатусыПроектныхЗадач
	ЗаполнитьВерсиюУказанногоРегистра("упоСтатусыПроектныхЗадач");
	
	// упоФактическиеДатыНачалаИОкончанияПроектныхЗадач
	ЗаполнитьВерсиюУказанногоРегистра("упоФактическиеДатыНачалаИОкончанияПроектныхЗадач");
	
	// упоПроцентыГотовностиПроектов
	ЗаполнитьВерсиюУказанногоРегистра("упоПроцентыГотовностиПроектов", Ложь);
			
КонецПроцедуры

Процедура ЗаполнитьВидЗаданияПодразделениюВЗадания() Экспорт
	
	ПолноеИмяОбъекта = "Справочник.упоЗадания";
	МетаданныеДокумента = Метаданные.Справочники.упоЗадания;
	ВидЗаданияПодразделению = Перечисления.упоВидыЗаданияПодразделению.НаПланирование;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоЗадания.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.упоЗадания КАК упоЗадания
	               |ГДЕ
	               |	упоЗадания.ЭтоЗаданиеПодразделению";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ВидЗаданияПодразделению = ВидЗаданияПодразделению;
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		Исключение
			ШаблонСообщения = НСтр("ru = 'Не удалось обработать справочник: %1 по причине: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
									Выборка.Ссылка, 
									ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеДокумента,
				Выборка.Ссылка,
				ТекстСообщения);
		КонецПопытки;	
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПредопределенныеПрофилиНастроекПрогнозаТрудозатрат(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	упоПрофилиНастроекПрогнозаТрудозатратПоРолям.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.упоПрофилиНастроекПрогнозаТрудозатратПоРолям КАК упоПрофилиНастроекПрогнозаТрудозатратПоРолям
	                |ГДЕ
	                |	упоПрофилиНастроекПрогнозаТрудозатратПоРолям.Предопределенный
	                |	И упоПрофилиНастроекПрогнозаТрудозатратПоРолям.УровеньПланированияРолей = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СправочникМенеджер = Справочники.упоПрофилиНастроекПрогнозаТрудозатратПоРолям;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка = СправочникМенеджер.ОтчетПодразделения Тогда
			НастройкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			НастройкаОбъект.УровеньПланированияРолей = Перечисления.упоУровеньПланирования.Окончательный;
			НастройкаОбъект.АктуализироватьПланПоФактическимДанным = Истина;
			НастройкаОбъект.ЗаписыватьФактОтчетногоПериода = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаОбъект);
		ИначеЕсли Выборка.Ссылка = СправочникМенеджер.АктуализацияПлана Тогда
			НастройкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			НастройкаОбъект.УровеньПланированияРолей = Перечисления.упоУровеньПланирования.Предварительный;
			НастройкаОбъект.АктуализироватьПланПоФактическимДанным = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НастройкаОбъект);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПерезаписатьДокументыСинхронизацииФактическихДоходовИРасходов() Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСинхронизацияФактическихДоходовИРасходов.Ссылка КАК Документ
	               |ИЗ
	               |	Документ.упоСинхронизацияФактическихДоходовИРасходов КАК упоСинхронизацияФактическихДоходовИРасходов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	упоСинхронизацияФактическихДоходовИРасходов.МоментВремени";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл								
		ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, Ложь, Ложь);		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьНаправлениеДвиженияВСтатьиДвиженияДенежныхСредств() Экспорт
	
	ПолноеИмяОбъекта = "Справочник.СтатьиДвиженияДенежныхСредств";
	МетаданныеДокумента = Метаданные.Справочники.СтатьиДвиженияДенежныхСредств;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатьиДвиженияДенежныхСредств.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_СтатьиДДС
	               |ИЗ
	               |	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	               |ГДЕ
	               |	СтатьиДвиженияДенежныхСредств.упоНаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПервых.СтатьяДДС КАК СтатьяДДС,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПервых.НаправлениеДвижения КАК НаправлениеДвижения,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПервых.Период КАК Период
	               |ПОМЕСТИТЬ ВТ_НаправленияДвижений
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПервых(
	               |			,
	               |			НаправлениеДвижения <> ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.ПустаяСсылка)
	               |				И СтатьяДДС В
	               |					(ВЫБРАТЬ
	               |						ВТ_СтатьиДДС.Ссылка КАК Ссылка
	               |					ИЗ
	               |						ВТ_СтатьиДДС КАК ВТ_СтатьиДДС)) КАК упоАктуальныеПланыДвиженийДенежныхСредствСрезПервых
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СтатьиДДС.Ссылка КАК Ссылка,
	               |	ЕСТЬNULL(ВТ_НаправленияДвижений.НаправлениеДвижения, ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата)) КАК НаправлениеДвижения
	               |ИЗ
	               |	ВТ_СтатьиДДС КАК ВТ_СтатьиДДС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаправленияДвижений КАК ВТ_НаправленияДвижений
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ВТ_НаправленияДвижений.СтатьяДДС КАК СтатьяДДС,
	               |				МИНИМУМ(ВТ_НаправленияДвижений.Период) КАК Период
	               |			ИЗ
	               |				ВТ_НаправленияДвижений КАК ВТ_НаправленияДвижений
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ВТ_НаправленияДвижений.СтатьяДДС) КАК МинимальныПериод
	               |			ПО ВТ_НаправленияДвижений.СтатьяДДС = МинимальныПериод.СтатьяДДС
	               |				И ВТ_НаправленияДвижений.Период = МинимальныПериод.Период
	               |		ПО ВТ_СтатьиДДС.Ссылка = ВТ_НаправленияДвижений.СтатьяДДС";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.упоНаправлениеДвижения = Выборка.НаправлениеДвижения;
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		Исключение
			ШаблонСообщения = НСтр("ru = 'Не удалось обработать справочник: %1 по причине: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
									Выборка.Ссылка, 
									ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеДокумента,
				Выборка.Ссылка,
				ТекстСообщения);
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Процедура ПерезаполнитьИсточникДанныхУДокументовСинхронизации() Экспорт
	
	КэшИсточников = Новый ТаблицаЗначений;
	КэшИсточников.Колонки.Добавить("Идентификатор");	
	КэшИсточников.Колонки.Добавить("ИсточникДанных");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСинхронизацияФактическихДоходовИРасходов.Ссылка КАК Ссылка,
	               |	упоСинхронизацияФактическихДоходовИРасходов.удалитьИсточникДанных КАК Идентификатор,
	               |	упоСинхронизацияФактическихДоходовИРасходов.удалитьПодключениеКИсточникуДанных КАК Подключение
	               |ИЗ
	               |	Документ.упоСинхронизацияФактическихДоходовИРасходов КАК упоСинхронизацияФактическихДоходовИРасходов
	               |ГДЕ
	               |	НЕ упоСинхронизацияФактическихДоходовИРасходов.ПометкаУдаления
	               |	И упоСинхронизацияФактическихДоходовИРасходов.ИсточникДанных = ЗНАЧЕНИЕ(Справочник.упоИсточникиДанных.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоСинхронизацияФактическихДвиженийДенежныхСредств.Ссылка,
	               |	упоСинхронизацияФактическихДвиженийДенежныхСредств.удалитьИсточникДанных,
	               |	упоСинхронизацияФактическихДвиженийДенежныхСредств.удалитьПодключениеКИсточникуДанных
	               |ИЗ
	               |	Документ.упоСинхронизацияФактическихДвиженийДенежныхСредств КАК упоСинхронизацияФактическихДвиженийДенежныхСредств
	               |ГДЕ
	               |	НЕ упоСинхронизацияФактическихДвиженийДенежныхСредств.ПометкаУдаления
	               |	И упоСинхронизацияФактическихДвиженийДенежныхСредств.ИсточникДанных = ЗНАЧЕНИЕ(Справочник.упоИсточникиДанных.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		НайденнаяСтрока = КэшИсточников.Найти(Выборка.Идентификатор, "Идентификатор");
		Если Не НайденнаяСтрока = Неопределено Тогда
			ИсточникДанных = НайденнаяСтрока.ИсточникДанных;	
		Иначе
			ИсточникДанных = Справочники.упоИсточникиДанных.ИсточникДанныхПоИдентификатору(Выборка.Идентификатор, Выборка.Подключение, "");
			
			НоваяСтрока = КэшИсточников.Добавить();
			НоваяСтрока.Идентификатор = Выборка.Идентификатор;
			НоваяСтрока.ИсточникДанных = ИсточникДанных; 
		КонецЕсли;		
		ДокОбъект.ИсточникДанных = ИсточникДанных;  
		
		ДокОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПравилаИнтеграцииС1СДокументооборотом() Экспорт
	
	НеинтегрируемыеРеквизиты = Документы.упоПроектнаяЗадача.НеинтегрируемыеРеквизитыОбъектаИС();
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	СправочникОбъект.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ПравилаИнтеграцииС1СДокументооборотом.ПравилаЗаполненияРеквизитовИС КАК СправочникОбъект
	                      |ГДЕ
	                      |	СправочникОбъект.Ссылка.ТипОбъектаИС = ""Документ.упоПроектнаяЗадача""
	                      |	И СправочникОбъект.ИмяРеквизитаОбъектаИС В(&МассивРеквизитов)");
	Запрос.УстановитьПараметр("МассивРеквизитов", НеинтегрируемыеРеквизиты);
	
	Результат = Запрос.Выполнить();	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		МассивУдаляемыхРеквизитов = Новый Массив;
		Для Каждого НеинтегрируемыйРеквизит Из НеинтегрируемыеРеквизиты Цикл
			СтрокаРеквизит = СправочникОбъект.ПравилаЗаполненияРеквизитовИС.Найти(НеинтегрируемыйРеквизит, 
				"ИмяРеквизитаОбъектаИС");
			Если СтрокаРеквизит <> Неопределено Тогда
				МассивУдаляемыхРеквизитов.Добавить(СтрокаРеквизит);	
			КонецЕсли;	
		КонецЦикла;
		
		Для Каждого УдаляемыйРеквизит Из МассивУдаляемыхРеквизитов Цикл
			СправочникОбъект.ПравилаЗаполненияРеквизитовИС.Удалить(УдаляемыйРеквизит);	
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ОбновитьНастройкиПоУмолчаниюПанелиРуководителяПодразделения() Экспорт
	
	Отбор = Новый Структура("КлючОбъекта, КлючНастроек", 
							"Обработка.упоПанельРуководителяПодразделения", 
							"НастройкаПоУмолчанию");
	Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
	Пока Выборка.Следующий() Цикл
		Если Выборка.Настройки = "СтандартнаяНастройка"	Тогда
			ХранилищеОбщихНастроек.Сохранить(Выборка.КлючОбъекта, Выборка.КлючНастроек, 
				"ЗадачиРПЗ", Выборка.Представление, Выборка.Пользователь);
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

Процедура ИсправитьДвиженияСозданныеОбработкойПереносПроектныхЗадач(Параметры) Экспорт
	
	// упоПроцентыГотовностиПроектныхЗадач
	ИсправитьВерсиюУказанногоРегистра("упоПроцентыГотовностиПроектныхЗадач");
	
	// упоСтатусыПроектныхЗадач
	ИсправитьВерсиюУказанногоРегистра("упоСтатусыПроектныхЗадач");
	
	// упоФактическиеДатыНачалаИОкончанияПроектныхЗадач
	ИсправитьВерсиюУказанногоРегистра("упоФактическиеДатыНачалаИОкончанияПроектныхЗадач");
	
	ПрогрессВыполнения = Параметры.ПрогрессВыполнения;
	
	ИсправитьБитыеДвижения(ПрогрессВыполнения);
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ПерепровестиДокументыупоРегистрацияФактическиВыполненногоОбъема() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка КАК Документ
	               |ИЗ
	               |	Документ.упоРегистрацияФактическиВыполненногоОбъема.ДоходныеОбъемы КАК упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы
	               |ГДЕ
	               |	(упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Количество < 0
	               |			ИЛИ упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Стоимость < 0)
	               |	И упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Ссылка
	               |ИЗ
	               |	Документ.упоРегистрацияФактическиВыполненногоОбъема.РасходныеОбъемы КАК упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы
	               |ГДЕ
	               |	(упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Количество < 0
	               |			ИЛИ упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Стоимость < 0)
	               |	И упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Ссылка.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, Ложь, Ложь, РежимЗаписиДокумента.Проведение);
	КонецЦикла; 
		
КонецПроцедуры

Процедура ОбновитьПользовательскиеНастройкиКолонокСтруктурыПроекта() Экспорт
	
	// Настройки обработки без детализации по проектам.
	КлючОбъекта = "Обработка.упоУпрощенныйВводСтруктурыПроекта";
	Отбор = Новый Структура("КлючОбъекта", КлючОбъекта);
	Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
	Пока Выборка.Следующий() Цикл
		РедактироватьНастройкуКолонокСтруктурыПроекта(
			Выборка.КлючОбъекта, Выборка.КлючНастроек, Выборка.Настройки, Выборка.Представление, Выборка.Пользователь);
	КонецЦикла;
	
	// Настройки по умолчанию по проектам.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.Ссылка
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	НЕ Проекты.ПометкаУдаления
	               |	И НЕ Проекты.ЭтоПроектнаяЗадача";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПроекты = Результат.Выбрать();
	Пока ВыборкаПроекты.Следующий() Цикл
		
		СсылкаНаПроект = ВыборкаПроекты.Ссылка;
		// Сначала ищем сохраненную настройку по ИД, если не находим, то ищем по коду.
		МассивСуффиксовКлючейОбъекта = Новый Массив;
		МассивСуффиксовКлючейОбъекта.Добавить("" + СокрЛП(СсылкаНаПроект.УникальныйИдентификатор()));
		МассивСуффиксовКлючейОбъекта.Добавить("" + СокрЛП(СсылкаНаПроект.Код));
		Для каждого СуффиксКлючаОбъекта Из МассивСуффиксовКлючейОбъекта Цикл
			
			КлючОбъекта = "Обработка.упоУпрощенныйВводСтруктурыПроекта" + СокрЛП(СуффиксКлючаОбъекта); // Настройка для конкретного проекта
			Отбор = Новый Структура("КлючОбъекта", КлючОбъекта);
			
			Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
			Пока Выборка.Следующий() Цикл
				РедактироватьНастройкуКолонокСтруктурыПроекта(
					Выборка.КлючОбъекта, Выборка.КлючНастроек, Выборка.Настройки, Выборка.Представление, Выборка.Пользователь);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтключитьИспользованиеПодсистемыДоговоровИЗаявокНаПроекты() Экспорт
	
	МенеджерЗначенияКонстанты = Константы.упоИспользоватьПодсистемуДоговоров.СоздатьМенеджерЗначения();
	МенеджерЗначенияКонстанты.Значение = Ложь;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначенияКонстанты);
	
	МенеджерЗначенияКонстанты = Константы.упоИспользоватьЗаявкиНаПроекты.СоздатьМенеджерЗначения();
	МенеджерЗначенияКонстанты.Значение = Ложь;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначенияКонстанты);
	
КонецПроцедуры

Процедура ЗаполнитьУровеньГруппировкиПланированиеТрудозатратПоТрудовымРесурсам() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоПланированиеТрудозатратПоТрудовымРесурсам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.упоПланированиеТрудозатратПоТрудовымРесурсам КАК упоПланированиеТрудозатратПоТрудовымРесурсам
	               |ГДЕ
	               |	упоПланированиеТрудозатратПоТрудовымРесурсам.ПорядокГруппировок = 2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоПланированиеТрудозатратПоТрудовымРесурсам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.упоПланированиеТрудозатратПоТрудовымРесурсам КАК упоПланированиеТрудозатратПоТрудовымРесурсам
	               |ГДЕ
	               |	упоПланированиеТрудозатратПоТрудовымРесурсам.ПорядокГруппировок <> 2";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл								
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.УровеньГруппировок = 1;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, Ложь, Ложь);		
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл								
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.УровеньГруппировок = 3;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, Ложь, Ложь);		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУровеньГруппировкиПрогнозТрудозатратПоРолям() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоПрогнозТрудозатратПоРолям.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.упоПрогнозТрудозатратПоРолям КАК упоПрогнозТрудозатратПоРолям
	               |ГДЕ
	               |	упоПрогнозТрудозатратПоРолям.ПорядокГруппировок <> ЗНАЧЕНИЕ(Перечисление.упоПорядокГруппировокПрогнозированиеТрудозатрат.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл								
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.УровеньГруппировок = 3;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, Ложь, Ложь);		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ОчиститьЗаписиРегистровПередУдалениемПланаОбменаУдалить_упоПолный(Параметры = Неопределено) Экспорт
	
	Если Метаданные.ПланыОбмена.Найти("Удалить_упоПолный") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыКОчистке = Новый Структура;
	РегистрыКОчистке.Вставить("БезопасноеХранилищеДанных", "Владелец");
	РегистрыКОчистке.Вставить("БезопасноеХранилищеДанныхОбластейДанных", "Владелец");		
	РегистрыКОчистке.Вставить("ВерсииОбъектов", "Объект");	
	РегистрыКОчистке.Вставить("ДанныеОбработанныеВЦентральномУзлеРИБ", "УзелПланаОбмена");	
	РегистрыКОчистке.Вставить("ДанныеОбъектовДляРегистрацииВОбменах", "УзелИнформационнойБазы");	
	РегистрыКОчистке.Вставить("ЗависимостиПравДоступа", "ТипВедущейТаблицы");
	РегистрыКОчистке.Вставить("ИзмененияОбщихДанныхУзлов", "УзелИнформационнойБазы");
	РегистрыКОчистке.Вставить("НаборыЗначенийДоступа", "Объект");
	РегистрыКОчистке.Вставить("НаборыЗначенийДоступа", "ЗначениеДоступа");	
	РегистрыКОчистке.Вставить("НастройкиОбменаДаннымиXDTO", "УзелИнформационнойБазы");
	РегистрыКОчистке.Вставить("НастройкиОчисткиФайлов", "ВладелецФайла");
	РегистрыКОчистке.Вставить("НастройкиТранспортаОбменаДанными", "Корреспондент");
	РегистрыКОчистке.Вставить("ОбработчикиСобытийСинхронизацииДанных", "УзелИнформационнойБазы");	
	РегистрыКОчистке.Вставить("ОбщиеНастройкиУзловИнформационныхБаз", "УзелИнформационнойБазы");
	РегистрыКОчистке.Вставить("ПсевдонимыПредопределенныхУзлов", "Корреспондент");
	РегистрыКОчистке.Вставить("ПубличныеИдентификаторыСинхронизируемыхОбъектов", "УзелИнформационнойБазы");
	РегистрыКОчистке.Вставить("РезультатыОбменаДанными", "УзелИнформационнойБазы");
	РегистрыКОчистке.Вставить("СоответствияОбъектовИнформационныхБаз", "УзелИнформационнойБазы");	
	РегистрыКОчистке.Вставить("СостоянияОбменовДанными", "УзелИнформационнойБазы");
	РегистрыКОчистке.Вставить("СостоянияУспешныхОбменовДанными", "УзелИнформационнойБазы");
	РегистрыКОчистке.Вставить("ТаблицыГруппДоступа", "ТипТаблицы");
	РегистрыКОчистке.Вставить("УдалитьНастройкиТранспортаОбмена", "УзелИнформационнойБазы");
	РегистрыКОчистке.Вставить("УдалитьРезультатыОбменаДанными", "УзелИнформационнойБазы");
		
	ТекстШаблон = "ВЫБРАТЬ
                  |	РегистрКОчистке.%2
                  |ИЗ
                  |	РегистрСведений.%1 КАК РегистрКОчистке
				  |ГДЕ
				  | ТИПЗНАЧЕНИЯ(РегистрКОчистке.%2) = ТИП(ПланОбмена.Удалить_упоПолный)";
				  
	Для Каждого РегистрКОчистке Из РегистрыКОчистке Цикл
			  
		ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстШаблон, 
																				РегистрКОчистке.Ключ, 
																				РегистрКОчистке.Значение);		
		Запрос = Новый Запрос(ТекстЗапроса);
		
		Результат = Запрос.Выполнить();		
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();		
		Пока Выборка.Следующий() Цикл
			
			НЗ = РегистрыСведений[РегистрКОчистке.Ключ].СоздатьНаборЗаписей();
			НЗ.Отбор[РегистрКОчистке.Значение].Установить(Выборка[РегистрКОчистке.Значение]);
			НЗ.Прочитать();
			НЗ.Очистить();
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НЗ);						
			
		КонецЦикла;
		
	КонецЦикла;						
		
КонецПроцедуры

Процедура ОбновитьВидСобытия_НазначениеНаПроектнуюЗадачу(Параметры = Неопределено) Экспорт
	
	ТипТэга = Перечисления.упоТипыТегов.ВыполняемыйКод;
	УсловиеЗамены = "обПолучитьНазваниеПроектнойЗадачи(";
		
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	упоВидыСобытийТэги.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.упоВидыСобытий.Тэги КАК упоВидыСобытийТэги
	                      |ГДЕ
	                      |	упоВидыСобытийТэги.ТипТэга = &ТипТэга	                      
	                      |	И упоВидыСобытийТэги.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Справочники.упоВидыСобытий.НазначениеНаПЗ);
	Запрос.УстановитьПараметр("ТипТэга", ТипТэга);	
	
	Результат = Запрос.Выполнить();	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ЗаписатьОбъект = Ложь;
		
		Для Каждого Тэг Из СправочникОбъект.Тэги Цикл
			Если Тэг.ТипТэга = ТипТэга Тогда
				ПозицияЗамены = СтрНайти(Тэг.Условие, УсловиеЗамены);
				
				Если ПозицияЗамены = 0 Тогда
					Продолжить;
				ИначеЕсли ПозицияЗамены > 1 Тогда
					ПредыдущийСимвол = Сред(Тэг.Условие, ПозицияЗамены - 1, 1);				
					Если ПредыдущийСимвол = "." Тогда // Пользователь вручную исправил код.
						Продолжить;
					КонецЕсли;
				КонецЕсли;	
								
				Тэг.Условие = СтрЗаменить(Тэг.Условие, 
					УсловиеЗамены, 
					"упоПроектыИЗадачиВызовСервера." + УсловиеЗамены);
				
				ЗаписатьОбъект = Истина;
			КонецЕсли;	
		КонецЦикла;
		
		Если ЗаписатьОбъект Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);		
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьВалютуДоговорыКонтрагентов(Параметры = Неопределено) Экспорт
	
	Валюта = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл								
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Валюта = Валюта;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);		
	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьПредопределенныеВидыСобытий() Экспорт

    упоОповещенияВызовСервера.ЗаполнитьПредопределенныеДанныеОповещений();
    
КонецПроцедуры

Процедура ЗаполнитьРеквизитРегистрацииППНоменклатурыРегистрацииОбъемов() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.упоРегистрацияФактическиВыполненногоОбъема.ДоходныеОбъемы КАК упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы
	               |ГДЕ
	               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Номенклатура ССЫЛКА Справочник.упоПроектнаяПродукция
	               |	И НЕ упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка.РегистрацияПроектнойПродукции
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		РФВО = Выборка.Ссылка.ПолучитьОбъект();
		РФВО.ПериодРегистрации = НачалоМесяца(РФВО.Дата);
		РФВО.РегистрацияПроектнойПродукции = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(РФВО);
	КонецЦикла;
КонецПроцедуры

Процедура ВключитьВПользовательскиеНастройкиТипПлана(Параметры = Неопределено) Экспорт
	
	ПараметрТипПлана = Новый ПараметрКомпоновкиДанных("ТипПлана");
	МассивПользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Для Каждого МетаданныеОтчета Из Метаданные.Отчеты Цикл
		
		КлючОбъекта = "Отчет." + МетаданныеОтчета.Имя;
		
		Для Каждого ПользовательИБ Из МассивПользователи Цикл
			
			ИмяПользователя = ПользовательИБ.Имя; 
			Хранилище = ХранилищаНастроек.ХранилищеВариантовОтчетов;
			ВариантыОтчета = Хранилище.ПолучитьСписок(КлючОбъекта, ИмяПользователя);
			ОписаниеНастроек = Новый ОписаниеНастроек;
			
			Для Каждого Вариант Из ВариантыОтчета Цикл
				
				КлючНастроек = Вариант.Значение;
				Настройки = Хранилище.Загрузить(КлючОбъекта, КлючНастроек, ОписаниеНастроек, ИмяПользователя);
				
				Если Настройки = Неопределено Тогда
					Продолжить;
				КонецЕсли;	
				
				ЗначениеПараметра =  Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрТипПлана);
				Если ЗначениеПараметра = Неопределено  Тогда 
					Продолжить;
				КонецЕсли;
				
				ЗначениеПараметра.Использование  = Истина; 
				ЗначениеПараметра.ИдентификаторПользовательскойНастройки = "_ТипПлана_";
				Хранилище.Сохранить(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, ИмяПользователя);
				
			КонецЦикла;	
			
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКомпонентСлужебныйВПроекте(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоУдалитьСлужебныеТипыПроектов.ТипПроекта КАК ТипПроекта
	               |ПОМЕСТИТЬ ВТ_ТипПроекта
	               |ИЗ
	               |	РегистрСведений.упоУдалитьСлужебныеТипыПроектов КАК упоУдалитьСлужебныеТипыПроектов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Проекты.Ссылка КАК Проект
	               |ИЗ
	               |	ВТ_ТипПроекта КАК ВТ_ТипПроекта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО ВТ_ТипПроекта.ТипПроекта = Проекты.ТипПроекта";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			СправочникОбъект = Выборка.Проект.ПолучитьОбъект();
			СправочникОбъект.Компонент = Перечисления.упоКомпоненты.ОбщефирменнаяДеятельность;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры 

#Область ПоказателиПроектов

Процедура СоздатьНовыеОбновитьПоказателиПроектовИзМакета(Параметры = Неопределено) Экспорт
	
	мсКодовДляОбновления = Новый Массив;
	мсКодовДляОбновления.Добавить("ОбъемПланД");
	мсКодовДляОбновления.Добавить("ОбъемПланР");
	мсКодовДляОбновления.Добавить("ОбъемФактД");
	мсКодовДляОбновления.Добавить("ОбъемФактР");
	мсКодовДляОбновления.Добавить("ПроцентМаржаПоОбъемуФакт");
	мсКодовДляОбновления.Добавить("ПроцентОбъемовД");
	мсКодовДляОбновления.Добавить("ПроцентОбъемовР");
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
	
	мсКодовДляУдаления = Новый Массив;
	мсКодовДляУдаления.Добавить("ОбъемПлан");
	мсКодовДляУдаления.Добавить("ОбъемФакт");
	мсКодовДляУдаления.Добавить("ПроцентОбъемов");
	
	Для Каждого Элемент Из мсКодовДляУдаления Цикл
		ПоказательСсылка = Справочники.упоПоказателиПроектов.НайтиПоРеквизиту("ПредустановленныйКод", Элемент);
		
		Если Не ЗначениеЗаполнено(ПоказательСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ПоказательОбъект = ПоказательСсылка.ПолучитьОбъект();
		ПоказательОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_ПроцентГотовности(Параметры = Неопределено) Экспорт
	
	мсКодовДляОбновления = Новый Массив;
	мсКодовДляОбновления.Добавить("ПроцентГотовностиПроекта");
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
	
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_ОтставаниеОтПлана(Параметры = Неопределено) Экспорт
	
	мсКодовДляОбновления = Новый Массив;
	мсКодовДляОбновления.Добавить("ОтставаниеОтБП");
	мсКодовДляОбновления.Добавить("ОтставаниеОтТП");
	мсКодовДляОбновления.Добавить("ОтставаниеОтДП");
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
	
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_423110(Параметры = Неопределено) Экспорт
	
	СоздатьНовыеПоказателиПроектовИзМакета();
	
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_42355(Параметры = Неопределено) Экспорт
	
	мсКодовДляОбновления = Новый Массив;
	мсКодовДляОбновления.Добавить("TCPIИндексПроизвДоЗав");
	мсКодовДляОбновления.Добавить("SPIИндексВыполненияСроков");
	мсКодовДляОбновления.Добавить("CPIИндексВыполненияСтоимости");
	мсКодовДляОбновления.Добавить("EVПлановаяСтоимостьВыпРаб");
	мсКодовДляОбновления.Добавить("РасходыПоПроектуТ");
	мсКодовДляОбновления.Добавить("РасходыИтогоПлан");
	мсКодовДляОбновления.Добавить("РасходыБезНДСИтогоПлан");
	мсКодовДляОбновления.Добавить("РасходыИтогоФакт");
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
	
КонецПроцедуры

Процедура УдалитьПараметрыПоказателяДоКонцаПроектаНедель(Параметры = Неопределено) Экспорт
		
	ПредустановленныйКод = "ДоКонцаПроектаНедель";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упоПоказателиПроектов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
		|ГДЕ
		|	упоПоказателиПроектов.ПредустановленныйКод = &ПредустановленныйКод";
	
	Запрос.УстановитьПараметр("ПредустановленныйКод", ПредустановленныйКод); 
	
	РезультатЗапроса = Запрос.Выполнить();        
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПоказательСсылка = Выборка.Ссылка;
		ПоказательОбъект = ПоказательСсылка.ПолучитьОбъект();	
		
		ПоказательОбъект.ПараметрыЗапроса = Неопределено;
		ПоказательОбъект.ПараметрыЗапросаПЗ = Неопределено;

		ПоказательОбъект.Записать();

	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_42359(Параметры = Неопределено) Экспорт
	
	мсКодовДляОбновления = Новый Массив;
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратКоличествоПредварительныйУровень");
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратКоличествоОкончательныйУровень");
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратСтоимостьПредварительныйУровень");
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратСтоимостьОкончательныйУровень"); 
	
	мсКодовДляОбновления.Добавить("ТрудозатратыПланКоличествоОкончательныйУровень");
	мсКодовДляОбновления.Добавить("ТрудозатратыФактКоличествоОкончательныйУровень");
	мсКодовДляОбновления.Добавить("ТрудозатратыПланСтоимостьОкончательныйУровень");
	мсКодовДляОбновления.Добавить("ТрудозатратыФактСтоимостьОкончательныйУровень");
	мсКодовДляОбновления.Добавить("ТрудозатратыПланКоличествоПредварительныйУровень");
	мсКодовДляОбновления.Добавить("ТрудозатратыПланСтоимостьПредварительныйУровень");
	
	мсКодовДляОбновления.Добавить("ОбъемФактР");
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
	
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_42364(Параметры = Неопределено) Экспорт
	
	// Для корректного обновления представлений в табличной части "РасчетныеИндикаторы",
	// сначала обновляются показатели с типом - запрос, после показатели с типом - формула.
	мсКодовДляОбновления = Новый Массив;
	мсКодовДляОбновления.Добавить("ТрудозатратыФактКоличествоОкончательныйУровень");
	мсКодовДляОбновления.Добавить("ТрудозатратыФактСтоимостьОкончательныйУровень");
	
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратКоличествоПредварительныйУровень");
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратКоличествоОкончательныйУровень");
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратСтоимостьПредварительныйУровень");
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратСтоимостьОкончательныйУровень"); 
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
	
КонецПроцедуры

Процедура ДобавитьНовыеПоказателиСтавкаСтоимостиДенегИПроцентСтоимостиДенег(Параметры = Неопределено) Экспорт
	
	СоздатьНовыеПоказателиПроектовИзМакета(, Истина);
	упоПоказателиПроектовСервер.ЗаполнитьПоказательСтавкаСтоимостиДенег();
	
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_42368(Параметры = Неопределено) Экспорт
	
	мсКодовДляОбновления = Новый Массив;
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратКоличествоПредварительныйУровень");
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратКоличествоОкончательныйУровень");
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратСтоимостьПредварительныйУровень");
	мсКодовДляОбновления.Добавить("ПроцентТрудозатратСтоимостьОкончательныйУровень");
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
	
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_42369(Параметры = Неопределено) Экспорт
	
	мсКодовДляОбновления = Новый Массив;
	// Обновление показателей
	мсКодовДляОбновления.Добавить("ТрудозатратыФактКоличествоОкончательныйУровень");
	мсКодовДляОбновления.Добавить("ОбъемыДТ");
	
	// Для корректного заполнения табличной части "РасчетныеИндикаторы" формульных показателей,
	// сначала создаются показатели с типом - запрос, после показатели с типом - формула.
	// Создание показателей с типом - запрос.
	мсКодовДляОбновления.Добавить("EVПлановыйОбъемТрудозатратПоВыполненнымРаботам");
	мсКодовДляОбновления.Добавить("ТрудозатратыПланКоличествоПредварительныйУровеньТекДата");
	мсКодовДляОбновления.Добавить("ТрудозатратыПланКоличествоПредварительныйУровеньДатаАктуальности");
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
	
	мсКодовДляОбновления = Новый Массив;
	// Создание показателей с типом - формула.
	мсКодовДляОбновления.Добавить("CPIТрИндексВыполненияСтоимости");
	мсКодовДляОбновления.Добавить("SPIИндексВыполненияСроковТекДата");
	мсКодовДляОбновления.Добавить("SPIИндексВыполненияСроковДатаАктуальности");
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
	
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_58194(Параметры = Неопределено) Экспорт
	
	мсКодовДляОбновления = Новый Массив;
	мсКодовДляОбновления.Добавить("ДлительностьМПК");	
	мсКодовДляОбновления.Добавить("ДлительностьДень");
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
		
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_42379(Параметры = Неопределено) Экспорт
	
	мсКодовДляОбновления = Новый Массив;
	мсКодовДляОбновления.Добавить("ПроцентГотовностиЗадачиРодителя");
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
	
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_423710(Параметры = Неопределено) Экспорт
	
	мсКодовДляОбновления = Новый Массив;	
	мсКодовДляОбновления.Добавить("ДлительностьДень");
	
	СоздатьНовыеПоказателиПроектовИзМакета(мсКодовДляОбновления);
		
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_423716(Параметры = Неопределено) Экспорт
	
	Показатели = Новый Массив;
	
	Показатели.Добавить("ТрудозатратыФактКоличествоПоПортфелюОкончательныйУровень");
	Показатели.Добавить("ТрудозатратыФактКоличествоПоПроектуОкончательныйУровень");
	Показатели.Добавить("ТрудозатратыФактСтоимостьПоПортфелюОкончательныйУровень");
	Показатели.Добавить("ТрудозатратыФактСтоимостьПоПроектуОкончательныйУровень");
	
	Показатели.Добавить("ОбъемФактПоПортфелюД");
	Показатели.Добавить("ОбъемФактПоПроектамД");
	Показатели.Добавить("ОбъемФактПоПортфелюР");
	Показатели.Добавить("ОбъемФактПоПроектуР");
	
	Показатели.Добавить("ДоходыФактПоПортфелю");
	Показатели.Добавить("ДоходыФактПоПоПодчиненномуПроекту");
	Показатели.Добавить("ДоходыФактОбщий");
	
	Показатели.Добавить("РасходыФактПоПортфелю");
	Показатели.Добавить("РасходыФактПоПодчиненномуПроекту");
	Показатели.Добавить("РасходыФактОбщий");
	
	Показатели.Добавить("МаржаПортфеляВПроцентахПлан");
	Показатели.Добавить("МаржаПортфеляВПроцентахФакт");
	Показатели.Добавить("МаржаПортфеляПлан");
	Показатели.Добавить("МаржаПортфеляФакт");
	Показатели.Добавить("ОтклонениеПоПортфелюД");
	Показатели.Добавить("ОтклонениеПоПортфелюР");
	Показатели.Добавить("ВыплатыФактПоПортфелю");
	Показатели.Добавить("ВыплатыФактПоПодчиненномуПроекту");
	Показатели.Добавить("ПоступленияФактПоПортфелю");
	Показатели.Добавить("ПоступленияФактПоПодчиненномуПроекту");
	Показатели.Добавить("ВыплатыФактОбщий");
	Показатели.Добавить("ДенежныйПотокПортфеляПлан");
	Показатели.Добавить("ДенежныйПотокПортфеляФакт");
	Показатели.Добавить("ОтклонениеВыплатПоПортфелю");
	Показатели.Добавить("ОтклонениеДенежногоПотокаПоПортфелю");
	Показатели.Добавить("ОтклонениеПоступленийПоПортфелю");
	Показатели.Добавить("ПоступленияФактОбщий");
	
	СоздатьНовыеПоказателиПроектовИзМакета(Показатели);
	
КонецПроцедуры

Процедура ОбновитьПоказателиПроектовИзМакета_423904(Параметры = Неопределено) Экспорт
	
	СоздатьНовыеПоказателиПроектовИзМакета();
	
КонецПроцедуры

#КонецОбласти

Процедура ОбновитьКонфигурациюПродуктаPM(Параметры = Неопределено) Экспорт
	
	ЭтоEPM = упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM();

	КонфигурацияEPM = Справочники.упоКонфигурацияПродуктаPM.EPM;
	ЭтоEPM_Настройка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонфигурацияEPM, "ЭтаКонфигурация");
	
	Если ЭтоEPM <> ЭтоEPM_Настройка Тогда
		ПродуктОбъект = КонфигурацияEPM.ПолучитьОбъект();
		ПродуктОбъект.ЭтаКонфигурация = ЭтоEPM;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПродуктОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Процедура синхронизирует сценарии.
//
Процедура СинхронизироватьСценарии(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
                   |    Сценарии.Ссылка КАК Сценарий
                   |ИЗ
                   |    Справочник.Сценарии КАК Сценарии
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеСценариев КАК упоСоответствиеСценариев
                   |        ПО упоСоответствиеСценариев.СценарийERP <> Сценарии.Ссылка";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда                               
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			упоИнтеграция.СинхронизироватьСценарии(Выборка.Сценарий, Истина);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитШифрПроекта(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.упоШифр = """"
	               |	И НЕ Проекты.ЭтоПроектнаяЗадача
	               |	И НЕ Проекты.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Проекты.Ссылка КАК Ссылка,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.КодПроектногоДокумента КАК КодПроектногоДокумента
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)
	               |			И (упоСвойстваПроектныхЗадачСрезПоследних.КодПроектногоДокумента <> """")
	               |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |			И (Проекты.упоШифр = """")";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ИндексПоследнего = Результат.ВГраница();
	РезультатПроекты 	= Результат[ИндексПоследнего - 1];
	РезультатПЗ 		= Результат[ИндексПоследнего];
	
	Если Не РезультатПроекты.Пустой() Тогда 
		Выборка = РезультатПроекты.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПроектОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПроектОбъект.упоШифр = ПроектОбъект.Код;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПроектОбъект);
		КонецЦикла;
	КонецЕсли;
	
	Если Не РезультатПЗ.Пустой() Тогда 
		Выборка = РезультатПЗ.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПроектОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПроектОбъект.упоШифр = Выборка.КодПроектногоДокумента;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПроектОбъект);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет добавленную опцию НД УчетРасчетовСПоставщиками в направлениях деятельности, 
// связанных с проектными задачами, для целей отражения в проектном бюджетировании.
//
Процедура ОбновитьОпцииСвязанныхНД(Параметры = Неопределено) Экспорт
	
	// Обновление настроек создания НД.
	
	НастройкиЗаполнения = упоСвязьПроектаСНаправлениемДеятельности.ПолучитьНастройкиЗаполненияСвязанногоНД();
	
	НадоОбновитьНастройки = Не(НастройкиЗаполнения.Свойство("УчетРасчетовСПоставщиками") 
		И НастройкиЗаполнения.УчетРасчетовСПоставщиками);
	
	Если НадоОбновитьНастройки Тогда
		НастройкиЗаполнения.Вставить("УчетРасчетовСПоставщиками", Истина);
		упоСвязьПроектаСНаправлениемДеятельности.СохранитьНастройкиЗаполненияСвязанногоНД(НастройкиЗаполнения);
	КонецЕсли;
	
	// Обновление НД.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упоСвязьПроектаСНаправлениемДеятельности.НаправлениеДеятельностиЭлемент КАК Ссылка
		|ИЗ
		|	РегистрСведений.упоСвязьПроектаСНаправлениемДеятельности КАК упоСвязьПроектаСНаправлениемДеятельности
		|ГДЕ
		|	НЕ упоСвязьПроектаСНаправлениемДеятельности.НаправлениеДеятельностиЭлемент.УчетРасчетовСПоставщиками";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.УчетРасчетовСПоставщиками = Истина;
		Если Не ЗначениеЗаполнено(СправочникОбъект.НалогообложениеНДС) Тогда
			СправочникОбъект.НалогообложениеНДС  = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьПереходНаНовыйМеханизмНастроекРаботаСЗаданиями() Экспорт
	
	КлючОбъекта = "Обработка.упоРаботаСЗаданиями";
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Для каждого ПользовательИБ Из ПользователиИБ  Цикл
		
		ОтключитьГруппуЗадания = ХранилищеОбщихНастроек.Загрузить("Обработка.упоРаботаСЗаданиями", "ОтключитьГруппуЗадания",, ПользовательИБ.Имя);
		ОчередьЗадачИсполнителя = ХранилищеОбщихНастроек.Загрузить("Обработка.упоРаботаСЗаданиями", "ОчередьЗадачИсполнителя",, ПользовательИБ.Имя);
		ПоказыватьОбсуждения = ХранилищеОбщихНастроек.Загрузить("Обработка.упоРаботаСЗаданиями", "ПоказыватьОбсуждения",, ПользовательИБ.Имя);
		
		СценарииПоддерживающиеСохранениеНастроек = упоЗаданияСервер.СценарииПоддерживающиеСохранениеНастроек();
		
		НастройкаПоУмолчанию = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, "ПоУмолчанию_НастройкаПоУмолчанию",, ПользовательИБ.Имя);
		Если НастройкаПоУмолчанию <> Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		
		Для каждого Сценарий Из СценарииПоддерживающиеСохранениеНастроек Цикл
			
			КлючНастроек = "НастройкиОбработкиПоСценарию_" + Сценарий + "_ПоУмолчанию";
			
			Если ОтключитьГруппуЗадания <> Неопределено
					Или ОчередьЗадачИсполнителя <> Неопределено
					Или ПоказыватьОбсуждения <> Неопределено Тогда
				
				СтруктураНастроек = упоЗаданияСервер.НоваяСтруктураНастроек();
				СтруктураНастроек.ОтключитьГруппуЗадания = ОтключитьГруппуЗадания = Истина;
				СтруктураНастроек.ОчередьЗадачИсполнителя = ОчередьЗадачИсполнителя = Истина;
				СтруктураНастроек.ПоказыватьОбсуждения = ПоказыватьОбсуждения = Истина;
				
				Если Сценарий = "упоРаботаСЗаданиямиДляИсполнения" 
						Или Сценарий = "упоРаботаСЗаданиямиНаКонтроле"
						Или Сценарий = "упоРаботаСЗаданиямиОтМеня" 
						Или Сценарий = "ВсеПоручения" 
						Или Сценарий = "упоРаботаСЗаданиямиНаПланирование" 
						Или Сценарий = "упоРаботаСЗаданиямиНаПрогноз" Тогда
					СтруктураНастроек.ВидЗадания = Справочники.упоВидыЗаданий.Поручение;	
				КонецЕсли;
				
				Если Сценарий = "ВсеПроектныеРешения" Тогда
					СтруктураНастроек.ВидЗадания = Справочники.упоВидыЗаданий.ПроектноеРешение;	
				КонецЕсли;
				
				ОписаниеНастройки = Новый ОписаниеНастроек();
				ОписаниеНастройки.Представление = "Настройки по умолчанию";
				
				ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, СтруктураНастроек, ОписаниеНастройки, ПользовательИБ.Имя);
				ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, Сценарий + "_НастройкаПоУмолчанию", КлючНастроек,, ПользовательИБ.Имя);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьСправочникНастроекРаспределенияБДР() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упоНастройкиРаспределенияБДР.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.упоНастройкиРаспределенияБДР КАК упоНастройкиРаспределенияБДР
	|ГДЕ
	|	упоНастройкиРаспределенияБДР.ФлагУчестьРасходы
	|	И упоНастройкиРаспределенияБДР.СпособРаспределенияДоходовПоРасходам = ЗНАЧЕНИЕ(Перечисление.упоСпособыРаспределенияРасходовВОбработкеРаспределенияБДР.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ОбъектНастройка = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектНастройка.СпособРаспределенияДоходовПоРасходам = Перечисления.упоСпособыРаспределенияРасходовВОбработкеРаспределенияБДР.ПоСуммам;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектНастройка);
		
	КонецЦикла;
	
КонецПроцедуры

// см.наименование.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура УстановитьИспользованиеПроектнойПродукции(Параметры = Неопределено) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерКонстанты = Константы.упоИспользоватьПроектнуюПродукцию.СоздатьМенеджерЗначения();
	МенеджерКонстанты.Значение = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
	
	УстановитьПараметрыНабораСвойств_ПроектнаяПродукция();
	
	ЗаполнитьСоответствиеСтатусовПППроцентамГотовности();
	
КонецПроцедуры

// Проверяет использование и включает регламентное задание расчета сроков проектов.
//
Процедура ПроверитьИспользованиеВключитьРегламентноеЗаданиеРасчетСроковПроектов(Параметры = Неопределено) Экспорт
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.упоРасчетСроковПроектов);
	Если Не РегламентноеЗадание.Использование Тогда
		ПараметрыЗадания = Новый Структура("Использование", Истина);
		РегламентныеЗаданияСервер.ИзменитьЗадание(РегламентноеЗадание, ПараметрыЗадания);
	КонецЕсли;
	
КонецПроцедуры

#Область ПравилаПроектногоБюджетирования

Процедура ПроектноеБюджетирование_ЗаполнитьПризнакЗаполнятьПоРаспределению() Экспорт 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	упоПравилаПолученияФактаДляПроектногоБюджетирования.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.упоПравилаПолученияФактаДляПроектногоБюджетирования КАК упоПравилаПолученияФактаДляПроектногоБюджетирования
	                      |ГДЕ
	                      |	упоПравилаПолученияФактаДляПроектногоБюджетирования.РаспределятьПоПлану
	                      |	И НЕ упоПравилаПолученияФактаДляПроектногоБюджетирования.ПометкаУдаления");
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ПравилоОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		НайденныеСтроки = ПравилоОбъект.СопоставлениеРеквизитов.НайтиСтроки(Новый Структура("Реквизит", "Подразделение"));
		Если НайденныеСтроки.Количество() Тогда
			НайденныеСтроки[0].ЗаполнятьПоРаспределению = Истина;
		КонецЕсли;			
		НайденныеСтроки = ПравилоОбъект.СопоставлениеРеквизитов.НайтиСтроки(Новый Структура("Реквизит", "Статья"));
		Если НайденныеСтроки.Количество() Тогда
			НайденныеСтроки[0].ЗаполнятьПоРаспределению = Истина;
		КонецЕсли;	
		
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПравилоОбъект);	
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать правило: %1 по причине: %2'"),
				Выборка.Ссылка,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));						
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,,
				Выборка.Ссылка,
				ТекстСообщения);	
		КонецПопытки;	
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбновитьПредопределенныеПравилаПолученияФакта_4_2_26_7(Параметры = Неопределено) Экспорт

	упоПроектноеБюджетированиеСервер.ОбновитьПредопределенныеПравилаПолученияФакта();

КонецПроцедуры

Процедура ОбновитьПредопределенныеПравилаПолученияФакта_4_2_36_6(Параметры = Неопределено) Экспорт

	упоПроектноеБюджетированиеСервер.ОбновитьПредопределенныеПравилаПолученияФакта();

КонецПроцедуры

#КонецОбласти

#Область ПодготовкаКПереходуНаРМ5

Процедура ЗаполнитьСлужебныеРеквизитыДляПереходаНаРМ5(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ(Пользователи.Недействителен = Пользователи.НеИспользоватьНедействителен
	|				И Пользователи.Подразделение = Пользователи.НеИспользоватьПодразделение
	|				И Пользователи.ФизическоеЛицо = Пользователи.НеИспользоватьФизическоеЛицо
	|				И Пользователи.Служебный = Пользователи.НеИспользоватьСлужебный
	|				И Пользователи.Подготовлен = Пользователи.НеИспользоватьПодготовлен
	|				И Пользователи.ИдентификаторПользователяИБ = Пользователи.НеИспользоватьИдентификаторПользователяИБ
	|				И Пользователи.ИдентификаторПользователяСервиса = Пользователи.НеИспользоватьИдентификаторПользователяСервиса)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыПользователей.Ссылка
	|ИЗ
	|	Справочник.ГруппыПользователей КАК ГруппыПользователей
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппыПользователей.Ссылка
	|
	|ИМЕЮЩИЕ
	|	НЕ КОЛИЧЕСТВО(ГруппыПользователей.Состав.Пользователь) = КОЛИЧЕСТВО(ГруппыПользователей.НеИспользоватьСостав.Пользователь)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Валюты.Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	НЕ(Валюты.ЗагружаетсяИзИнтернета = Валюты.НеИспользоватьЗагружаетсяИзИнтернета
	|				И Валюты.НаименованиеПолное = Валюты.НеИспользоватьНаименованиеПолное
	|				И Валюты.Наценка = Валюты.НеИспользоватьНаценка
	|				И Валюты.ОсновнаяВалюта = Валюты.НеИспользоватьОсновнаяВалюта
	|				И Валюты.ПараметрыПрописи = Валюты.НеИспользоватьПараметрыПрописи
	|				И Валюты.ФормулаРасчетаКурса = Валюты.НеИспользоватьФормулаРасчетаКурса
	|				И Валюты.СпособУстановкиКурса = Валюты.НеИспользоватьСпособУстановкиКурса)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбъектСправочника = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		упоИнтеграция.ЗаполнитьСлужебныеРеквизиты(ОбъектСправочника, Ложь);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектСправочника);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура ПересчитатьТрудозатратыПроектныхЗадач(Параметры = Неопределено) Экспорт
	
	ПроектныеЗадачиДляПересчета = ПроектныеЗадачиДляПересчетаТрудозатрат();
	
	Если Не ЗначениеЗаполнено(ПроектныеЗадачиДляПересчета) Тогда
		Возврат;	
	КонецЕсли;
	
	ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат = 
		упоРаботаСОчередямиВызовСервера.ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат();
		
	Если ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат Тогда		
		упоРаспределениеТрудозатратВызовСервера.ОбработатьПорциюОтраженияПлановыхТрудозатратЗадач();
	КонецЕсли;
	
	упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(
		ПроектныеЗадачиДляПересчета, Неопределено);
		
	Если ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат Тогда
		упоРаспределениеТрудозатратВызовСервера.ОбработатьПорциюОтраженияПлановыхТрудозатратЗадач(
			ПроектныеЗадачиДляПересчета);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьИсточникПланаТрудозатратДляЗадачСТрансляциейПроектнойПродукции(Параметры = Неопределено) Экспорт
	
	ПроектныеЗадачиДляПересчета = ПроектныеЗадачиДляЗаполненияИсточникаПланаТрудозатрат();
	
	Если Не ЗначениеЗаполнено(ПроектныеЗадачиДляПересчета) Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат = 
		упоРаботаСОчередямиВызовСервера.ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат();
		
	Если ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат Тогда		
		упоРаспределениеТрудозатратВызовСервера.ОбработатьПорциюОтраженияПлановыхТрудозатратЗадач();
	КонецЕсли;
	
	упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(
		ПроектныеЗадачиДляПересчета, Неопределено);
		
	Если ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат Тогда
		упоРаспределениеТрудозатратВызовСервера.ОбработатьПорциюОтраженияПлановыхТрудозатратЗадач(
			ПроектныеЗадачиДляПересчета);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьТрудозатратыПроектныхЗадачСДублямиРолей(Параметры = Неопределено) Экспорт
	
	ПроектныеЗадачиДляПересчета = ПроектныеЗадачиДляПересчетаТрудозатратСДублямиРолей();
	
	Если Не ЗначениеЗаполнено(ПроектныеЗадачиДляПересчета) Тогда
		Возврат;	
	КонецЕсли;
	
	ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат = 
		упоРаботаСОчередямиВызовСервера.ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат();
			
	упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(
		ПроектныеЗадачиДляПересчета, Неопределено);
		
	Если ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат Тогда
		упоРаспределениеТрудозатратВызовСервера.ОбработатьПорциюОтраженияПлановыхТрудозатратЗадач(
			ПроектныеЗадачиДляПересчета);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнениеРеквизитаДатаЗакрытияЭтапаДокументовЗакрытияЭтапа(Параметры = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоЗакрытиеЭтапа.Ссылка КАК Ссылка,
	               |	упоЗакрытиеЭтапа.Дата КАК Дата
	               |ИЗ
	               |	Документ.упоЗакрытиеЭтапа КАК упоЗакрытиеЭтапа
	               |ГДЕ
	               |	НЕ упоЗакрытиеЭтапа.ПометкаУдаления
	               |	И упоЗакрытиеЭтапа.ДатаЗакрытияЭтапа = ДАТАВРЕМЯ(1, 1, 1)";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;		
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ДатаЗакрытияЭтапа = Выборка.Дата;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);		
	КонецЦикла;			
	
КонецПроцедуры

Процедура ЗаполнитьНомераДоговоровЮрУсловий(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоРегистрацияЮридическихУсловийДоговора.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.упоРегистрацияЮридическихУсловийДоговора КАК упоРегистрацияЮридическихУсловийДоговора
	               |ГДЕ
	               |	НЕ упоРегистрацияЮридическихУсловийДоговора.ПометкаУдаления
	               |	И упоРегистрацияЮридическихУсловийДоговора.НомерДоговора = """"";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДоговорОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДоговорОбъект.НомерДоговора = ДоговорОбъект.Номер;
		ДоговорОбъект.ДатаДоговора = ДоговорОбъект.Дата;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДоговорОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДвиженияДокументаПоРегистру_упоСинхронизацияФактическихТрудозатрат(Параметры = Неопределено) Экспорт
	
	ПустаяЗадачаПричина = Новый Массив;
	ПустаяЗадачаПричина.Добавить(Неопределено);
	ПустаяЗадачаПричина.Добавить(Справочники.упоВнепроектныеЗадачи.ПустаяСсылка());
	ПустаяЗадачаПричина.Добавить(Справочники.Проекты.ПустаяСсылка());
	ПустаяЗадачаПричина.Добавить(Справочники.упоПричиныПотерьРабочегоВремени.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяЗадачаПричина", ПустаяЗадачаПричина);
	Запрос.УстановитьПараметр("РазделУчета", Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача);
	Запрос.УстановитьПараметр("РабочееЗадание", Документы.упоПроектнаяЗадача.ПустаяСсылка());
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоИспользованиеРабочегоВремени.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ втРегистраторы
	               |ИЗ
	               |	РегистрСведений.упоИспользованиеРабочегоВремени КАК упоИспользованиеРабочегоВремени
	               |ГДЕ
	               |	упоИспользованиеРабочегоВремени.Регистратор ССЫЛКА Документ.упоСинхронизацияФактическихТрудозатрат
	               |	И упоИспользованиеРабочегоВремени.ЗадачаПричина В(&ПустаяЗадачаПричина)
	               |	И упоИспользованиеРабочегоВремени.РазделУчета = &РазделУчета
	               |	И упоИспользованиеРабочегоВремени.РабочееЗадание <> &РабочееЗадание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоИспользованиеРабочегоВремени.Период КАК Период,
	               |	упоИспользованиеРабочегоВремени.Регистратор КАК Регистратор,
	               |	упоИспользованиеРабочегоВремени.НомерСтроки КАК НомерСтроки,
	               |	упоИспользованиеРабочегоВремени.Активность КАК Активность,
	               |	упоИспользованиеРабочегоВремени.ТрудовойРесурс КАК ТрудовойРесурс,
	               |	упоИспользованиеРабочегоВремени.РазделУчета КАК РазделУчета,
	               |	ВЫБОР
	               |		КОГДА упоИспользованиеРабочегоВремени.РазделУчета = &РазделУчета
	               |			ТОГДА Проекты.Ссылка
	               |		ИНАЧЕ упоИспользованиеРабочегоВремени.ЗадачаПричина
	               |	КОНЕЦ КАК ЗадачаПричина,
	               |	упоИспользованиеРабочегоВремени.День КАК День,
	               |	упоИспользованиеРабочегоВремени.РабочееЗадание КАК РабочееЗадание,
	               |	упоИспользованиеРабочегоВремени.РасшифровкаТрудозатрат КАК РасшифровкаТрудозатрат,
	               |	упоИспользованиеРабочегоВремени.Подразделение КАК Подразделение,
	               |	упоИспользованиеРабочегоВремени.РольРесурса КАК РольРесурса,
	               |	упоИспользованиеРабочегоВремени.ВидОперации КАК ВидОперации,
	               |	упоИспользованиеРабочегоВремени.Задание КАК Задание,
	               |	упоИспользованиеРабочегоВремени.Начало КАК Начало,
	               |	упоИспользованиеРабочегоВремени.Трудозатраты КАК Трудозатраты
	               |ИЗ
	               |	РегистрСведений.упоИспользованиеРабочегоВремени КАК упоИспользованиеРабочегоВремени
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегистраторы КАК втРегистраторы
	               |		ПО упоИспользованиеРабочегоВремени.Регистратор = втРегистраторы.Регистратор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоИспользованиеРабочегоВремени.РабочееЗадание = Проекты.СсылкаНаПроектнуюЗадачу
	               |			И (Проекты.ЭтоПроектнаяЗадача)
	               |ИТОГИ ПО
	               |	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРегистратор.Следующий() Цикл
		
		НЗ = РегистрыСведений.упоИспользованиеРабочегоВремени.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		
		Выборка = ВыборкаРегистратор.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НЗ.Добавить(), Выборка);
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НЗ);
		
	КонецЦикла;

КонецПроцедуры

// Заменяет роль упоЧтениеДополнительныхОтчетовИОбработок из всех профилей, в которые она входит
// на роль ЧтениеДополнительныхОтчетовИОбработок.
//
Процедура ЗаменитьРоль_упоЧтениеДополнительныхОтчетовИОбработок(Параметры = Неопределено) Экспорт

	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");

	НовыеРоли = Новый Массив;
	НовыеРоли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ЗаменяемыеРоли = Новый Соответствие;
	ЗаменяемыеРоли.Вставить("Удалить_упоЧтениеДополнительныхОтчетовИОбработок", НовыеРоли);
	
	МодульУправлениеДоступом.ЗаменитьРолиВПрофилях(ЗаменяемыеРоли);			

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает версии библиотек и сохраняет в текстовый файл.
//
// Параметры:
//  ИмяФайла - Строка - путь к файлу .txt
// 
// Возвращаемое значение:
//  Строка, Неопределено - текст сообщения с версиями библиотек.
//
Процедура ВерсииБиблиотек(ИмяФайла = "") Экспорт 
	
	ТекстыВерсий = Новый ТаблицаЗначений;
	ТекстыВерсий.Колонки.Добавить("Имя");
	ТекстыВерсий.Колонки.Добавить("Версия");
	ТекстыВерсий.Колонки.Добавить("Длина");
	
	Результат = СтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам;
	
	МаксДлина = 0;
	Для Каждого КлючЗначение Из Результат Цикл
		НЗ = ТекстыВерсий.Добавить();
		НЗ.Имя 		= КлючЗначение.Ключ;
		НЗ.Версия 	= КлючЗначение.Значение.Версия;
		НЗ.Длина 	= СтрДлина(НЗ.Имя);
		
		МаксДлина = Макс(НЗ.Длина, МаксДлина);
	КонецЦикла;
	ТекстыВерсий.Сортировать("Имя");
	
	МассивТекстовВерсий = Новый Массив;
	Шаблон = "%1 %2";
	Для Каждого СтрокаТЗ Из ТекстыВерсий Цикл
		КоличествоПробелов = МаксДлина - СтрокаТЗ.Длина;
		ИмяПодсистемы = упоФункцииОбщегоНазначенияКлиентСервер.ДобавитьПробелыКСтроке(
			СтрокаТЗ.Имя, КоличествоПробелов);
		
		ТекстВерсии = СтрШаблон(Шаблон, ИмяПодсистемы, СтрокаТЗ.Версия);
		МассивТекстовВерсий.Добавить(ТекстВерсии);
	КонецЦикла;
	
	ТекстСообщения = СтрСоединить(МассивТекстовВерсий, Символы.ПС);
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		
		Файл = Новый Файл(ИмяФайла);
		Если Файл.Существует() Тогда
			Файл.УстановитьТолькоЧтение(Ложь);
			УдалитьФайлы(ИмяФайла);
		КонецЕсли;
		
		ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
		ЗаписьТекста.Записать(ТекстСообщения);
		ЗаписьТекста.Закрыть();
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВключитьПользователяВГруппуДоступа(Пользователь, ИмяГруппыДоступа)
	
	ГруппаДоступа = Справочники.ГруппыДоступа[ИмяГруппыДоступа].ПолучитьОбъект();
	
	Если ГруппаДоступа.Пользователи.Найти(Пользователь, "Пользователь") = Неопределено Тогда
		
		НоваяСтрока = ГруппаДоступа.Пользователи.Добавить();
		НоваяСтрока.Пользователь = Пользователь;
		
		ГруппаДоступа.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РедактироватьНастройкуСтруктурыПроекта(КлючОбъекта, КлючНастроек, СтруктураНастроек,
	ПредставлениеНастройки, ИмяПользователя)
	
	Если НЕ ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьИзменение = Ложь;
	
	МассивСписков = Новый Массив;
	Если СтруктураНастроек.Свойство("ПользовательскийПорядокКолонок") 
		И ТипЗнч(СтруктураНастроек.ПользовательскийПорядокКолонок) = Тип("СписокЗначений") Тогда
		МассивСписков.Добавить("ПользовательскийПорядокКолонок");
	КонецЕсли;
	Если СтруктураНастроек.Свойство("СписокКолонок")
		И ТипЗнч(СтруктураНастроек.СписокКолонок) = Тип("СписокЗначений") Тогда
		МассивСписков.Добавить("СписокКолонок");
	КонецЕсли;
	
	
	Для Каждого ИмяСписка Из МассивСписков Цикл
		
		Для Каждого ЭлементСписка Из СтруктураНастроек[ИмяСписка] Цикл
			Если ЭлементСписка.Значение = "ОтлонениеПоОкончанию" Тогда
				ЭлементСписка.Значение = "ОтклонениеПоОкончанию";
				ЕстьИзменение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЕстьИзменение Тогда
		
		ОписаниеНастройки = Новый ОписаниеНастроек();
		ОписаниеНастройки.Представление = ПредставлениеНастройки; 
		
		ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, СтруктураНастроек, ОписаниеНастройки, ИмяПользователя);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеЗначения_СправочникРоли()
	
	ЗаказчикОбъект = Справочники.упоРоли.Заказчик.ПолучитьОбъект();
	ЗаказчикОбъект.упоВидРесурса = Перечисления.упоВидРесурса.Трудовой;
	ЗаказчикОбъект.Записать();
	
КонецПроцедуры	

Процедура ЗаполнитьВыбранныйРесурсРегистраупоСвойстваПроектныхЗадач(Запрос, ИмяРесурса)
			
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НаборЗаписей = РегистрыСведений.упоСвойстваПроектныхЗадач.СоздатьНаборЗаписей();	
	
	Пока ВыборкаРегистратор.Следующий() Цикл
		
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		НаборЗаписей.Прочитать();
		Выборка = ВыборкаРегистратор.Выбрать();
		Пока Выборка.Следующий() Цикл
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.ПроектнаяЗадача = Выборка.ПроектнаяЗадача Тогда
					Запись[ИмяРесурса] = Истина;
				КонецЕсли;								
			КонецЦикла;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьВариантыОтчетаПользователя(КлючОбъекта, СответствиеЗамен, ИмяПользователя)
			
	ТипыГрупп = Новый Массив;
	ТипыГрупп.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ТипыГрупп.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ТипыГрупп.Добавить(Тип("ГруппировкаТаблицыКомпоновкиДанных"));
	ТипыГрупп.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ТипыГрупп.Добавить(Тип("ГруппировкаДиаграммыКомпоновкиДанных"));
		
	мХранилищеВариантов = ХранилищаНастроек.ХранилищеВариантовОтчетов;
		
	ВариантыОтчета = мХранилищеВариантов.ПолучитьСписок(КлючОбъекта, ИмяПользователя);
	
	ОписаниеНастроек = Новый ОписаниеНастроек;
		
	Для Каждого Вариант Из ВариантыОтчета Цикл
		
		КлючНастроек = Вариант.Значение;
		
		Настройки = мХранилищеВариантов.Загрузить(КлючОбъекта, КлючНастроек, ОписаниеНастроек, ИмяПользователя);
		
		Если Настройки = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		ВыполнитьЗаменуПолейВНастройкахРекурсивно(Настройки.Выбор.Элементы, СответствиеЗамен, ТипыГрупп);
		ВыполнитьЗаменуПолейВНастройкахРекурсивно(Настройки.Отбор.Элементы, СответствиеЗамен, ТипыГрупп);
		
		Для Каждого ЭлементСтруктуры Из Настройки.Структура Цикл
			Если Тип(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда				
				ВыполнитьЗаменуПолейВНастройкахРекурсивно(ЭлементСтруктуры.Строки, СответствиеЗамен, ТипыГрупп);	
				ВыполнитьЗаменуПолейВНастройкахРекурсивно(ЭлементСтруктуры.Колонки, СответствиеЗамен, ТипыГрупп);	
			ИначеЕсли Тип(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") Тогда					
				Коллекция = Новый Массив;
				Коллекция.Добавить(ЭлементСтруктуры);				
				ВыполнитьЗаменуПолейВНастройкахРекурсивно(Коллекция, СответствиеЗамен, ТипыГрупп);
			ИначеЕсли Тип(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда	
				ВыполнитьЗаменуПолейВНастройкахРекурсивно(ЭлементСтруктуры.Серии, СответствиеЗамен, ТипыГрупп);		
				ВыполнитьЗаменуПолейВНастройкахРекурсивно(ЭлементСтруктуры.Точки, СответствиеЗамен, ТипыГрупп);		
			КонецЕсли;	
		КонецЦикла;		
		
		мХранилищеВариантов.Сохранить(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, ИмяПользователя);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ВыполнитьЗаменуПолейВНастройкахРекурсивно(КоллекцияЭлементов, СответствиеЗамен, ТипыГрупп)
	
	Для Каждого ЭлементВыбор Из КоллекцияЭлементов Цикл 		
		Если ТипыГрупп.Найти(Тип(ЭлементВыбор)) <> Неопределено Тогда
			Если Тип(ЭлементВыбор) = Тип("ГруппировкаТаблицыКомпоновкиДанных") 
				Или Тип(ЭлементВыбор) = Тип("ГруппировкаКомпоновкиДанных") 
				Или Тип(ЭлементВыбор) = Тип("ГруппировкаДиаграммыКомпоновкиДанных")  Тогда
				ВыполнитьЗаменуПолейВНастройкахРекурсивно(ЭлементВыбор.ПоляГруппировки.Элементы, СответствиеЗамен, ТипыГрупп);	
				ВыполнитьЗаменуПолейВНастройкахРекурсивно(ЭлементВыбор.Структура, СответствиеЗамен, ТипыГрупп);	
			Иначе	
				ВыполнитьЗаменуПолейВНастройкахРекурсивно(ЭлементВыбор.Элементы, СответствиеЗамен, ТипыГрупп);	
			КонецЕсли;	
		Иначе								
			Если Тип(ЭлементВыбор) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				ПолеЗамены = СответствиеЗамен.Получить(ЭлементВыбор.ЛевоеЗначение);
				Если Не ПолеЗамены = Неопределено Тогда 
					ЭлементВыбор.ЛевоеЗначение = ПолеЗамены;	
				КонецЕсли;	
			Иначе				
				ПолеЗамены = СответствиеЗамен.Получить(ЭлементВыбор.Поле);
				Если Не ПолеЗамены = Неопределено Тогда 
					ЭлементВыбор.Поле = ПолеЗамены;	
				КонецЕсли;					
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры	

Процедура ЗаполнитьВерсиюУказанногоРегистра(ИмяРегистра, ПроектИзПЗ = Истина)
	
	Если ПроектИзПЗ Тогда
		ИмяПоляПроекта = "ПроектнаяЗадача.Проект";
	Иначе
		ИмяПоляПроекта = "Проект";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.Регистратор КАК Регистратор,
	|	Регистр.ИмяПоляПроекта КАК Проект
	|ПОМЕСТИТЬ РегистраторыИПроекты
	|ИЗ
	|	РегистрСведений.ИмяРегистра КАК Регистр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистраторыИПроекты.Регистратор КАК Регистратор,
	|	упоВерсииПроекта.Версия КАК Версия
	|ИЗ
	|	РегистраторыИПроекты КАК РегистраторыИПроекты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО РегистраторыИПроекты.Проект = упоВерсииПроекта.Проект
	|			И (упоВерсииПроекта.Текущая)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяРегистра", ИмяРегистра);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяПоляПроекта", ИмяПоляПроекта);
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);		
		НаборЗаписей.Прочитать();
		
		Версия = Выборка.Регистратор;
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Версия = Выборка.Версия;
		КонецЦикла;
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("упоНеПроверятьЗакрытыеЭтапы", Истина);
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать документ: %Регистратор% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Регистратор%", Выборка.Регистратор);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,,
				Выборка.Регистратор,
				ТекстСообщения);	
		КонецПопытки;
	КонецЦикла;	
		
КонецПроцедуры

Процедура РедактироватьНастройкуКолонокСтруктурыПроекта(КлючОбъекта, КлючНастроек, СтруктураНастроек,
	ПредставлениеНастройки, ИмяПользователя)
	
	Если НЕ ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СтруктураНастроек.Свойство("СписокКолонок") 
		Или Не ТипЗнч(СтруктураНастроек.СписокКолонок) = Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ВключитьКолонкуЗаданиеПодразделению = Ложь;
	мУдалить = Новый Массив;
	
	Для Каждого ЭлементСписка Из СтруктураНастроек.СписокКолонок Цикл
		Если ЭлементСписка.Значение = "СтатусЗаданияПодразделению"
			Или ЭлементСписка.Значение = "СтатусЗаданияНаПланирование"
			Или ЭлементСписка.Значение = "СтатусЗаданияНаПрогноз" Тогда
			
			Если ЭлементСписка.Пометка Тогда
				ВключитьКолонкуЗаданиеПодразделению = Истина;
			КонецЕсли;
			мУдалить.Добавить(ЭлементСписка);
		КонецЕсли;	
		Если ЭлементСписка.Значение = "ЗаданиеНаПланирование"
			Или ЭлементСписка.Значение = "ЗаданиеНаПрогноз" Тогда
			мУдалить.Добавить(ЭлементСписка);
		КонецЕсли;
	КонецЦикла;
		
	Для Каждого ЭлементУдалить Из мУдалить Цикл
		СтруктураНастроек.СписокКолонок.Удалить(ЭлементУдалить);
	КонецЦикла;
		
	Если ВключитьКолонкуЗаданиеПодразделению Тогда
		ЭлементСписка = СтруктураНастроек.СписокКолонок.НайтиПоЗначению("ЗаданиеПодразделению");
		Если ЭлементСписка = Неопределено Тогда
			ЭлементСписка = СтруктураНастроек.СписокКолонок.Добавить("ЗаданиеПодразделению", НСтр("ru = 'Задание'") + Символы.ПС + НСтр("ru = 'подразделению'"));
		КонецЕсли;	
		ЭлементСписка.Пометка = Истина;
	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("ПользовательскийПорядокКолонок") 
		И ТипЗнч(СтруктураНастроек.ПользовательскийПорядокКолонок) = Тип("СписокЗначений") Тогда
		
		мУдалить = Новый Массив;
		Если СтруктураНастроек.ПользовательскийПорядокКолонок.НайтиПоЗначению("ЗаданиеПодразделению") = Неопределено Тогда
			ЗаменаПроведена = Ложь;
		Иначе
			ЗаменаПроведена = Истина;
		КонецЕсли;
		
		Для Каждого ЭлементСписка Из СтруктураНастроек.ПользовательскийПорядокКолонок Цикл
			Если ЭлементСписка.Значение = "СтатусЗаданияПодразделению"
				Или ЭлементСписка.Значение = "СтатусЗаданияНаПланирование"
				Или ЭлементСписка.Значение = "СтатусЗаданияНаПрогноз"
				Или ЭлементСписка.Значение = "ЗаданиеНаПланирование"
				Или ЭлементСписка.Значение = "ЗаданиеНаПрогноз" Тогда
				
				Если Не ЗаменаПроведена Тогда
				 	СтруктураНастроек.ПользовательскийПорядокКолонок.Вставить(
						СтруктураНастроек.ПользовательскийПорядокКолонок.Индекс(ЭлементСписка),
						"ЗаданиеПодразделению",
						ЭлементСписка.Представление);
					ЗаменаПроведена = Истина;
				Иначе
					мУдалить.Добавить(ЭлементСписка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭлементУдалить Из мУдалить Цикл
			СтруктураНастроек.ПользовательскийПорядокКолонок.Удалить(ЭлементУдалить);
		КонецЦикла;
	
	КонецЕсли;
	
	ОписаниеНастройки = Новый ОписаниеНастроек();
	ОписаниеНастройки.Представление = ПредставлениеНастройки; 	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, СтруктураНастроек, ОписаниеНастройки, ИмяПользователя);
	
КонецПроцедуры

// Заполняет пустой регистр соответствия статусов проектной продукции процентам готовности.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура ЗаполнитьСоответствиеСтатусовПППроцентамГотовности()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ("ВЫБРАТЬ ПЕРВЫЕ 1
	                |	Таблица.СтатусПП КАК СтатусПП
	                |ИЗ
	                |	РегистрСведений.упоСоответствиеСтатусовПППроцентамГотовности КАК Таблица");
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	РегистрыСведений["упоСоответствиеСтатусовПППроцентамГотовности"].ЗаполнитьПоУмолчанию(Истина);
	
КонецПроцедуры

// Включает использование дополнительных реквизитов для справочника Проектная продукция.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура УстановитьПараметрыНабораСвойств_ПроектнаяПродукция()
	
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Справочник_упоПроектнаяПродукция");
	
КонецПроцедуры

// Обновляет данные регистра Причины отклонения для работы с новым полем.
// Логика инвертирована: поле Отмена = Истина перезаполняется данными УдалитьАктуально = Ложь.
//
Процедура ОбновитьДанныеРегистраПричинОтклонения() Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упоПричиныОтклонений.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.упоПричиныОтклонений КАК упоПричиныОтклонений
		|ГДЕ
		|	упоПричиныОтклонений.УдалитьАктуально = упоПричиныОтклонений.Отмена";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.упоПричиныОтклонений.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
		Набор.Прочитать();
		Для Каждого Запись Из Набор Цикл
			Запись.Отмена = Не Запись.УдалитьАктуально;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
		
	КонецЦикла;
	
КонецПроцедуры

#Область ИсправлениеДвиженийОбработкиПереносаПроектныхЗадач

Процедура ИсправитьВерсиюУказанногоРегистра(ИмяРегистра)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	упоПроцентыГотовностиПроектныхЗадач.Регистратор КАК Регистратор,
	               |	упоПроцентыГотовностиПроектныхЗадач.Регистратор.Проект КАК РегистраторПроект,
	               |	упоПроцентыГотовностиПроектныхЗадач.Версия КАК Версия
	               |ПОМЕСТИТЬ ДанныеСПроектомРегистратора
	               |ИЗ
	               |	РегистрСведений.упоПроцентыГотовностиПроектныхЗадач КАК упоПроцентыГотовностиПроектныхЗадач
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта1
	               |		ПО упоПроцентыГотовностиПроектныхЗадач.Версия = упоВерсииПроекта1.Версия
	               |			И (упоВерсииПроекта1.Текущая)
	               |ГДЕ
	               |	НЕ упоПроцентыГотовностиПроектныхЗадач.Регистратор ССЫЛКА Документ.упоПрогнозТрудозатратПоРолям
	               |	И НЕ упоПроцентыГотовностиПроектныхЗадач.Регистратор ССЫЛКА Документ.упоВерсияПланаПроекта
	               |	И упоПроцентыГотовностиПроектныхЗадач.Регистратор.Проект <> упоВерсииПроекта1.Проект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДанныеСПроектомРегистратора.Регистратор КАК Регистратор,
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ИЗ
	               |	ДанныеСПроектомРегистратора КАК ДанныеСПроектомРегистратора
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО ДанныеСПроектомРегистратора.РегистраторПроект = упоВерсииПроекта.Проект
	               |			И (упоВерсииПроекта.Текущая)";
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
									"НЕ упоПроцентыГотовностиПроектныхЗадач.Регистратор ССЫЛКА Документ.упоПрогнозТрудозатратПоРолям", 
									"ИСТИНА");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "упоПроцентыГотовностиПроектныхЗадач", ИмяРегистра);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
		НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);		
		НаборЗаписей.Прочитать();
		
		Версия = Выборка.Версия;
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Версия = Версия;
		КонецЦикла;
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);
		НаборЗаписей.ДополнительныеСвойства.Вставить("упоНеПроверятьЗакрытыеЭтапы", Истина);
			
		Попытка	
		
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
		Исключение
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать документ: %Регистратор% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Регистратор%", Выборка.Регистратор);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,,
				Выборка.Регистратор,
				ТекстСообщения);
			
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция ОсновнойТекстЗапроса()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоПроцентыГотовностиПроектныхЗадач.Версия КАК Версия,
	               |	упоПроцентыГотовностиПроектныхЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоПроцентыГотовностиПроектныхЗадач.ПроектнаяЗадача.Проект КАК ПроектПроектнойЗадачи,
	               |	""упоПроцентыГотовностиПроектныхЗадач"" КАК ИмяРегистра
	               |ПОМЕСТИТЬ ПроцентыГотовности
	               |ИЗ
	               |	РегистрСведений.упоПроцентыГотовностиПроектныхЗадач КАК упоПроцентыГотовностиПроектныхЗадач
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПроцентыГотовности.Версия КАК Версия,
	               |	ПроцентыГотовности.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ПроцентыГотовности.ПроектПроектнойЗадачи КАК ПроектПроектнойЗадачи,
	               |	упоВерсииПроекта.Проект КАК ПроектВерсии,
	               |	ПроцентыГотовности.ИмяРегистра КАК ИмяРегистра
	               |ПОМЕСТИТЬ БитыеДвиженияПроцентовГотовности
	               |ИЗ
	               |	ПроцентыГотовности КАК ПроцентыГотовности
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО ПроцентыГотовности.Версия = упоВерсииПроекта.Версия
	               |ГДЕ
	               |	ПроцентыГотовности.ПроектПроектнойЗадачи <> упоВерсииПроекта.Проект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоСтатусыПроектныхЗадач.Версия КАК Версия,
	               |	упоСтатусыПроектныхЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСтатусыПроектныхЗадач.ПроектнаяЗадача.Проект КАК ПроектПроектнойЗадачи,
	               |	""упоСтатусыПроектныхЗадач"" КАК ИмяРегистра
	               |ПОМЕСТИТЬ СтатусыЗадач
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектныхЗадач КАК упоСтатусыПроектныхЗадач
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СтатусыЗадач.Версия КАК Версия,
	               |	СтатусыЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	СтатусыЗадач.ПроектПроектнойЗадачи КАК ПроектПроектнойЗадачи,
	               |	упоВерсииПроекта.Проект КАК ПроектВерсии,
	               |	СтатусыЗадач.ИмяРегистра КАК ИмяРегистра
	               |ПОМЕСТИТЬ БитыеДвиженияСтатусовЗадач
	               |ИЗ
	               |	СтатусыЗадач КАК СтатусыЗадач
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО СтатусыЗадач.Версия = упоВерсииПроекта.Версия
	               |ГДЕ
	               |	СтатусыЗадач.ПроектПроектнойЗадачи <> упоВерсииПроекта.Проект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоФактическиеСроки.Версия КАК Версия,
	               |	упоФактическиеСроки.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоФактическиеСроки.ПроектнаяЗадача.Проект КАК ПроектПроектнойЗадачи,
	               |	""упоФактическиеДатыНачалаИОкончанияПроектныхЗадач"" КАК ИмяРегистра
	               |ПОМЕСТИТЬ ФактическиеСроки
	               |ИЗ
	               |	РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач КАК упоФактическиеСроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ФактическиеСроки.Версия КАК Версия,
	               |	ФактическиеСроки.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ФактическиеСроки.ПроектПроектнойЗадачи КАК ПроектПроектнойЗадачи,
	               |	упоВерсииПроекта.Проект КАК ПроектВерсии,
	               |	ФактическиеСроки.ИмяРегистра КАК ИмяРегистра
	               |ПОМЕСТИТЬ БитыеДвиженияФактическихСроков
	               |ИЗ
	               |	ФактическиеСроки КАК ФактическиеСроки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО ФактическиеСроки.Версия = упоВерсииПроекта.Версия
	               |ГДЕ
	               |	ФактическиеСроки.ПроектПроектнойЗадачи <> упоВерсииПроекта.Проект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	БитыеДвиженияПроцентовГотовности.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	БитыеДвиженияПроцентовГотовности.ПроектПроектнойЗадачи КАК ПроектПроектнойЗадачи,
	               |	БитыеДвиженияПроцентовГотовности.ИмяРегистра КАК ИмяРегистра
	               |ПОМЕСТИТЬ ПроектныеЗадачиДляПравкиДвижений
	               |ИЗ
	               |	БитыеДвиженияПроцентовГотовности КАК БитыеДвиженияПроцентовГотовности
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БитыеДвиженияСтатусовЗадач.ПроектнаяЗадача,
	               |	БитыеДвиженияСтатусовЗадач.ПроектПроектнойЗадачи,
	               |	БитыеДвиженияСтатусовЗадач.ИмяРегистра
	               |ИЗ
	               |	БитыеДвиженияСтатусовЗадач КАК БитыеДвиженияСтатусовЗадач
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БитыеДвиженияФактическихСроков.ПроектнаяЗадача,
	               |	БитыеДвиженияФактическихСроков.ПроектПроектнойЗадачи,
	               |	БитыеДвиженияФактическихСроков.ИмяРегистра
	               |ИЗ
	               |	БитыеДвиженияФактическихСроков КАК БитыеДвиженияФактическихСроков
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПроектныеЗадачиДляПравкиДвижений.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ПроектныеЗадачиДляПравкиДвижений.ПроектПроектнойЗадачи КАК ПроектПроектнойЗадачи
	               |ПОМЕСТИТЬ ДанныеПоКоторымНужноПолучитьСрезы
	               |ИЗ
	               |	ПроектныеЗадачиДляПравкиДвижений КАК ПроектныеЗадачиДляПравкиДвижений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект КАК Проект,
	               |	упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности КАК ПроцентГотовности
	               |ПОМЕСТИТЬ ПроцентыГотовностиСрезПоследнихПоПроектуПЗ
	               |ИЗ
	               |	РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В
	               |				(ВЫБРАТЬ
	               |					ДанныеПоКоторымНужноПолучитьСрезы.ПроектнаяЗадача
	               |				ИЗ
	               |					ДанныеПоКоторымНужноПолучитьСрезы)) КАК упоПроцентыГотовностиПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект = упоВерсииПроекта.Проект
	               |			И (упоВерсииПроекта.Текущая)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект КАК Проект,
	               |	упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности КАК ПроцентГотовности
	               |ПОМЕСТИТЬ ПроцентыГотовностиСрезПоследнихПоТекВерсии
	               |ИЗ
	               |	РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В
	               |				(ВЫБРАТЬ
	               |					ДанныеПоКоторымНужноПолучитьСрезы.ПроектнаяЗадача
	               |				ИЗ
	               |					ДанныеПоКоторымНужноПолучитьСрезы)) КАК упоПроцентыГотовностиПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта1
	               |		ПО упоПроцентыГотовностиПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта1.Версия
	               |			И (упоВерсииПроекта1.Текущая)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ПроцентыГотовностиСрезПоследнихПоПроектуПЗ.Проект, ПроцентыГотовностиСрезПоследнихПоТекВерсии.Проект) КАК Проект,
	               |	ЕСТЬNULL(ПроцентыГотовностиСрезПоследнихПоПроектуПЗ.ПроектнаяЗадача, ПроцентыГотовностиСрезПоследнихПоТекВерсии.ПроектнаяЗадача) КАК ПроектнаяЗадача,
	               |	ЕСТЬNULL(ПроцентыГотовностиСрезПоследнихПоПроектуПЗ.ПроцентГотовности, ПроцентыГотовностиСрезПоследнихПоТекВерсии.ПроцентГотовности) КАК ПроцентГотовности
	               |ПОМЕСТИТЬ ПроцентыГотовностиСрезПоследних
	               |ИЗ
	               |	ПроцентыГотовностиСрезПоследнихПоПроектуПЗ КАК ПроцентыГотовностиСрезПоследнихПоПроектуПЗ
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ПроцентыГотовностиСрезПоследнихПоТекВерсии КАК ПроцентыГотовностиСрезПоследнихПоТекВерсии
	               |		ПО ПроцентыГотовностиСрезПоследнихПоПроектуПЗ.ПроектнаяЗадача = ПроцентыГотовностиСрезПоследнихПоТекВерсии.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект КАК Проект,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК СтатусЗадачи
	               |ПОМЕСТИТЬ СтатусыЗадачСрезПоследнихПоПроектуПЗ
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В
	               |				(ВЫБРАТЬ
	               |					ДанныеПоКоторымНужноПолучитьСрезы.ПроектнаяЗадача
	               |				ИЗ
	               |					ДанныеПоКоторымНужноПолучитьСрезы)) КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект = упоВерсииПроекта.Проект
	               |			И (упоВерсииПроекта.Текущая)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект КАК Проект,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК СтатусЗадачи
	               |ПОМЕСТИТЬ СтатусыЗадачСрезПоследнихПоТекВерсии
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В
	               |				(ВЫБРАТЬ
	               |					ДанныеПоКоторымНужноПолучитьСрезы.ПроектнаяЗадача
	               |				ИЗ
	               |					ДанныеПоКоторымНужноПолучитьСрезы)) КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта1
	               |		ПО упоСтатусыПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта1.Версия
	               |			И (упоВерсииПроекта1.Текущая)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(СтатусыЗадачСрезПоследнихПоПроектуПЗ.Проект, СтатусыЗадачСрезПоследнихПоТекВерсии.Проект) КАК Проект,
	               |	ЕСТЬNULL(СтатусыЗадачСрезПоследнихПоПроектуПЗ.ПроектнаяЗадача, СтатусыЗадачСрезПоследнихПоТекВерсии.ПроектнаяЗадача) КАК ПроектнаяЗадача,
	               |	ЕСТЬNULL(СтатусыЗадачСрезПоследнихПоПроектуПЗ.СтатусЗадачи, СтатусыЗадачСрезПоследнихПоТекВерсии.СтатусЗадачи) КАК СтатусЗадачи
	               |ПОМЕСТИТЬ СтатусыЗадачСрезПоследних
	               |ИЗ
	               |	СтатусыЗадачСрезПоследнихПоПроектуПЗ КАК СтатусыЗадачСрезПоследнихПоПроектуПЗ
	               |		ПОЛНОЕ СОЕДИНЕНИЕ СтатусыЗадачСрезПоследнихПоТекВерсии КАК СтатусыЗадачСрезПоследнихПоТекВерсии
	               |		ПО СтатусыЗадачСрезПоследнихПоПроектуПЗ.ПроектнаяЗадача = СтатусыЗадачСрезПоследнихПоТекВерсии.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект КАК Проект,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаНачала КАК ДатаНачала,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаЗавершения КАК ДатаЗавершения
	               |ПОМЕСТИТЬ ФактСрокиСрезПоследнихПоПроектуПЗ
	               |ИЗ
	               |	РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В
	               |				(ВЫБРАТЬ
	               |					ДанныеПоКоторымНужноПолучитьСрезы.ПроектнаяЗадача
	               |				ИЗ
	               |					ДанныеПоКоторымНужноПолучитьСрезы)) КАК упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект = упоВерсииПроекта.Проект
	               |			И (упоВерсииПроекта.Текущая)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект КАК Проект,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаНачала КАК ДатаНачала,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаЗавершения КАК ДатаЗавершения
	               |ПОМЕСТИТЬ ФактСрокиСрезПоследнихПоТекВерсии
	               |ИЗ
	               |	РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В
	               |				(ВЫБРАТЬ
	               |					ДанныеПоКоторымНужноПолучитьСрезы.ПроектнаяЗадача
	               |				ИЗ
	               |					ДанныеПоКоторымНужноПолучитьСрезы)) КАК упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта1
	               |		ПО упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта1.Версия
	               |			И (упоВерсииПроекта1.Текущая)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ФактСрокиСрезПоследнихПоПроектуПЗ.Проект, ФактСрокиСрезПоследнихПоТекВерсии.Проект) КАК Проект,
	               |	ЕСТЬNULL(ФактСрокиСрезПоследнихПоПроектуПЗ.ПроектнаяЗадача, ФактСрокиСрезПоследнихПоТекВерсии.ПроектнаяЗадача) КАК ПроектнаяЗадача,
	               |	ЕСТЬNULL(ФактСрокиСрезПоследнихПоПроектуПЗ.ДатаНачала, ФактСрокиСрезПоследнихПоТекВерсии.ДатаНачала) КАК ДатаНачала,
	               |	ЕСТЬNULL(ФактСрокиСрезПоследнихПоПроектуПЗ.ДатаЗавершения, ФактСрокиСрезПоследнихПоТекВерсии.ДатаЗавершения) КАК ДатаЗавершения
	               |ПОМЕСТИТЬ ФактСрокиСрезПоследних
	               |ИЗ
	               |	ФактСрокиСрезПоследнихПоПроектуПЗ КАК ФактСрокиСрезПоследнихПоПроектуПЗ
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ФактСрокиСрезПоследнихПоТекВерсии КАК ФактСрокиСрезПоследнихПоТекВерсии
	               |		ПО ФактСрокиСрезПоследнихПоПроектуПЗ.ПроектнаяЗадача = ФактСрокиСрезПоследнихПоТекВерсии.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПроцентыГотовностиСрезПоследних.Проект КАК Проект,
	               |	ПроцентыГотовностиСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ПроцентыГотовностиСрезПоследних.ПроцентГотовности КАК ПроцентГотовности,
	               |	NULL КАК СтатусЗадачи,
	               |	NULL КАК ДатаНачала,
	               |	NULL КАК ДатаЗавершения
	               |ПОМЕСТИТЬ СрезыПоследнихПоВыбраннымРегистрам
	               |ИЗ
	               |	ПроцентыГотовностиСрезПоследних КАК ПроцентыГотовностиСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СтатусыЗадачСрезПоследних.Проект,
	               |	СтатусыЗадачСрезПоследних.ПроектнаяЗадача,
	               |	NULL,
	               |	СтатусыЗадачСрезПоследних.СтатусЗадачи,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	СтатусыЗадачСрезПоследних КАК СтатусыЗадачСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ФактСрокиСрезПоследних.Проект,
	               |	ФактСрокиСрезПоследних.ПроектнаяЗадача,
	               |	NULL,
	               |	NULL,
	               |	ФактСрокиСрезПоследних.ДатаНачала,
	               |	ФактСрокиСрезПоследних.ДатаЗавершения
	               |ИЗ
	               |	ФактСрокиСрезПоследних КАК ФактСрокиСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СрезыПоследнихПоВыбраннымРегистрам.Проект КАК Проект,
	               |	СрезыПоследнихПоВыбраннымРегистрам.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	МАКСИМУМ(СрезыПоследнихПоВыбраннымРегистрам.ПроцентГотовности) КАК ПроцентГотовности,
	               |	МАКСИМУМ(СрезыПоследнихПоВыбраннымРегистрам.СтатусЗадачи) КАК СтатусЗадачи,
	               |	МАКСИМУМ(СрезыПоследнихПоВыбраннымРегистрам.ДатаНачала) КАК ДатаНачала,
	               |	МАКСИМУМ(СрезыПоследнихПоВыбраннымРегистрам.ДатаЗавершения) КАК ДатаЗавершения
	               |ИЗ
	               |	СрезыПоследнихПоВыбраннымРегистрам КАК СрезыПоследнихПоВыбраннымРегистрам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СрезыПоследнихПоВыбраннымРегистрам.Проект,
	               |	СрезыПоследнихПоВыбраннымРегистрам.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПроектныеЗадачиДляПравкиДвижений.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ПроектныеЗадачиДляПравкиДвижений.ПроектПроектнойЗадачи КАК Проект,
	               |	ПроектныеЗадачиДляПравкиДвижений.ИмяРегистра КАК ИмяРегистра,
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ИЗ
	               |	ПроектныеЗадачиДляПравкиДвижений КАК ПроектныеЗадачиДляПравкиДвижений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО ПроектныеЗадачиДляПравкиДвижений.ПроектПроектнойЗадачи = упоВерсииПроекта.Проект
	               |			И (упоВерсииПроекта.Текущая)
	               |ИТОГИ ПО
	               |	Проект";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ИсправитьБитыеДвижения(ПрогрессВыполнения)
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = ОсновнойТекстЗапроса();
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ИндексПоследнегоЗапроса = РезультатЗапроса.ВГраница();
	
	ДанныеПоСрезуПоследних = РезультатЗапроса[ИндексПоследнегоЗапроса - 1].Выгрузить();
	ДанныеПоСрезуПоследних.Индексы.Добавить("Проект");
	
	ВыборкаПроекты = РезультатЗапроса[ИндексПоследнегоЗапроса].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПрогрессВыполнения.ВсегоОбъектов = ВыборкаПроекты.Количество();
	ПрогрессВыполнения.ОбработаноОбъектов = 0;
	
	Пока ВыборкаПроекты.Следующий() Цикл
		
		Проект = ВыборкаПроекты.Проект;		
		Ошибка = Ложь;
		ТекстОшибки = Неопределено;
		
		НачатьТранзакцию();
		
		Выборка = ВыборкаПроекты.Выбрать();
		Пока Выборка.Следующий() Цикл
			УдалитьДанныеВсехВерсий(Выборка.ПроектнаяЗадача, Выборка.Версия,
				Выборка.ИмяРегистра, Ошибка, ТекстОшибки);
		КонецЦикла;
		
		СоздатьДокументыРА(Проект, ДанныеПоСрезуПоследних, Ошибка, ТекстОшибки);
		
		Если НЕ Ошибка Тогда
			Попытка
				ЗафиксироватьТранзакцию();
			Исключение
				Ошибка = Истина;
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;	
		ИначеЕсли ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		Если Ошибка Тогда
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать данные по проекту ""%проект%"" по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%проект%", Проект);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ТекстОшибки);
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,,
				Проект,
				ТекстСообщения);
						
		КонецЕсли;
		
		ПрогрессВыполнения.ОбработаноОбъектов = ПрогрессВыполнения.ОбработаноОбъектов + 1;
		
	КонецЦикла;
		
КонецПроцедуры

Функция УдалитьДанныеВсехВерсий(ПроектнаяЗадачаСсылка, ВерсияПроектаКуда, ИмяРегистра, Ошибка, ТекстОшибки)
	
	Если Ошибка Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	ДвиженияМетаданные = Метаданные.РегистрыСведений[ИмяРегистра];	
	
	ОбработатьЭлементКоллекцииДвижений(ПроектнаяЗадачаСсылка, ДвиженияМетаданные, 
		ВерсияПроектаКуда, Ошибка, ТекстОшибки);
		
КонецФункции

Процедура ОбработатьЭлементКоллекцииДвижений(ПроектнаяЗадачаСсылка, ДвиженияМетаданные, 
	ВерсияПроектаКуда, Ошибка, ТекстОшибки) 
	
	Если Ошибка Тогда
		Возврат;
	КонецЕсли;
	
	ПодчинениеРегистратору = 
		ДвиженияМетаданные.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору;
		
	Если Не ПодчинениеРегистратору Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРегистра = ДвиженияМетаданные.Имя; 
	
	ИмяПоляЗадачи = "ПроектнаяЗадача";
	
	Если ДвиженияМетаданные.Измерения.Найти(ИмяПоляЗадачи) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.Содержит(ДвиженияМетаданные) Тогда
		ТипРегистра = "РегистрСведений";
		МенеджерРегистра = РегистрыСведений;
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(ДвиженияМетаданные) Тогда
		ТипРегистра = "РегистрНакопления";
		МенеджерРегистра = РегистрыНакопления;
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(ДвиженияМетаданные) Тогда
		ТипРегистра = "РегистрБухгалтерии";
		МенеджерРегистра = РегистрыБухгалтерии;
	КонецЕсли;
	
	ПолеОтбора = "Регистратор";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр."+ПолеОтбора+" КАК "+ПолеОтбора+"
	|ИЗ
	|	"+ТипРегистра+"."+ИмяРегистра+" КАК Регистр
	|ГДЕ
	|	Регистр."+ИмяПоляЗадачи+" = &ПроектнаяЗадача";
	
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадачаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПолноеИмяОбъекта = ТипРегистра + "." + ИмяРегистра;
	
	Пока Выборка.Следующий() Цикл	
				
		НаборЗаписей = МенеджерРегистра[ИмяРегистра].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор[ПолеОтбора].Установить(Выборка[ПолеОтбора]);		
		
		НаборЗаписей.Прочитать();	
		
		Регистратор = Выборка.Регистратор;
		
		ОтдельнаяОбработка = ОтдельнаяОбработкаНабораЗаписей(Регистратор, НаборЗаписей, ПроектнаяЗадачаСсылка, ИмяПоляЗадачи,
		ВерсияПроектаКуда);
		
		Если Не ОтдельнаяОбработка Тогда			
			УдалитьЗаписиПоПроектнойЗадачи(Регистратор, НаборЗаписей, ПроектнаяЗадачаСсылка, ИмяПоляЗадачи);			
		КонецЕсли;			
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);
		НаборЗаписей.ДополнительныеСвойства.Вставить("упоУдалениеЛишнихДвиженийВерсии", Истина);			
			
		Попытка	
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
		Исключение
			
			Ошибка = Истина;
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Возврат;
			
		КонецПопытки;
			
	КонецЦикла;	
	
КонецПроцедуры

Функция ОтдельнаяОбработкаНабораЗаписей(Регистратор, НаборЗаписей, ПроектнаяЗадачаСсылка, ИмяПоляЗадачи, 
	ВерсияПроектаКуда) 
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Возврат Ложь;
	КонецЕсли;	

	Если ТипЗнч(Регистратор) <> Тип("ДокументСсылка.упоПрогнозТрудозатратПоРолям") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись[ИмяПоляЗадачи] = ПроектнаяЗадачаСсылка Тогда
			Запись.Версия = ВерсияПроектаКуда;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура УдалитьЗаписиПоПроектнойЗадачи(Регистратор, НаборЗаписей, ПроектнаяЗадачаСсылка, ИмяПоляЗадачи) 
		
	МассивЗаписейНаУдаление = Новый Массив;
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись[ИмяПоляЗадачи] = ПроектнаяЗадачаСсылка Тогда
			МассивЗаписейНаУдаление.Добавить(Запись);	
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Запись Из МассивЗаписейНаУдаление Цикл
		НаборЗаписей.Удалить(Запись);
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьДокументыРА(Проект, ДанныеПоСрезуПоследних, Ошибка, ТекстОшибки)
	
	ДанныеПоПроектнымЗадачамПроекта = ДанныеПоСрезуПоследних.НайтиСтроки(Новый Структура("Проект", Проект));
	
	Если ДанныеПоПроектнымЗадачамПроекта.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ДокументАктуализации = Документы.упоРучнаяАктуализацияПроекта.СоздатьДокумент();
	ДокументАктуализации.Проект = Проект;
	
	Для Каждого СтрокаДанных Из ДанныеПоПроектнымЗадачамПроекта Цикл
				
		СтрокаТЧ = ДокументАктуализации.ПроектныеЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаДанных);
				
	КонецЦикла;
	
	ТекстКомментария = 
		НСтр("ru = 'Создан автоматически обработкой ""%1"" для корректировки движений перенесенных задач.'");
	СинонимОбработки = Метаданные.Обработки.упоПереносПроектныхЗадач.Синоним;
	ТекстКомментария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстКомментария, СинонимОбработки);
	ДокументАктуализации.Комментарий = ТекстКомментария;
	ДокументАктуализации.Дата = ТекущаяДата();
	ДокументАктуализации.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);
	
	Попытка 		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументАктуализации, 
													Ложь, 
													Истина, 
													РежимЗаписиДокумента.Проведение);		
	Исключение
		Ошибка = Истина;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат;
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти

#Область ИменованиеТекущейПодсистемыPM

// В процессе обновления PM Профа было изменено имя подсистемы, этот обработчик восстанавливает имя подсистемы.
// Предназначен для PM Профа.
// 
Процедура ИзменитьИмяПодсистемыКОРПНаПРОФ(Параметры = Неопределено) Экспорт
	
	ЕстьПодсистемаКОРП = ОпределитьЕстьИмяПодсистемыКОРПВРегистреВерсии();
	Если Не ЕстьПодсистемаКОРП Тогда		
		Возврат;
	КонецЕсли;	
	
	ИмяПодсистемыКОРП = ПолучитьИмяПодсистемыPM_КОРП();
	ИмяПодсистемыПРОФ = ПолучитьИмяПодсистемыPM_ПРОФ();
	
	// Удалить, если есть запись с ПРОФом
	МенеджерЗаписи = РегистрыСведений.ВерсииПодсистем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяПодсистемы = ИмяПодсистемыПРОФ;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();		
	КонецЕсли;
	
	// Переименовать имя подсистемы КОРП
	МенеджерЗаписи = РегистрыСведений.ВерсииПодсистем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяПодсистемы = ИмяПодсистемыКОРП;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.ИмяПодсистемы = ИмяПодсистемыПРОФ;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Функция ПолучитьИмяПодсистемыPM_КОРП()
	
	Возврат "УправлениеПроектамиКОРП";	
	
КонецФункции

Функция ПолучитьИмяПодсистемыPM_ПРОФ()
	
	Возврат "УправлениеПроектамиПРОФ";	
	
КонецФункции

// Метод предназначен для корректного получения имени текущей подсистемы PM. Т.к. имя подсистемы в регистре
// ВерсииПодсистем было изменено обработчиком обновления ИзменитьИмяПодсистемыКОРПНаПРОФ
//
Функция ПолучитьИмяПодсистемы()
			
	ИмяПодсистемы = ПолучитьИмяПодсистемыPM_КОРП();
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Возврат ИмяПодсистемы;
	КонецЕсли;
	
	ЕстьПодсистемаКОРП = ОпределитьЕстьИмяПодсистемыКОРПВРегистреВерсии();
	Если ЕстьПодсистемаКОРП Тогда
		Возврат ИмяПодсистемы;
	КонецЕсли;
	
	ИмяПодсистемы = ПолучитьИмяПодсистемыPM_ПРОФ();
	Возврат ИмяПодсистемы;
	
КонецФункции

Функция ОпределитьЕстьИмяПодсистемыКОРПВРегистреВерсии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииПодсистем.ИмяПодсистемы КАК ИмяПодсистемы
		|ИЗ
		|	РегистрСведений.ВерсииПодсистем КАК ВерсииПодсистем
		|ГДЕ
		|	ВерсииПодсистем.ИмяПодсистемы = &ИмяПодсистемы";
	
	ИмяПодсистемы = ПолучитьИмяПодсистемыPM_КОРП();
	Запрос.УстановитьПараметр("ИмяПодсистемы", ИмяПодсистемы);
	
	// ПривилегированныйРежим необходим для запуска и работы УНФ+PM под пользователями с неполными правами, 
	// т.к. этот метод вызывается при запуске конфигурации из МодульУправляемогоПриложения.ПередНачаломРаботыСистемы()
	// и Отчет.упоДинамикаЭкономикиПроекта.Форма.ФормаОтчетаРабочегоСтола.Форма.ПриСозданииНаСервере
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

// см. ПриДобавленииОбработчиковОбновления()
// Выполняется только для конфигурации ERP+PM.
//
Процедура ПриДобавленииОбработчиковОбновления_EPM(Обработчики)
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыEPM.ЗаполнитьПустуюИБ";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыEPM.ВключитьИспользованиеПроектов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.0.0.9";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоИнтеграция.СинхронизироватьВсеСтатьиДР";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.1.2.3";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоИнтеграция.СинхронизироватьВсеПодразделенияИСтруктурыПредприятия";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.0.0.20";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыEPM.ПеренестиДопРеквизитыИСвойстваВКорректныеНаборы";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.1.1";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоИнтеграция.СинхронизироватьВсеСтатьиДР";
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM_2_5(Истина) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "4.2.4.2";
		Обработчик.РежимВыполнения = "Монопольно";
		Обработчик.Процедура = "упоИнтеграцияEPMСервер.ЗаполнитьХозОперациюФактДоходовРасходовПроектногоБюджетирования";
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.12.6";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоИнтеграцияEPMСервер.ЗаполнитьНаправлениеДвиженияСтатейДДС";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.14.15";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыEPM.ЗаполнитьПолеСтатусВДоговорахРегистрацииЮридическихУсловий";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.17.15";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыEPM.ОбновитьПравилаПолученияФактаПоМакетам";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8739d400-9513-42a9-a337-d984aade229b");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление правил получения факта проектного бюджетирования из поставляемых макетов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "4.2.21.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "упоИнтеграцияEPMСервер.ЗаполнитьХозОперациюФактДоходовРасходовПроектногоБюджетирования";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4a594bfe-a23b-4e64-9027-84ddfa568f39");
	Обработчик.Комментарий = 
		НСтр("ru = 'Заполнение предопределенного элемента ""Факт проектного бюджетирования"" '") + 
		НСтр("ru = 'справочника ""Настройки хозяйственных операций"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.21.7";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.СинхронизироватьСценарии";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.22.7";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыPMO.ОбновитьОпцииСвязанныхНД";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "4.2.27.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыEPM.ЗаполнитьСтатусыДоговоровERP";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a5d0518c-bc24-4d71-80e8-a6f78aedfdb7");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление ERP статусов договоров по статусам договоров PM.'");
	
КонецПроцедуры

Процедура СоздатьВерсииДополнительныхРеквизитов() Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалВерсионированиеДопРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачальнойВерсии = '20010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.упоДополнительныеРеквизитыВерсии КАК упоДополнительныеРеквизитыВерсии
	|ГДЕ
	|	упоДополнительныеРеквизитыВерсии.Период = &Период";
	
	Запрос.УстановитьПараметр("Период", ДатаНачальнойВерсии);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упоДанныеПроектнойПродукции.ПроектнаяПродукция КАК ПроектнаяПродукция,
	|	упоДанныеПроектнойПродукции.Версия КАК Версия
	|ПОМЕСТИТЬ ВерсииПроектнойПродукции
	|ИЗ
	|	РегистрСведений.упоДанныеПроектнойПродукции КАК упоДанныеПроектнойПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВерсииПроектнойПродукции.Версия КАК Версия,
	|	упоПроектнаяПродукцияДополнительныеРеквизиты.Ссылка КАК Объект,
	|	упоПроектнаяПродукцияДополнительныеРеквизиты.Свойство КАК Свойство,
	|	упоПроектнаяПродукцияДополнительныеРеквизиты.Значение КАК Значение,
	|	ИСТИНА КАК Действует,
	|	&Автор КАК Автор,
	|	&Период КАК Период
	|ИЗ
	|	Справочник.упоПроектнаяПродукция.ДополнительныеРеквизиты КАК упоПроектнаяПродукцияДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВерсииПроектнойПродукции КАК ВерсииПроектнойПродукции
	|		ПО упоПроектнаяПродукцияДополнительныеРеквизиты.Ссылка = ВерсииПроектнойПродукции.ПроектнаяПродукция
	|ИТОГИ ПО
	|	Версия";
	
	Запрос.УстановитьПараметр("Автор", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Период", ДатаНачальнойВерсии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВерсия = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВерсия.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений["упоДополнительныеРеквизитыВерсии"].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Версия.Установить(ВыборкаВерсия.Версия);
		НаборЗаписей.Отбор.Период.Установить(ДатаНачальнойВерсии);

		Выборка = ВыборкаВерсия.Выбрать();
		Пока Выборка.Следующий() Цикл    
			ЗаписьНабора = НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, Выборка);
		КонецЦикла;  
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроектныеЗадачиДляПересчетаТрудозатрат()
	
	СтатусыИсключения = Новый Массив;
    ПроектныеЗадачиДляПересчета = Новый Массив;

	Если Константы.упоСтрогийКонтрольИзмененияЗакрытыхЭтапов.Получить() Тогда
		СтатусыИсключения.Добавить(Перечисления.упоСостояниеСтатусаЗадачи.Закрыта);
	КонецЕсли;	
	
  	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСтатусов", СтатусыИсключения);

	Запрос.Текст = "ВЫБРАТЬ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСвойстваПроектныхЗадачСрезПоследних.Длительность КАК ДлительностьЗадачиЧас,
	|	ВЫБОР
	|		КОГДА упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
	|			ТОГДА упоКалендариПроектовСрезПоследних.КалендарьПроекта
	|		ИНАЧЕ упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи
	|	КОНЕЦ КАК КалендарьЗадачи,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачала,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершения
	|ПОМЕСТИТЬ ВТ_СвойстваПЗ
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК упоКалендариПроектовСрезПоследних
	|			ПО упоВерсииПроекта.Проект = упоКалендариПроектовСрезПоследних.Проект
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК упоСрокиПроектныхЗадачСрезПоследних
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоСрокиПроектныхЗадачСрезПоследних.Версия
	|			И упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(, ) КАК упоСтатусыПроектныхЗадачСрезПоследних
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоСтатусыПроектныхЗадачСрезПоследних.Версия
	|			И упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|ГДЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.Длительность > 8
	|	И НЕ упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи В (&МассивСтатусов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СвойстваПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ВТ_СвойстваПЗ.ДлительностьЗадачиЧас КАК ДлительностьЗадачиЧас,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упоРабочиеКалендари.День) КАК РабочиеДниЗадачи
	|ПОМЕСТИТЬ ВТ_ДлительностьЗадачВРабочихДнях
	|ИЗ
	|	ВТ_СвойстваПЗ КАК ВТ_СвойстваПЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРабочиеКалендари КАК упоРабочиеКалендари
	|		ПО ВТ_СвойстваПЗ.КалендарьЗадачи = упоРабочиеКалендари.Календарь
	|ГДЕ
	|	упоРабочиеКалендари.День >= ВТ_СвойстваПЗ.ДатаНачала
	|	И упоРабочиеКалендари.День <= ВТ_СвойстваПЗ.ДатаЗавершения
	|	И упоРабочиеКалендари.КоличествоЧасов > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СвойстваПЗ.ПроектнаяЗадача,
	|	ВТ_СвойстваПЗ.ДлительностьЗадачиЧас
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.КоличествоЧасов > ВТ_ДлительностьЗадачВРабочихДнях.ДлительностьЗадачиЧас
	|				ТОГДА упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.КоличествоЧасов
	|			ИНАЧЕ ВТ_ДлительностьЗадачВРабочихДнях.ДлительностьЗадачиЧас
	|		КОНЕЦ / ВТ_ДлительностьЗадачВРабочихДнях.РабочиеДниЗадачи КАК ЧИСЛО(15, 2)) КАК СредняяДлительностьДня,
	|	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс КАК Ресурс,
	|	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.УровеньПланирования КАК УровеньПланирования
	|ПОМЕСТИТЬ ВТ_СредняяДлительностьДняЗадач
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК упоАктуальныеПланыТрудозатратСводноТекущаяВерсия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДлительностьЗадачВРабочихДнях КАК ВТ_ДлительностьЗадачВРабочихДнях
	|		ПО упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача = ВТ_ДлительностьЗадачВРабочихДнях.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_СредняяДлительностьДняЗадач КАК ВТ_СредняяДлительностьДняЗадач
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия
	|		ПО ВТ_СредняяДлительностьДняЗадач.ПроектнаяЗадача = упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция
	|			И ВТ_СредняяДлительностьДняЗадач.Ресурс = упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс
	|			И ВТ_СредняяДлительностьДняЗадач.УровеньПланирования = упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.УровеньПланирования
	|ГДЕ
	|	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Трудозатраты - ВТ_СредняяДлительностьДняЗадач.СредняяДлительностьДня >= 1
	|	И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Трудозатраты > 8";
				   	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПроектныеЗадачиДляПересчета;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл    		
		ПроектныеЗадачиДляПересчета.Добавить(Выборка.ПроектнаяЗадача); 		
	КонецЦикла; 	   
	
	Возврат ПроектныеЗадачиДляПересчета;
	
КонецФункции

Функция ПроектныеЗадачиДляЗаполненияИсточникаПланаТрудозатрат()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|   упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
		|ИЗ
		|   РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия.Текущая) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|ГДЕ
		|   упоСвойстваПроектныхЗадачСрезПоследних.ТранслироватьЗатратыПоСубпродуктам
		|           И НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ПроектныеЗадачиДляОбработки = РезультатЗапроса.ВыгрузитьКолонку("ПроектнаяЗадача");
	
	Возврат ПроектныеЗадачиДляОбработки;
	
КонецФункции

// Установка признака "Используется" у предопределенных дополнительных реквизитов подсистемы РМ
Процедура ВключитьИспользованиеПредопределенныхДополнительныхРеквизитов(Параметры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка,
	               	|	НаборыДополнительныхРеквизитовИСведений.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	               	|	НаборыДополнительныхРеквизитовИСведений.Используется КАК Используется
	               	|ИЗ
	               	|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	               	|ГДЕ
	               	|	НаборыДополнительныхРеквизитовИСведений.Предопределенный";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Предопределенные наборы доп. реквизитов для объектов, которых нет в РМ Проф
	СтруктураИсключений = Новый Структура;
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		СтруктураИсключений.Вставить("Справочник_упоВидДоговора");
		СтруктураИсключений.Вставить("Документ_упоСогласованиеТрудозатрат");
		СтруктураИсключений.Вставить("Документ_упоРегистрацияЮридическихУсловийДоговора");
		СтруктураИсключений.Вставить("Справочник_упоРискиПроектов");
		СтруктураИсключений.Вставить("Справочник_упоШаблоныРисковПроектов");
		СтруктураИсключений.Вставить("Документ_упоЗаявкаНаПроект");
		СтруктураИсключений.Вставить("Справочник_упоПравилаЗаполненияПараметров");
		СтруктураИсключений.Вставить("Справочник_упоПравилаФормированияНаименованийДоговоров");
		СтруктураИсключений.Вставить("Справочник_упоПроектнаяПродукция");
		СтруктураИсключений.Вставить("Документ_упоРасчетИтоговогоБаллаПроектов");
		СтруктураИсключений.Вставить("Документ_упоРасчетЦеныКонтракта");
		СтруктураИсключений.Вставить("Документ_упоРегистрацияПоказателейЭффективностиПроекта");
		СтруктураИсключений.Вставить("Справочник_упоСвязиОбъектовСистемыИФайлов");
		СтруктураИсключений.Вставить("Документ_упоСоответствиеСтратегическимЦелям");
		СтруктураИсключений.Вставить("Справочник_упоПрофилиНастроекПрогнозаТрудозатратПоРолям");
		СтруктураИсключений.Вставить("Справочник_упоСтатусыОбъектов");
		СтруктураИсключений.Вставить("Справочник_упоФазыПроектов");
		СтруктураИсключений.Вставить("Документ_упоФормированиеБизнесПлана");
		СтруктураИсключений.Вставить("Справочник_упоЭтапыДоговоров");
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если СтрНайти(Выборка.ИмяПредопределенныхДанных, "_упо") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Используется = Истина;
		Если СтруктураИсключений.Свойство(Выборка.ИмяПредопределенныхДанных) Тогда
			Используется = Ложь;
		КонецЕсли;
		
		Если Выборка.Используется = Используется Тогда
			Продолжить;
		КонецЕсли;
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Используется = Используется;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроектныеЗадачиДляПересчетаТрудозатратСДублямиРолей()
	
    ПроектныеЗадачиДляПересчета = Новый Массив;
	
  	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс КАК Ресурс,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.УровеньПланирования КАК УровеньПланирования,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение КАК Подразделение,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Количество КАК Количество,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость КАК ОбщСтоимость,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщВнешняяСтоимость КАК ОбщВнешняяСтоимость
	               |ПОМЕСТИТЬ ВТ_ДанныеПлановТрудозатрат
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(, СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоДанныеПлановТрудозатратРолейСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)
	               |ГДЕ
	               |	(упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
	               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость <> 0
	               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщВнешняяСтоимость <> 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеПлановСгруппированные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ДанныеПлановСгруппированные.Ресурс КАК Ресурс,
	               |	ДанныеПлановСгруппированные.УровеньПланирования КАК УровеньПланирования,
	               |	ДанныеПлановСгруппированные.Подразделение КАК Подразделение,
	               |	ДанныеПлановСгруппированные.Количество КАК Количество,
	               |	ДанныеПлановСгруппированные.ОбщСтоимость КАК ОбщСтоимость,
	               |	ДанныеПлановСгруппированные.ОбщВнешняяСтоимость КАК ОбщВнешняяСтоимость
	               |ПОМЕСТИТЬ ВТ_ДанныеПлановТрудозатратСгруппированнные
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ДанныеПлановТрудозатрат.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |		ВТ_ДанныеПлановТрудозатрат.Ресурс КАК Ресурс,
	               |		ВТ_ДанныеПлановТрудозатрат.УровеньПланирования КАК УровеньПланирования,
	               |		ВТ_ДанныеПлановТрудозатрат.Подразделение КАК Подразделение,
	               |		КОЛИЧЕСТВО(ВТ_ДанныеПлановТрудозатрат.Ресурс) КАК РесурсКоличество,
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДанныеПлановТрудозатрат.Ресурс) КАК РесурсКоличествоРазличные,
	               |		СУММА(ВТ_ДанныеПлановТрудозатрат.Количество) КАК Количество,
	               |		СУММА(ВТ_ДанныеПлановТрудозатрат.ОбщСтоимость) КАК ОбщСтоимость,
	               |		СУММА(ВТ_ДанныеПлановТрудозатрат.ОбщВнешняяСтоимость) КАК ОбщВнешняяСтоимость
	               |	ИЗ
	               |		ВТ_ДанныеПлановТрудозатрат КАК ВТ_ДанныеПлановТрудозатрат
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ДанныеПлановТрудозатрат.ПроектнаяЗадача,
	               |		ВТ_ДанныеПлановТрудозатрат.Ресурс,
	               |		ВТ_ДанныеПлановТрудозатрат.УровеньПланирования,
	               |		ВТ_ДанныеПлановТрудозатрат.Подразделение) КАК ДанныеПлановСгруппированные
	               |ГДЕ
	               |	НЕ ДанныеПлановСгруппированные.РесурсКоличество = ДанныеПлановСгруппированные.РесурсКоличествоРазличные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ДанныеПлановТрудозатратСгруппированнные.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ИЗ
	               |	ВТ_ДанныеПлановТрудозатратСгруппированнные КАК ВТ_ДанныеПлановТрудозатратСгруппированнные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК упоАктуальныеПланыТрудозатратСводноТекущаяВерсия
	               |		ПО ВТ_ДанныеПлановТрудозатратСгруппированнные.ПроектнаяЗадача = упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача
	               |			И ВТ_ДанныеПлановТрудозатратСгруппированнные.Ресурс = упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс
	               |			И ВТ_ДанныеПлановТрудозатратСгруппированнные.Подразделение = упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Подразделение
	               |			И ВТ_ДанныеПлановТрудозатратСгруппированнные.УровеньПланирования = упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.УровеньПланирования
	               |ГДЕ
	               |	(ВТ_ДанныеПлановТрудозатратСгруппированнные.ОбщСтоимость <> упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Стоимость
	               |			ИЛИ ВТ_ДанныеПлановТрудозатратСгруппированнные.ОбщВнешняяСтоимость <> упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.СтоимостьВнешняя
				   |			ИЛИ ВТ_ДанныеПлановТрудозатратСгруппированнные.Количество <> упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.КоличествоЧасов)";
				   	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПроектныеЗадачиДляПересчета;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл    		
		ПроектныеЗадачиДляПересчета.Добавить(Выборка.ПроектнаяЗадача); 		
	КонецЦикла; 	   
	
	Возврат ПроектныеЗадачиДляПересчета;
	
КонецФункции

#Область ПерейтиНаВерсию_4_2_39_6

Процедура ПерейтиНаВерсию_4_2_39_6() Экспорт
	
	НачатьТранзакцию();
	Попытка
		ОбновитьДанныеТрансляцииБДРвБДДСПроектныхЗадач();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление трансляции БДР в БДДС.'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru='Ошибка обновления трансляции БДР в БДДС.'") + Символы.ПС +
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

Функция ШаблонТаблицыПроектныхЗадач()
	
	ШаблонТаблицы = Новый ТаблицаЗначений;
	
	ИсточникКолонок = Метаданные.Документы.упоСохранениеДанныхПроекта.ТабличныеЧасти.ПроектныеЗадачи.Реквизиты;
	Для каждого Реквизит Из ИсточникКолонок Цикл
		ШаблонТаблицы.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	ШаблонТаблицы.Колонки.Добавить("НужноЗановоТранслироватьПланРасходов", ОписаниеТиповБулево);
	ШаблонТаблицы.Колонки.Добавить("НужноЗановоТранслироватьПланДоходов", ОписаниеТиповБулево);
	
	Возврат ШаблонТаблицы;
	
КонецФункции

Функция ПроектныеЗадачиПоВерсииПроекта(ШаблонТаблицыПроектныхЗадач, ВыборкаПроектныеЗадачи)
	
	ТаблицаПроектныеЗадачи = ШаблонТаблицыПроектныхЗадач.Скопировать();
	Пока ВыборкаПроектныеЗадачи.Следующий() Цикл
		НоваяСтрока = ТаблицаПроектныеЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПроектныеЗадачи);
	КонецЦикла;
	
	Возврат ТаблицаПроектныеЗадачи;
	
КонецФункции

Процедура ОбновитьДанныеТрансляцииБДРвБДДСПроектныхЗадач()
	
	РезультатЗапроса = ПроектныеЗадачиСПотенциальнойПроблемой();
	ВыборкаПроекты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ШаблонТаблицыПроектныхЗадач = ШаблонТаблицыПроектныхЗадач();
	
	Пока ВыборкаПроекты.Следующий() Цикл
		ВыборкаВерсииПроекта = ВыборкаПроекты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВерсииПроекта.Следующий() Цикл
			ВыборкаПроектныеЗадачи = ВыборкаВерсииПроекта.Выбрать();
			
			ЗагружаемаяТаблицаЗадач = ПроектныеЗадачиПоВерсииПроекта(ШаблонТаблицыПроектныхЗадач,
				ВыборкаПроектныеЗадачи);
			
			// Сначала отключим в проблемных задачах признак трансляции БДР в БДДС.
			ОтключитьТрансляцию = Истина;
			СоздатьИЗаполнитьДокументСохраненияДанныхПроекта(ВыборкаВерсииПроекта, ЗагружаемаяТаблицаЗадач,
				ШаблонТаблицыПроектныхЗадач, ОтключитьТрансляцию);
			
			// Вернем признак трансляции обратно.
			ОтключитьТрансляцию = Ложь;
			СоздатьИЗаполнитьДокументСохраненияДанныхПроекта(ВыборкаВерсииПроекта, ЗагружаемаяТаблицаЗадач,
				ШаблонТаблицыПроектныхЗадач, ОтключитьТрансляцию);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПризнакТрансляцииВЗагружаемойТаблицеЗадач(ТаблицаЗадач, ОтключитьТрансляцию)
	
	Для каждого Строка Из ТаблицаЗадач Цикл
		Если Строка.НужноЗановоТранслироватьПланРасходов Тогда
			Строка.ВключитьПланРасходовВБДДС = Не ОтключитьТрансляцию;
		КонецЕсли;
		
		Если Строка.НужноЗановоТранслироватьПланДоходов Тогда
			Строка.ВключитьПланДоходовВБДДС = Не ОтключитьТрансляцию;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьИЗаполнитьДокументСохраненияДанныхПроекта(ДанныеШапки, ТаблицаЗадач, ШаблонТаблицыПроектныхЗадач, ОтключитьТрансляцию)
	
	ОбновитьПризнакТрансляцииВЗагружаемойТаблицеЗадач(ТаблицаЗадач, ОтключитьТрансляцию);
	
	Если ОтключитьТрансляцию Тогда
		Комментарий = НСтр("ru = 'Исправление ошибки трансляции БДР в БДДС, выключение трансляции.'");
	Иначе
		Комментарий = НСтр("ru = 'Исправление ошибки трансляции БДР в БДДС, включение трансляции.'");
	КонецЕсли;
	
	ДокументСохранения = Документы.упоСохранениеДанныхПроекта.СоздатьДокумент();
	ДокументСохранения.Проект = ДанныеШапки.Проект;
	ДокументСохранения.Версия = ДанныеШапки.Версия;
	ДокументСохранения.ПерезаписатьВключитьПланДоходовВБДДС = Истина;
	ДокументСохранения.ПерезаписатьВключитьПланРасходовВБДДС= Истина;
	ДокументСохранения.Комментарий = Комментарий;
	
	ДокументСохранения.ПроектныеЗадачи.Загрузить(ТаблицаЗадач);
	
	ДокументСохранения.Дата = ТекущаяДатаСеанса();
	ДокументСохранения.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция ПроектныеЗадачиСПотенциальнойПроблемой()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упоДанныеПлановДоходовИРасходовСрезПоследних.Версия КАК Версия,
		|	упоДанныеПлановДоходовИРасходовСрезПоследних.Версия.Проект КАК Проект,
		|	упоДанныеПлановДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоДанныеПлановДоходовИРасходовСрезПоследних.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_ПроектныеЗадачиСБДР
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(, Период >= &ДатаРелизаPM) КАК упоДанныеПлановДоходовИРасходовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|		ПО упоДанныеПлановДоходовИРасходовСрезПоследних.Версия = упоВерсииПроекта.Версия
		|			И (упоВерсииПроекта.Текущая)
		|
		|СГРУППИРОВАТЬ ПО
		|	упоДанныеПлановДоходовИРасходовСрезПоследних.Версия,
		|	упоДанныеПлановДоходовИРасходовСрезПоследних.ПроектнаяЗадача,
		|	упоДанныеПлановДоходовИРасходовСрезПоследних.Версия.Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Версия КАК Версия,
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Период КАК Период,
		|	СУММА(упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_ПроектныеЗадачиСБДДС
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(
		|			,
		|			ПроектнаяЗадача В
		|					(ВЫБРАТЬ
		|						ВТ_ПроектныеЗАдачиСБДР.ПроектнаяЗадача
		|					ИЗ
		|						ВТ_ПроектныеЗАдачиСБДР КАК ВТ_ПроектныеЗАдачиСБДР)
		|				И ИсточникПлана В (&ИсточникиПлана)) КАК упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|		ПО упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Версия = упоВерсииПроекта.Версия
		|			И (упоВерсииПроекта.Текущая)
		|
		|СГРУППИРОВАТЬ ПО
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Версия,
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ПроектнаяЗадача,
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвойстваТрансляцииБДРвБДДСПроектныхЗадач.Версия КАК Версия,
		|	СвойстваТрансляцииБДРвБДДСПроектныхЗадач.Проект КАК Проект,
		|	СвойстваТрансляцииБДРвБДДСПроектныхЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача
		|ПОМЕСТИТЬ ВТ_ЗадачиСТранслированнымБДР
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_ПроектныеЗадачиСБДР.Версия КАК Версия,
		|		ВТ_ПроектныеЗадачиСБДР.Проект КАК Проект,
		|		ВТ_ПроектныеЗадачиСБДР.ПроектнаяЗадача КАК ПроектнаяЗадача
		|	ИЗ
		|		ВТ_ПроектныеЗадачиСБДР КАК ВТ_ПроектныеЗадачиСБДР
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК СвойстваПроектныхЗадач
		|			ПО ВТ_ПроектныеЗадачиСБДР.Версия = СвойстваПроектныхЗадач.Версия
		|				И ВТ_ПроектныеЗадачиСБДР.ПроектнаяЗадача = СвойстваПроектныхЗадач.ПроектнаяЗадача
		|				И (СвойстваПроектныхЗадач.ВключитьПланДоходовВБДДС)
		|				И (НЕ СвойстваПроектныхЗадач.ЗадачаОтменена)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ПроектныеЗадачиСБДР.Версия,
		|		ВТ_ПроектныеЗадачиСБДР.Проект,
		|		ВТ_ПроектныеЗадачиСБДР.ПроектнаяЗадача
		|	ИЗ
		|		ВТ_ПроектныеЗадачиСБДР КАК ВТ_ПроектныеЗадачиСБДР
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК СвойстваПроектныхЗадач
		|			ПО ВТ_ПроектныеЗадачиСБДР.Версия = СвойстваПроектныхЗадач.Версия
		|				И ВТ_ПроектныеЗадачиСБДР.ПроектнаяЗадача = СвойстваПроектныхЗадач.ПроектнаяЗадача
		|				И (СвойстваПроектныхЗадач.ВключитьПланРасходовВБДДС)
		|				И (НЕ СвойстваПроектныхЗадач.ЗадачаОтменена)) КАК СвойстваТрансляцииБДРвБДДСПроектныхЗадач
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БДРиБДДС.Версия КАК Версия,
		|	БДРиБДДС.Проект КАК Проект,
		|	БДРиБДДС.ПроектнаяЗадача КАК ПроектнаяЗадача
		|ПОМЕСТИТЬ ВТ_ЗадачиСНеобходимостьюПовторнойТрансляции
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_ЗадачиСТранслированнымБДР.Версия КАК Версия,
		|		ВТ_ЗадачиСТранслированнымБДР.Проект КАК Проект,
		|		ВТ_ЗадачиСТранслированнымБДР.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|		ВЫБОР
		|			КОГДА ВТ_ПроектныеЗадачиСБДДС.ПроектнаяЗадача ЕСТЬ NULL
		|					ИЛИ ВТ_ПроектныеЗадачиСБДДС.Сумма = 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ КАК НужнаПовторнаяТрансляция
		|	ИЗ
		|		ВТ_ЗадачиСТранслированнымБДР КАК ВТ_ЗадачиСТранслированнымБДР
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроектныеЗадачиСБДДС КАК ВТ_ПроектныеЗадачиСБДДС
		|			ПО ВТ_ЗадачиСТранслированнымБДР.Версия = ВТ_ПроектныеЗадачиСБДДС.Версия
		|				И ВТ_ЗадачиСТранслированнымБДР.ПроектнаяЗадача = ВТ_ПроектныеЗадачиСБДДС.ПроектнаяЗадача) КАК БДРиБДДС
		|ГДЕ
		|	БДРиБДДС.НужнаПовторнаяТрансляция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗадачиСНеобходимостьюПовторнойТрансляции.Проект КАК Проект,
		|	ЗадачиСНеобходимостьюПовторнойТрансляции.Версия КАК Версия,
		|	ЗадачиСНеобходимостьюПовторнойТрансляции.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	Сроки.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|	Сроки.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
		|	&ПоляСвойств КАК ПоляСвойств,
		|	СвойстваПроектныхЗадач.ВключитьПланРасходовВБДДС КАК НужноЗановоТранслироватьПланРасходов,
		|	СвойстваПроектныхЗадач.ВключитьПланДоходовВБДДС КАК НужноЗановоТранслироватьПланДоходов
		|ИЗ
		|	ВТ_ЗадачиСНеобходимостьюПовторнойТрансляции КАК ЗадачиСНеобходимостьюПовторнойТрансляции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, ) КАК Сроки
		|		ПО ЗадачиСНеобходимостьюПовторнойТрансляции.Версия = Сроки.Версия
		|			И ЗадачиСНеобходимостьюПовторнойТрансляции.ПроектнаяЗадача = Сроки.ПроектнаяЗадача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(, ) КАК СтатусыПроектныхЗадач
		|		ПО ЗадачиСНеобходимостьюПовторнойТрансляции.Версия = СтатусыПроектныхЗадач.Версия
		|			И ЗадачиСНеобходимостьюПовторнойТрансляции.ПроектнаяЗадача = СтатусыПроектныхЗадач.ПроектнаяЗадача
		|			И (НЕ СтатусыПроектныхЗадач.СтатусЗадачи В (&СтатусыПроектныхЗадачИсключения))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних(, ) КАК СтатусыПроектов
		|		ПО ЗадачиСНеобходимостьюПовторнойТрансляции.Версия.Проект = СтатусыПроектов.Проект
		|			И (НЕ СтатусыПроектов.СтатусПроекта В (&СтатусыПроектовИсключения))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК СвойстваПроектныхЗадач
		|		ПО ЗадачиСНеобходимостьюПовторнойТрансляции.Версия = СвойстваПроектныхЗадач.Версия
		|			И ЗадачиСНеобходимостьюПовторнойТрансляции.ПроектнаяЗадача = СвойстваПроектныхЗадач.ПроектнаяЗадача
		|ИТОГИ ПО
		|	Проект,
		|	Версия";
	
	РесурсыРегистра = Метаданные.РегистрыСведений.упоСвойстваПроектныхЗадач.Ресурсы;
	СтрокиЗапросаСвойств = Новый Массив;
	Для Каждого Ресурс Из РесурсыРегистра Цикл
		СтрокаЗапроса = СтрШаблон("СвойстваПроектныхЗадач.%1", Ресурс.Имя);
		СтрокиЗапросаСвойств.Добавить(СтрокаЗапроса);
	КонецЦикла;
	ТекстСвойства = СтрСоединить(СтрокиЗапросаСвойств, ",");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляСвойств", ТекстСвойства);
	
	СтатусыПроектовИсключения = Новый Массив;
	СтатусыПроектовИсключения.Добавить(Перечисления.упоСостояниеСтатусаПроекта.Завершен);
	СтатусыПроектныхЗадачИсключения = Новый Массив;
	СтатусыПроектныхЗадачИсключения.Добавить(Перечисления.упоСостояниеСтатусаЗадачи.Закрыта);
	
	ИсточникиПланаБДДС = Новый Массив;
	ИсточникиПланаБДДС.Добавить(Перечисления.упоИсточникПланаДДС.Доходы);
	ИсточникиПланаБДДС.Добавить(Перечисления.упоИсточникПланаДДС.Расходы);
	ИсточникиПланаБДДС.Добавить(Перечисления.упоИсточникПланаДДС.Трудозатраты);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаРелизаPM", Дата(2025, 11, 7));
	Запрос.УстановитьПараметр("ИсточникиПлана", ИсточникиПланаБДДС);
	Запрос.УстановитьПараметр("СтатусыПроектовИсключения", СтатусыПроектовИсключения);
	Запрос.УстановитьПараметр("СтатусыПроектныхЗадачИсключения", СтатусыПроектныхЗадачИсключения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти