
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
				
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, , Отказ, СтандартнаяОбработка); 		
	
	Параметры.Свойство("ВыполняемыйКод", ВыполняемыйКод);
	Параметры.Свойство("ИмяТабЧасти", ИмяТабЧасти);
	Параметры.Свойство("УИстроки", УИстроки);
	Параметры.Свойство("Источник", Источник);
	Параметры.Свойство("Подсказка", ПодсказкаТекст);
	
	Если ЗначениеЗаполнено(Источник) Тогда
		
		ОписаниеТипаРеквизита = упоОповещенияВызовСервера.ПолучитьОписаниеТипаРеквизита(Источник, "Ссылка");
		
		Если ОписаниеТипаРеквизита <> Неопределено Тогда
			Элементы.ИсточникСсылка.ОграничениеТипа = ОписаниеТипаРеквизита;
			упоОповещенияВызовСервера.ДобавитьПараметрыВыбораПроектныхЗадачИПроекта(Источник, Элементы.ИсточникСсылка);
		КонецЕсли;
		
	Иначе
		Элементы.ИсточникСсылка.Видимость = Ложь;	
	КонецЕсли;
	
	ЗаголовокФормы = Неопределено;
	Параметры.Свойство("ЗаголовокФормы", ЗаголовокФормы);
	Если ЗначениеЗаполнено(ЗаголовокФормы) Тогда
		ЭтаФорма.Заголовок = ЗаголовокФормы;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
	
	Элементы.ПоказатьПодсказку.Пометка = НЕ ПодсказкаОтжата;
	Элементы.ГруппаПодсказка.Видимость = НЕ ПодсказкаОтжата;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Неопределено, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Неопределено, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Неопределено, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Неопределено, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьИЗакрыть(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Пар = Новый Структура("ВыполняемыйКод,ИмяТабЧасти,УИстроки",ВыполняемыйКод,ИмяТабЧасти,УИстроки);
	ОповеститьОВыборе(Пар);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКод(Команда)
	
	ОчиститьСообщения();
	
	ТекстУспешногоЗавершения = "";
	Если упоОповещенияВызовСервера.ПроверитьКод(ВыполняемыйКод, ТекстУспешногоЗавершения, ИсточникСсылка, ИсточникДопПараметр) Тогда
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(ТекстУспешногоЗавершения);
		ТекстовыйДокумент.Показать(НСтр("ru = 'Результат выполнения выражения на встроенном языке'"));
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодсказку(Команда)
	
	ПодсказкаОтжата = НЕ ПодсказкаОтжата;
	Элементы.ПоказатьПодсказку.Пометка = НЕ ПодсказкаОтжата;
	Элементы.ГруппаПодсказка.Видимость = НЕ ПодсказкаОтжата;

КонецПроцедуры

#КонецОбласти
