
&После("ПриЗаписи")
Процедура ИКТ_ПриЗаписи(Отказ)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Попытка
		Определение = Новый WSОпределения(Константы.АдресВебСервиса1СДокументооборот.Получить() + "ws\ikt_ERP.1cws?wsdl",
		Константы.ИнтеграцияС1СДокументооборотИмяПользователяДляОбмена.Получить(), Константы.ИнтеграцияС1СДокументооборотПарольДляОбмена.Получить(),,120);
		
		Прокси = Новый WSПрокси(Определение, "www.IKT.ru", "ikt_ERP", "ikt_ERPSoap");
		Прокси.Пользователь	= Константы.ИнтеграцияС1СДокументооборотИмяПользователяДляОбмена.Получить();
		Прокси.Пароль 		= Константы.ИнтеграцияС1СДокументооборотПарольДляОбмена.Получить();
		Если ЭтоНовый() Тогда
			Попытка
			  СсылкаСтатьи = ЭтотОбъект.ПолучитьСсылкуНового();
			Исключение
			  СсылкаСтатьи = Неопределено;
			КонецПопытки;
			
			Если Не ЗначениеЗаполнено(СсылкаСтатьи) Тогда
				ЭтотОбъект.УстановитьСсылкуНового(Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьСсылку(Новый УникальныйИдентификатор()));
				СсылкаСтатьи = ЭтотОбъект.ПолучитьСсылкуНового();
			КонецЕсли;
		Иначе
			СсылкаСтатьи = ЭтотОбъект.Ссылка;
		КонецЕсли;
		Пар = Новый Структура("УИД, Родитель, Наименование, ПометкаУдаления, ЭтоГруппа, Код",СсылкаСтатьи.УникальныйИдентификатор(), Родитель.УникальныйИдентификатор(), Наименование, ПометкаУдаления, ЭтоГруппа, Код);		
		
		Параметр = Новый Структура("Команда, СтатьяДДС, База", "СинхронизироватьСтатьюДДС", Пар, "Стройка");        
		Результат = Прокси.Exec(Новый ХранилищеЗначения(Параметр, Новый СжатиеДанных(6)), 
		ВРЕГ(Константы.ИКТ_ПутьКРабочейБазе.Получить()) = ВРег(СтрокаСоединенияИнформационнойБазы())).Получить();
		Если Результат.Свойство("Ошибка") Тогда
			ВызватьИсключение Результат.Ошибка;
		КонецЕсли;
	Исключение
		Отказ = ВРЕГ(Константы.ИКТ_ПутьКРабочейБазе.Получить()) = ВРег(СтрокаСоединенияИнформационнойБазы());
		Сообщить("Не удалось провести синхронизацию с ДО. " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
