////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с проектами и задачами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает текущий проект и оповещает о его изменении.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	- ссылка на проект, который необходимо установить текущим.
//  Форма	 - Произвольный 			- не используется. 
//
// Возвращаемое значение:
//	Неопрделено - не возвращает значение.
//
Процедура УстановитьПроектТекущим(Проект, Форма = Неопределено) Экспорт
	
	Успешно = упоПроектыИЗадачиВызовСервера.ОбработатьУстановкуТекущегоПроекта(Проект);
	
	Если Успешно Тогда
		Оповестить("ИзменениеТекущегоПроекта", Проект);
	КонецЕсли; 
	
КонецПроцедуры

// Возвращает количество открытых форм по проекту.
//
// Параметры:
//  Проект - СправочникСсылка - проект, по которому нужно проверить формы.
//
// Возвращаемое значение:
//	Число - количество открытых форм по проекту.
//
Функция КоличествоОткрытыхСвязанныхОбъектовПроекта(Проект) Экспорт
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("Проект", Проект);
	ПараметрыПроверки.Вставить("КоличествоФормКЗаписи", 0);
	
	Оповестить("ПроверитьРедактированиеПроекта", ПараметрыПроверки);
	
	Возврат ПараметрыПроверки.КоличествоФормКЗаписи;
	
КонецФункции

// Записывает открытые форм по проекту, сохраняя данные. При ошибки записи
// сработают опопвещения заданый в самих формах. 
//
// Параметры:
//  Проект - СправочникСсылка - проект, по которому нужно проверить формы.
//
// Возвращаемое значение:
//	Булево - 	Истина - если все формы записались без ошибок.
//				Ложь - если была хоть одна ошибка при записи. 
//
Функция ЗаписаныОткрытыеСвязанныеОбъектыПроекта(Проект) Экспорт
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("Проект", Проект);
	ПараметрыПроверки.Вставить("ВсеИзмененияЗаписаны", Истина);
	
	Оповестить("ЗаписатьИзмененияПроекта", ПараметрыПроверки);
	
	Возврат ПараметрыПроверки.ВсеИзмененияЗаписаны;

КонецФункции

#Область ПанельСтатусовПроекта

// Оповещает открытые формы о смене статуса проекта.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма - форма-источник оповещения.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Процедура ОповеститьОСменеСтатусаПроекта(ЭтаФорма) Экспорт
	
	РегистраторыСтатуса = Новый Массив;
	РегистраторыСтатуса.Добавить("упоРегистрацияПроекта");
	РегистраторыСтатуса.Добавить("упоУтверждениеПланаПроекта");
	РегистраторыСтатуса.Добавить("упоЗавершениеПроекта");
	РегистраторыСтатуса.Добавить("упоСтартПроектныхРабот");
	РегистраторыСтатуса.Добавить("упоОстановкаПроектныхРабот");
	РегистраторыСтатуса.Добавить("упоВозобновлениеПроекта");
	
	Для Каждого РегистраторСтатуса Из  РегистраторыСтатуса Цикл
		Если Найти(ЭтаФорма.ИмяФормы, РегистраторСтатуса) = 0 Тогда
			Продолжить;
		КонецЕсли;
		Оповестить("СменаСтатусаПроекта", ЭтаФорма.Объект.Проект, ЭтаФорма);
	КонецЦикла;	
	
КонецПроцедуры

// Разворачивает/сворачивает строки дерева.
//
// Параметры:
//  Список			 - ТаблицаФормы		- таблица формы, с которой необходимо проделать манипуляции.
//  СписокЭлементов	 - СписокЗначений 	- список строк, которые необходимо свернуть или развернуть.
//  Развернуть		 - Булево 			- признак того, необходимо строки разворачивать или сворачивать.
//
Процедура РазвернутьСвернутьДерево(Список, СписокЭлементов, Развернуть = Истина) Экспорт
	
	Если Список.Отображение = ОтображениеТаблицы.Дерево Тогда
		Если Развернуть Тогда
			Для Каждого ЭлементСписка Из СписокЭлементов Цикл
				Если ЗначениеЗаполнено(ЭлементСписка.Значение) ИЛИ ЭлементСписка.Значение = 0 Тогда
					Если Список.Развернут(ЭлементСписка.Значение) = Ложь Тогда
						Список.Развернуть(ЭлементСписка.Значение);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ЭлементСписка Из СписокЭлементов Цикл
				Если ЗначениеЗаполнено(ЭлементСписка.Значение) ИЛИ ЭлементСписка.Значение = 0 Тогда
					Если Список.Развернут(ЭлементСписка.Значение) = Истина Тогда 
						Список.Свернуть(ЭлементСписка.Значение);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Помечает на удаление проектную задачу и производит расчет календарного плана.
//
// Параметры:
//  Форма  - Форма, УправляемаяФорма - форма, с которой вызывается команда.
//  ПроектнаяЗадача  - ДокументСсылка.упоПроектнаяЗадача.
//  НазваниеПроектнойЗадачи  - Строка.
//  ПеречитатьОбъектНаФорме  - Булево.
//
Процедура УдалитьПроектнуюЗадачу(Форма, ПроектнаяЗадача, НазваниеПроектнойЗадачи, ПеречитатьОбъектНаФорме) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоАвтоТест = Ложь;
	
	Если Форма.Параметры.Свойство("АвтоТест") Тогда
		ЭтоАвтоТест = Истина;
	КонецЕсли;
	
	СтруктураУдаляемыеОбъекты = упоПроектыИЗадачиВызовСервера.ПолучитьУдаляемыеОбъекты(ПроектнаяЗадача);
	
	СписокУдаляемыхЗадач = СтруктураУдаляемыеОбъекты.СписокУдаляемыхЗадач;
	СписокСвязанныхЗадач = СтруктураУдаляемыеОбъекты.СписокСвязанныхЗадач;
	СписокУдаляемыхЗадачСписанФакт = СтруктураУдаляемыеОбъекты.СписокУдаляемыхЗадачСписанФакт;
	
	Если СписокУдаляемыхЗадач.Количество() = 0
		И СписокСвязанныхЗадач.Количество() = 0
		И НЕ ЭтоАвтоТест Тогда
		Возврат;
	КонецЕсли;	
	
	Если СписокУдаляемыхЗадачСписанФакт.Количество() > 0 Тогда
		мСтрок = Новый Массив;
		мСтрок.Добавить(НСтр("ru = 'По следующим задачам списан факт:'"));
		ТекстШаблона = "- %1;";
		Для каждого Строка Из СписокУдаляемыхЗадачСписанФакт Цикл
			мСтрок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстШаблона, Строка.Представление));
		КонецЦикла;
		мСтрок.Добавить(НСтр("ru = 'Нельзя удалить проектные задачи, по которым списан факт.'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрСоединить(мСтрок, Символы.ПС));
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "ru = 'Будут выполнены следующие действия:" + Символы.ПС + Символы.ПС;
	
	ТекстСообщения = ТекстСообщения + "- пометка на удаление задач:" + Символы.ПС;
	
	Для Каждого ПодчиненнаяЗадача Из СписокУдаляемыхЗадач Цикл
		ТекстСообщения = ТекстСообщения + "   """ + ПодчиненнаяЗадача.Представление + """;" + Символы.ПС;
	КонецЦикла;
	ТекстСообщения = ТекстСообщения + Символы.ПС;

	Если СписокСвязанныхЗадач.Количество() > 0 Тогда
		ТекстСообщения = ТекстСообщения + "- удаление связей с удаляемыми задачами из следующих задач:" + Символы.ПС;
		Для Каждого СвязаннаяЗадача Из СписокСвязанныхЗадач Цикл
			ТекстСообщения = ТекстСообщения + "   """ + СвязаннаяЗадача.Представление + """;" + Символы.ПС;
		КонецЦикла;
		ТекстСообщения = ТекстСообщения + Символы.ПС;
	КонецЕсли;
			
	ТекстСообщения = ТекстСообщения + "- расчет календарного плана проекта.';" + " en = 'Do you want to continue?'";

	ТекстСообщения = Нстр(ТекстСообщения);	
		
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НазваниеПроектнойЗадачи);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекстСообщения", ТекстСообщения);
	ПараметрыФормы.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
	ПараметрыФормы.Вставить("СтруктураУдаляемыеОбъекты", СтруктураУдаляемыеОбъекты);
	ПараметрыФормы.Вставить("ПеречитатьОбъектНаФорме", ПеречитатьОбъектНаФорме);
	ПараметрыФормы.Вставить("ЭтоАвтоТест", ЭтоАвтоТест);
	
	ОткрытьФорму("Документ.упоПроектнаяЗадача.Форма.ФормаУдалениеПроектнойЗадачи", ПараметрыФормы, Форма);
	
КонецПроцедуры // УдалитьПроектнуюЗадачу()

// Помечает на удаление проектную задачу и производит расчет календарного плана.
//
// Параметры:
//  Форма  - Форма, УправляемаяФорма - форма, с которой вызывается команда.
//  ИмяСобытия  - Строка.
//  Параметры  - Структура.
//  Источник - Форма, УправляемаяФорма. 
//    
Процедура УдалениеПроектнойЗадачиОбработкаОповещения(Форма, ИмяСобытия, Параметры, Источник) Экспорт

	Если ИмяСобытия = "УдалениеПроектнойЗадачи" И Источник = Форма Тогда
	
		Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда					
			Форма.Прочитать();
		Иначе
			Форма.ЭтотОбъект.Прочитать();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// При изменении статуса проекта в текущей строке таблицы формы.
//
// Параметры:
//  ТекущиеДанные  - ДанныеФормыСтруктура, ДанныеФормыЭлементКоллекции,
//					 ДанныеФормыЭлементДерева - данные текущей строки.
//
Процедура ПриИзмененииСтатусаПроектнойЗадачиВТаблицеФормы(ТекущиеДанные) Экспорт

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Свойство("Статус") И 
		ТекущиеДанные.Свойство("ПроцентГотовности") Тогда
		
		Если ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Завершена") 
			ИЛИ ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Закрыта") Тогда
			
			ТекущиеДанные.ПроцентГотовности = 100;  			
			
		ИначеЕсли ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Запланирована") Тогда
			
			ТекущиеДанные.ПроцентГотовности = 0;   			
			
		ИначеЕсли ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Выполняется") И 
			(ТекущиеДанные.ПроцентГотовности = 0 ИЛИ ТекущиеДанные.ПроцентГотовности = 100) Тогда
			
			ТекущиеДанные.ПроцентГотовности = 50;	  
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// При изменении процента готовности проекта в текущей строке таблицы формы.
//
// Параметры:
//  ТекущиеДанные			 - ДанныеФормыСтруктура, ДанныеФормыЭлементКоллекции, ДанныеФормыЭлементДерева - данные
//  	текущей строки.
//  ОбновлятьСтатус			 - Булево
//  ИмяПоляПроцентГотовности - Строка
//  ИмяПоляСтатус			 - Строка
//
Процедура ПриИзмененииПроцентаГотовностиПроектнойЗадачиВТаблицеФормы(ТекущиеДанные, 
																	ОбновлятьСтатус = Истина, 
																	ИмяПоляПроцентГотовности = "ПроцентГотовности",
																	ИмяПоляСтатус = "Статус") Экспорт
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ПроцентГотовности = Неопределено;
	
	Если Не ТекущиеДанные.Свойство(ИмяПоляПроцентГотовности, ПроцентГотовности) Тогда
		Возврат;
	КонецЕсли;	
		
	Если ПроцентГотовности > 100 Тогда
		
		ТекущиеДанные[ИмяПоляПроцентГотовности] = 100;
		ПроцентГотовности = 100;
		
	ИначеЕсли ПроцентГотовности < 0 Тогда
		
		ТекущиеДанные[ИмяПоляПроцентГотовности] = 0;
		ПроцентГотовности = 0;

	КонецЕсли;
	
	// Статус.
	
	Если ТекущиеДанные.Свойство(ИмяПоляСтатус) И ОбновлятьСтатус Тогда 
								
		Если ПроцентГотовности = 100 Тогда
			
			ЗадачаЗакрыта = 
				ТекущиеДанные[ИмяПоляСтатус] = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Закрыта");
				
			Если Не ЗадачаЗакрыта Тогда
				ТекущиеДанные[ИмяПоляСтатус] = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Завершена");
			КонецЕсли;
			
		ИначеЕсли ПроцентГотовности = 0 Тогда
			
			ТекущиеДанные[ИмяПоляСтатус] = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Запланирована");
			
		ИначеЕсли ПроцентГотовности > 0 И ПроцентГотовности < 100 Тогда
			
			ТекущиеДанные[ИмяПоляСтатус] = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Выполняется");
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Устанавливает фактические сроки в строке в зависимости от статуса проектной задачи.
//
// Параметры:
//  СтрокаДерева - ДанныеФормыЭлементДерева, ДанныеФормыЭлементКоллекции - данные текущей строки.
//
Процедура УстановитьФактическиеСрокиПоУмолчанию(СтрокаДерева) Экспорт 
		
	Если СтрокаДерева.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Запланирована") Тогда
		
		СтрокаДерева.ДатаНачалаФакт = Дата(1, 1, 1);
		СтрокаДерева.ДатаЗавершенияФакт = Дата(1, 1, 1);    

	ИначеЕсли СтрокаДерева.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Выполняется") Тогда		
		
		Если НЕ ЗначениеЗаполнено(СтрокаДерева.ДатаНачалаФакт) Тогда		
			СтрокаДерева.ДатаНачалаФакт = СтрокаДерева.ДатаНачала;
		КонецЕсли;	
		СтрокаДерева.ДатаЗавершенияФакт = Дата(1, 1, 1);
		
	ИначеЕсли СтрокаДерева.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Завершена") ИЛИ
			  СтрокаДерева.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Закрыта") Тогда
			  
		Если НЕ ЗначениеЗаполнено(СтрокаДерева.ДатаНачалаФакт) Тогда
			СтрокаДерева.ДатаНачалаФакт = СтрокаДерева.ДатаНачала;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаДерева.ДатаЗавершенияФакт) Тогда
			СтрокаДерева.ДатаЗавершенияФакт = СтрокаДерева.ДатаЗавершения;
		КонецЕсли;	
		
		Если СтрокаДерева.ДатаЗавершенияФакт < СтрокаДерева.ДатаНачалаФакт Тогда
			СтрокаДерева.ДатаЗавершенияФакт = СтрокаДерева.ДатаНачалаФакт;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Рассчитывает и заполняет длительность модели пакета работ.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма Проектной задачи, форма Шаблона проектной задачи.
//  ЭтоШаблонПроектнойЗадачи - Булево - опреляет, что расчет идет для шаблона проектной задачи.
//
Процедура ЗаполнитьДлительностьПоОсвоенномуОбъему(ЭтаФорма, ЭтоШаблонПроектнойЗадачи = Ложь) Экспорт
	
	Если ЭтаФорма.Объект.ЭтоВеха Тогда
		Возврат;
	КонецЕсли;
	
	максимальнаяДлительность = 0;
	
	Для Каждого СтрокаТЧ Из ЭтаФорма.Объект.Субпродукты Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Количество) И ЗначениеЗаполнено(СтрокаТЧ.Скорость) Тогда
			текДлительность = СтрокаТЧ.Количество / СтрокаТЧ.Скорость;		
			Если текДлительность > максимальнаяДлительность Тогда
				максимальнаяДлительность = текДлительность;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(максимальнаяДлительность) Тогда
		
		ЭтаФорма.Объект.ДлительностьМоделиПакетаРабот = максимальнаяДлительность;
		
		ЭтаФорма.Объект.ЕдиницаНормированияДлительности = упоПроектыИЗадачиОбщие.ЕдИзмеренияПоУмолчанию(ЭтаФорма, ЭтоШаблонПроектнойЗадачи);
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Ошибка расчета длительности по субпродуктам.'");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет клиентский кэш по объектам базы, которые были изменены не интерактивно.
// Например, при изменении наименования в документе упоПроектнаяЗадача, происходит изменении наименования в 
// связанном элементе справочника Проекты с помощью подписки на событие "ПриЗаписи", если не обновить клиентский кэш
// по связанному элементу, то представление ссылки на клиенте будет выглядеть как до внесенных изменений.
//
// Параметры:
//  ИмяДействия 	   - Строка - определяет алгоритм получения связанныого элемента.
//  СсылкаНаОбъектБазы - ДокументСсылка.упоПроектнаяЗадача, СправочникССылка.СтруктураПредприятия,
//						  ПланВидовХарактеристикСсылка.СтатьиДоходов, ПланВидовХарактеристикСсылка.СтатьиДоходов - ссылка,
//							 по который нужно найти связанный элемент и обновить кэш этого элемента.
//
Процедура ОбновитьКэшСвязанныхЭлементов(ИмяДействия, СсылкаНаОбъектБазы = Неопределено) Экспорт
		
	СвязанныйЭлемент = Неопределено;
	ТипИзменившихсяОбъектов = Неопределено;
	
	Если ИмяДействия = "СтруктураПредприятия" Тогда
		СвязанныйЭлемент = упоИнтеграцияВызовСервера.НайтиСвязанныйЭлементСтруктурыИлиПодразделения(СсылкаНаОбъектБазы);		
	ИначеЕсли ИмяДействия = "ПроектнаяЗадача" Тогда
		СвязанныйЭлемент = упоПроектыИЗадачиВызовСервера.НайтиСвязанныйЭлементПроекта(СсылкаНаОбъектБазы);
	ИначеЕсли ИмяДействия = "МассивПроектныхЗадач" Тогда
		ТипИзменившихсяОбъектов = Тип("СправочникСсылка.Проекты");	
	Иначе
		СвязанныйЭлемент = упоИнтеграцияВызовСервера.ПолучитьСвязаннуюСтатьюДР(СсылкаНаОбъектБазы);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвязанныйЭлемент) Тогда
		ОповеститьОбИзменении(СвязанныйЭлемент);
		Возврат;
	КонецЕсли;
	
	Если ТипИзменившихсяОбъектов = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	ОповеститьОбИзменении(ТипИзменившихсяОбъектов);
	
КонецПроцедуры

// Устанавливает элементу формы проектной задачи параметры выбора для управления открывающимся списком выбора.
//
// Параметры:
//  ЭлементПроектнаяЗадача	 - 															 - СправочникСсылка.Проекты
//  ТекущийПроект			 - СправочникСсылка.Проекты									 - текущий проект для отбора в списке.
//  ТекущаяПроектнаяЗадача	 - СправочникСсылка.Проекты, ДокументСсылка.упоПроектнаяЗадача	 - текущая проектная задача для отбора в списке.
//  СтандартнаяОбработка	 - Булево														 - управление отключением стандартной обработки вызывающей команды.
//
Процедура УстановитьПараметрыВыбораПроектнойЗадачи(ЭлементПроектнаяЗадача, 
													ТекущийПроект, 
													ТекущаяПроектнаяЗадача, 
													СтандартнаяОбработка) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекущийПроект) Тогда
		ТекстСообщения = НСтр("ru = 'Для выбора проектной задачи необходимо заполнить ""Проект"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Проект");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;		
	
	ВыборПроектнойЗадачиКакПроекта = ТипЗнч(ТекущаяПроектнаяЗадача) = Тип("СправочникСсылка.Проекты");
	
	НовыйМассив = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Проект", ТекущийПроект);
	НовыйМассив.Добавить(НовыйПараметр);	
	НовыйПараметр = Новый ПараметрВыбора("ЭтоФормаВыбораПроектнойЗадачиКакПроекта", ВыборПроектнойЗадачиКакПроекта);
	НовыйМассив.Добавить(НовыйПараметр);		
	НовыйПараметр = Новый ПараметрВыбора("ТекущаяСтрока", ТекущаяПроектнаяЗадача);
	НовыйМассив.Добавить(НовыйПараметр);	
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);		
	ЭлементПроектнаяЗадача.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВопросОРегистрацииПроекта(Форма, Проект, СтатусПроекта) Экспорт 
	
	Если ЗначениеЗаполнено(СтатусПроекта) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Проект", Проект);
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОРегистрацииПроектаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = НСтр("ru = 'Зарегистрировать проект?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Да);	
	
КонецПроцедуры

Процедура ВопросОРегистрацииПроектаЗавершение(Ответ,ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура("Основание", ДополнительныеПараметры.Проект);
		ОткрытьФорму("Документ.упоРегистрацияПроекта.ФормаОбъекта", ПараметрыФормы, ДополнительныеПараметры.Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВыбореПодчиненногоПроекта(Проект, ПодчиненныйПроект) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПодчиненныйПроект) Тогда
		Возврат;
	КонецЕсли;
	Если Проект = ПодчиненныйПроект Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваПроекта = упоФункцииОбщегоНазначенияВызовСервера.ПолучитьСвойстваОбъекта(Проект, "Компонент, ПрограммаПроектов");
	
	Если НЕ СвойстваПроекта.Компонент = ПредопределенноеЗначение("Перечисление.упоКомпоненты.ПрограммаПроектов") Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СвойстваПроекта.ПрограммаПроектов) Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваПодчиненного = упоФункцииОбщегоНазначенияВызовСервера.ПолучитьСвойстваОбъекта(ПодчиненныйПроект, "ПрограммаПроектов");
	
	Если СвойстваПроекта.ПрограммаПроектов = СвойстваПодчиненного.ПрограммаПроектов Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвойстваПодчиненного.ПрограммаПроектов) Тогда
		ТекстВопроса = НСтр("ru = 'В выбранном подчиненном проекте ""%1"" указана программа проектов ""%2"", изменить ее на ""%3""?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, Строка(ПодчиненныйПроект), Строка(СвойстваПодчиненного.ПрограммаПроектов), Строка(СвойстваПроекта.ПрограммаПроектов));
	Иначе
		ТекстВопроса = НСтр("ru = 'В выбранном подчиненном проекте ""%1"" не указана программа проектов, заполнить ее ""%2""?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, Строка(ПодчиненныйПроект), Строка(СвойстваПроекта.ПрограммаПроектов));
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПодчиненныйПроект", ПодчиненныйПроект);
	ДополнительныеПараметры.Вставить("ПрограммаПроектов", СвойстваПроекта.ПрограммаПроектов);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриВыбореПодчиненногоПроектаЗавершение", упоПроектыИЗадачиКлиент, ДополнительныеПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура ПриВыбореПодчиненногоПроектаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	упоПроектыИЗадачиВызовСервера.ЗаписатьПрограммуПроектовВПроекте(ДополнительныеПараметры.ПодчиненныйПроект, 
		ДополнительныеПараметры.ПрограммаПроектов);
	
	ТекстСообщения = НСтр("ru = 'Изменение проекта'");;
	Пояснение = НСтр("ru = 'В проекте ""%1"" программа проектов успешно изменена на ""%2"".'");
	Пояснение = СтрШаблон(Пояснение, 
		Строка(ДополнительныеПараметры.ПодчиненныйПроект), 
		Строка(ДополнительныеПараметры.ПрограммаПроектов));
	ПоказатьОповещениеПользователя(ТекстСообщения, 
		ПолучитьНавигационнуюСсылку(ДополнительныеПараметры.ПодчиненныйПроект), 
		Пояснение);
	
КонецПроцедуры

#Область ПанельСтатусовПроекта

// Изменяет статус проекта на выбранный.
//
// Параметры:
//  ТекущийСтатусПроекта		- ПеречислениеСсылка.упоСостояниеСтатусаПроекта - текущий статус.
//  ВыбранныйСтатус				- ПеречислениеСсылка.упоСостояниеСтатусаПроекта - новый статус.
//	РегистраторТекущегоСтатуса	- Ссылка на документ 							- регистратор текущего статуса.
//	Проект						- СправочникСсылка.Проекты 						- проект, для которого изменяется статус.
//
Процедура ИзменитьСтатус(ТекущийСтатусПроекта, ВыбранныйСтатус, РегистраторТекущегоСтатуса, Проект) Экспорт
	
	СтруктураДействие = упоПроектыИЗадачиВызовСервера.ПолучитьНеобходимоеДействие(ТекущийСтатусПроекта, ВыбранныйСтатус);
	ДокументРегистраторНовогоСтатуса = СтруктураДействие.НеобходимоеДействие;	
	ОтобразитьФормуДокумента = СтруктураДействие.ОтобразитьФормуДокумента;
	
	Если Не ЗначениеЗаполнено(ДокументРегистраторНовогоСтатуса) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСтатуса = Новый Структура;
	ПараметрыСтатуса.Вставить("ДокументРегистраторНовогоСтатуса", ДокументРегистраторНовогоСтатуса);
	ПараметрыСтатуса.Вставить("РегистраторТекущегоСтатуса", РегистраторТекущегоСтатуса);
	ПараметрыСтатуса.Вставить("ОтобразитьФормуДокумента", ОтобразитьФормуДокумента);
	ПараметрыСтатуса.Вставить("Проект", Проект);
			
	Если КоличествоОткрытыхСвязанныхОбъектовПроекта(Проект) Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьСтатусЗавершение", ЭтотОбъект, ПараметрыСтатуса);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Имеются несохраненные данные по проекту. Сохранить?'"),
		РежимДиалогаВопрос.ДаНетОтмена, 60, КодВозвратаДиалога.Нет);
	Иначе
		
		Отказ = Ложь;
		ДанныеРасшифровкиСообщения = Новый Структура;
		ДанныеРасшифровкиСообщения.Вставить("ИмяДокумента", ДокументРегистраторНовогоСтатуса);
		
		ЕстьОшибки = упоПроектыИЗадачиВызовСервера.ЕстьОшибкиСтруктурыПроекта(Проект, ДанныеРасшифровкиСообщения, Отказ);
		ПараметрыСтатуса.Вставить("ПроверкаСтруктурыПроектаПройдена", Истина);
		Если Отказ Тогда
			Если Не ЕстьОшибки Тогда
				Возврат;
			Иначе
				ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьУтверждениеПослеВопроса", ЭтотОбъект, ПараметрыСтатуса);
				ТекстВопроса = НСтр("ru = 'Обнаружены конфликты. Продолжить утверждение проекта?'");
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			КонецЕсли;
		Иначе										
			ИзменитьСтатусЗавершение(КодВозвратаДиалога.Нет, ПараметрыСтатуса);
		КонецЕсли;
		
	КонецЕсли;

		
КонецПроцедуры

Процедура ИзменитьСтатусЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ДокументРегистраторНовогоСтатуса = ДополнительныеПараметры.ДокументРегистраторНовогоСтатуса;
	РегистраторТекущегоСтатуса = ДополнительныеПараметры.РегистраторТекущегоСтатуса;
	Проект = ДополнительныеПараметры.Проект;
	ОтобразитьФормуДокумента = ДополнительныеПараметры.ОтобразитьФормуДокумента;
	
	ПроверкаСтруктурыПроектаПройдена = Неопределено;
	Если ДополнительныеПараметры.Свойство("ПроверкаСтруктурыПроектаПройдена") Тогда
		ПроверкаСтруктурыПроектаПройдена = ДополнительныеПараметры.ПроверкаСтруктурыПроектаПройдена;
	КонецЕсли;
	
	МожноСохранитьВерсиюПроекта = Истина;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	    МожноСохранитьВерсиюПроекта = ЗаписаныОткрытыеСвязанныеОбъектыПроекта(Проект);
	КонецЕсли;
			
	Если МожноСохранитьВерсиюПроекта Тогда
		СоздатьДокумент(ДокументРегистраторНовогоСтатуса, РегистраторТекущегоСтатуса, Проект, ОтобразитьФормуДокумента,
			ПроверкаСтруктурыПроектаПройдена);	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьДокумент(ИмяДокумента, РегистраторТекущегоСтатуса, Проект, ОтобразитьФормуДокумента, 
	ПроверкаСтруктурыПроектаПройдена = Неопределено)
	
	Если ОтобразитьФормуДокумента Тогда
		
		ОткрытьФорму("Документ." + ИмяДокумента + ".Форма.ФормаДокументаУправляемая", 
			Новый Структура("Основание", ?(ЗначениеЗаполнено(РегистраторТекущегоСтатуса), РегистраторТекущегоСтатуса, Проект)));
		
	Иначе
			
		Если упоПроектыИЗадачиВызовСервера.
				СоздатьПровестиДокументСменыСтатуса(ИмяДокумента, РегистраторТекущегоСтатуса, Проект, 
					ПроверкаСтруктурыПроектаПройдена) Тогда
			Оповестить("СменаСтатусаПроекта", Проект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПродолжитьУтверждениеПослеВопроса(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьСтатусЗавершение(КодВозвратаДиалога.Нет, Параметры);
	
КонецПроцедуры

#КонецОбласти