////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с диалогами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Записывает в журнал регистрации текст выводимого на экран сообщения, вопроса и т.п.,
// если установлено соответствующее право.
// Можно использовать для дополнительного контроля действий пользователя.
//
// Параметры:
//  СписокПараметров - Структура - структура параметров для записи в ЖР.
//
Процедура ЗаписатьВЖурналРегистрации(СписокПараметров) Экспорт
	
	Данные = Неопределено;
	СписокПараметров.Свойство("Данные", Данные);
	
	ОбъектМетаданных = Неопределено;
	СписокПараметров.Свойство("ОбъектМетаданных", ОбъектМетаданных);	
	
	Если ОбъектМетаданных = Неопределено И Данные <> Неопределено Тогда
		
		ОбъектМетаданных = Данные.Метаданные();
		
	КонецЕсли; 	
		
	ЗаписьЖурналаРегистрации(СписокПараметров.Событие,
							 СписокПараметров.Уровень,
							 ОбъектМетаданных,
							 Данные,
							 СписокПараметров.Комментарий);
	
КонецПроцедуры

// Функция формирует заголовок для сообщения об ошибке заполнения.
//
// Параметры:
//  ЭтотОбъект	 - СправочникОбъект, ДокументОбъект
// 
// Возвращаемое значение:
//  Строка
//
Функция СформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект) Экспорт
	
	// Пока разделим объекты на три категории: регистры сведений, документы и справочники.
	Если Метаданные.РегистрыСведений.Содержит(ЭтотОбъект.Метаданные()) Тогда
		Возврат НСтр("ru = 'Операция записи регистра '") + СокрЛП(ЭтотОбъект.Метаданные().Представление()) + НСтр("ru = ' не выполнена!'");
	ИначеЕсли Метаданные.Документы.Содержит(ЭтотОбъект.Метаданные()) Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
			ПредставлениеДокумента = упоСервисныеФункцииСервер.ПолучитьСтроковоеПредставление(ЭтотОбъект.Ссылка);
		Иначе 
			ПредставлениеДокумента = Строка(ЭтотОбъект);
		КонецЕсли;	
		Возврат НСтр("ru = 'Операция записи документа '") + ПредставлениеДокумента + НСтр("ru = ' не выполнена!'");
	ИначеЕсли Метаданные.Справочники.Содержит(ЭтотОбъект.Метаданные()) Тогда
        Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
			ПредставлениеСправочника = Строка(ЭтотОбъект.Ссылка);
		Иначе 
			ПредставлениеСправочника = Строка(ЭтотОбъект);
		КонецЕсли;
		Возврат НСтр("ru = 'Операция записи элемента '") + ПредставлениеСправочника + НСтр("ru = ' не выполнена!'");
	Иначе
		Возврат НСтр("ru = 'Операция записи не выполнена!'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти