
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура для вызова при подборе ресурсов в табличную часть "МатериальныеРесурсы".
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти	 - строка табличной части "МатериальныеРесурсы". 
//  ПараметрыПодбора	 - Структура - не используется.
//
Процедура ВыполнитьДействияПриПодборе(Знач СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт
	
КонецПроцедуры

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
		
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет все необходимые данные документа для его записи в ИБ.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
// 
Процедура ПроверитьДанныеПередЗаписью(Отказ) Экспорт
	
	// Получим заголовок для сообщения об ошибках при записи объекта.
	Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	
	// Проверяем заполненность обязательных реквизитов.
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет все необходимые данные документа для его проведения.
// 
// Параметры: 
//  ДанныеДокумента - Структура - содержит слепок документа.
//  Отказ           - Булево	- признак отказа от выполнения операции.
//  Заголовок       - Строка	- содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
//  Заголовок    - Строка - Содержит заголовок сообщения.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура(); // Нет внутренних печатных форм.
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт
	
	ПравилаНаложения = Новый Структура();
	
	// Правила для регистра "ФактВыполненияОбъемов".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоФактВыполненияОбъемовПоДням.Метаданные().Имя, Правила);
		
	// Правила для регистра "упоВыполненныеПринятыеОбъемы".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоВыполненныеПринятыеОбъемы", Правила);
	
	// Правила для регистра "упоФактВыполненияОбъемовОбороты".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоФактВыполненияОбъемовОбороты", Правила);
	
	Возврат ПравилаНаложения; 
	
КонецФункции

// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт
	
	ЗапросФактСубпродуктов = Новый Запрос;
	ЗапросФактСубпродуктов.Текст = "ВЫБРАТЬ
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ПроектнаяЗадача.Проект КАК Проект,
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ПроектнаяЗадача,
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Номенклатура КАК Субпродукт,
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ДатаПоступления КАК День,
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ЕдиницаИзмерения,
	                               |	1 КАК Коэффициент,
	                               |	СУММА(упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Количество) КАК Количество,
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Валюта,
	                               |	СУММА(упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Сумма) КАК СуммаВалютная
	                               |ИЗ
	                               |	Документ.упоСинхронизацияФактическиВыполненныхОбъемов.ДоходныеОбъемы КАК упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы
	                               |ГДЕ
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Ссылка = &Ссылка
	                               |
	                               |СГРУППИРОВАТЬ ПО
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ПроектнаяЗадача.Проект,
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ПроектнаяЗадача,
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Номенклатура,
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ДатаПоступления,
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ЕдиницаИзмерения,
	                               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Валюта";
	ЗапросФактСубпродуктов.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = ЗапросФактСубпродуктов.Выполнить().Выбрать();
	пВалютаУпр = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	
	Пока Выборка.Следующий() Цикл
		
		Движение = ДанныеДвижений["упоФактВыполненияОбъемовПоДням"].Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Сумма = упоМодульВалютногоУчета.ПересчитатьСумму(Выборка.СуммаВалютная, Выборка.Валюта, пВалютаУпр, Дата);
		
	КонецЦикла;
	
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВложенныйЗапрос.ПроектнаяЗадача.Проект КАК Проект
	               |ПОМЕСТИТЬ ВТ_Проекты
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |	ИЗ
	               |		Документ.упоСинхронизацияФактическиВыполненныхОбъемов.ДоходныеОбъемы КАК упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы
	               |	ГДЕ
	               |		упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Ссылка = &Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ПроектнаяЗадача
	               |	ИЗ
	               |		Документ.упоСинхронизацияФактическиВыполненныхОбъемов.РасходныеОбъемы КАК упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы
	               |	ГДЕ
	               |		упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ 
	               |	ВТ_Проекты.Проект КАК Проект,
	               |	упоВерсииПроекта.Версия КАК ТекВерсия,
	               |	ВТ_Проекты.Проект.КонтрагентДоходов КАК КонтрагентДоходов,
	               |	ВТ_Проекты.Проект.ДоговорДоходов КАК ДоговорДоходов
	               |ИЗ
	               |	ВТ_Проекты КАК ВТ_Проекты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО ВТ_Проекты.Проект = упоВерсииПроекта.Проект
	               |			И (упоВерсииПроекта.Текущая)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбщиеНастройкиПроведения = Новый Структура;
	упоАналитикаПоПодразделениямСервер.ЗаполнитьОбщиеНастройкиУчетаПоПодразделениям(ЭтотОбъект, ОбщиеНастройкиПроведения);
	
	Пока Выборка.Следующий() Цикл		
		СвойстваПроведения = Новый Структура;
		СвойстваПроведения.Вставить("Проект", Выборка.Проект);
		СвойстваПроведения.Вставить("Версия", Выборка.ТекВерсия);
		СвойстваПроведения.Вставить("ПроектнаяЗадача", Неопределено);
		СвойстваПроведения.Вставить("КонтрагентЗатрат", Выборка.КонтрагентДоходов);
		СвойстваПроведения.Вставить("ДоговорЗатрат", Выборка.ДоговорДоходов);
		
		Для Каждого КлючЗначение Из ОбщиеНастройкиПроведения Цикл
			СвойстваПроведения.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);	
		КонецЦикла;

		СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Выборка.Проект);
		
		упоАналитикаПоПодразделениямСервер.ПодготовитьТаблицыДвижений(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ);		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект - содержит сам объект.
//  СтандартнаяОбработка – Булево - признак выполнения стандартной (системной) обработки события.
//  Префикс      – Строка - префикс, который будет использоваться для генерации номера.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  ОбъектКопирования – ДокументОбъект - исходный документ, который является источником копирования. 
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Основание    - Произвольный 	- значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево 			- признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево 			- признак удаления документа.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак отмены проведения документа.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = Справочники.Проекты.ПустаяСсылка();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли